[
  {
    "id": "1km4r8p",
    "title": "Should I go to a frat formal with my ex-friends ex boyfriend?",
    "text": "Hi! New poster but I need some help. I had this one friend, lets call her B. B and I have been friends for around 4 years. We had some personal issues revolving respecting boundaries and ultimately, I felt like I couldnt be around her anymore and we parted ways. I never fully confronted or explained my position to her, so we arent on bad terms per se, but we arent on very friendly terms anymore. I have no desire to try and regain or continue that friendship. We havent been friends for around 6 months, but even before then we had been slowly drifting apart. 6 months ago, B was dating this guy, lets call him J. I met J, didnt really like him but I also didnt really care. Fast forward to the present. I started working with J and found that hes actually a decent person. Were pretty friendly and I found out that J and B broke up around a month and a half ago. I dont know who broke up with who. Now, J is looking for a date to his frats formal. I was talking with one of our colleagues and they said that J asked them to the formal but they rejected him. They said theyre already interested in someone else. Today, J asked me if I would be interested in going as friends/colleagues to the formal with him. I havent responded yet. Im currently leaning towards going. I like J, though I have zero romantic interest in him and feel like it would be fun. Ive asked several different people and gotten mixed responses. The only thing holding me back is the reaction from my coworkers. Many of them know B, and know that I was friends with B. Im worried about the social backlash, as I dont want to seem like a backstabbing friend, even though B and I arent technically friends and havent been for a while. But, on the other hand, Ill be leaving this job in around a month, so any social backlash wont really matter. What do you think? Should I go with J?",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/Advice/comments/1km4r8p/should_i_go_to_a_frat_formal_with_my_exfriends_ex/",
    "author": "Humblecows",
    "created_utc": 1747191039.0,
    "subreddit": "Advice",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-13T19:50:53.545283",
    "comments": [],
    "post_length": 1882,
    "title_length": 62,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Be Nice.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* No trolling, harassment, threats, hate-speech, triggering, rudeness, or other uncivil actions\n\n* No advocating violence\n\n* If you see someone being mean, please report them and move on\n\n* Gather your thoughts and emotions, do not snap at commenters who are just trying to help.\n\n* Know the difference between tough love, and being rude",
        "kind": "all",
        "priority": 0,
        "violation_reason": "Not Nice"
      },
      {
        "short_name": "Posts must ask for advice.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* Your post MUST have a clear question on what you need advice on\n\n* No asking for speculation\n\n* Posts that are purely ranting or venting don't belong here\n\n* No random, general, or hypothetical questions\n\n* Updates should be added as an edit to your original post, unless you are seeking additional advice\n\n* No asking for private chat/messages. Keep the conversation in r/Advice",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Not asking for advice"
      },
      {
        "short_name": "Forbidden Topics",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n**No topics requiring any sort of professional expertise:**\n\n* Medical advice\n\n* Therapizing or counseling\n\n* Legal advice\n\n* Insurance questions\n\n* Automotive / mechanic advice\n\n**Non-professional forbidden topics:**\n\n* Tech support\n\n* Homework or any schoolwork\n\n* Criticism of appearance or talents\n\n* Revenge\n\n* Posts about Reddit itself",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Forbidden topics"
      },
      {
        "short_name": "Follow the rules of Reddit.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\nAll rules of the Reddit Content Policy and User Agreement apply here.\n\n* No harassment, bullying, or inciting violence.\n\n* No spamming or ban evasion\n\n* Do not post personal or confidential information\n\n* No instigating doxxing, witch hunting, or brigading of any kind\n\n* No sexual content involving minors\n\n* The minimum age to use Reddit is 13\n\n* No posting about any sort of illegal activities.",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Violation of Reddit Rule"
      },
      {
        "short_name": "No discrimination.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n**No racism, sexism, misogyny, or misandry**\n\n* Generalizations, hate, or insensitivity based on race, nationality, sex, gender, or sexuality\n\n* Incel behavior, regardless of gender\n\n**No hate or insensitivity to LGBTQ+ people**\n\n* Homophobia or transphobia\n\n* Phobia towards queer, genderfluid, nonbinary, or any other genders\n\n* No discrimination based on any other factors, beliefs, or categorizations not listed",
        "kind": "all",
        "priority": 4,
        "violation_reason": "Discrimination"
      },
      {
        "short_name": "Give OP the benefit of the doubt.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* Offer only advice, not judgement, scrutiny, or disbelief\n\n* No victim blaming or shaming\n\n* Do not try to call people out in the comments. If you believe a post is fake or lying, report it and move on.",
        "kind": "comment",
        "priority": 5,
        "violation_reason": "Unnecessary Scrutiny"
      },
      {
        "short_name": "Only post twice per day in /r/advice",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\nTo reduce the effect of spammers and trolls, you are limited to two posts per day in /r/advice.",
        "kind": "link",
        "priority": 6,
        "violation_reason": "Posted more than twice today in /r/advice (submit proof to mods)."
      },
      {
        "short_name": "No reassurance, validation, or affirmation seeking",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\nThis subreddit is for advice, NOT moral judgement, validation, affirming your opinions/feelings, or settling arguments\n\n* No AITA posts or AITA abbreviations.\n\n* No asking if you are right or wrong in a situation\n\n* No asking if your feelings are justified\n\n* No asking if you're overthinking, overreacting, being paranoid, etc.\n\nThis is not an all-inclusive list. See full rule for more",
        "kind": "link",
        "priority": 7,
        "violation_reason": "Reassurance Seeking"
      },
      {
        "short_name": "No Spam",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* No reposting without moderator approval\n\n* Do not put any external links in your post\n\n* No shitposting, fake posts, or joke posts. Get a life.\n\n* No asking for money or donations of any kind\n\n* No self promotion of any kind\n\n* No advertising of any kind, including posting referral links.\n\n* No asking for survey/research/interview participation",
        "kind": "all",
        "priority": 8,
        "violation_reason": "Spam"
      },
      {
        "short_name": "No suicide or self harm posts",
        "description": "This subreddit will not host any posts about suicide or self harm. Please post in r/SuicideWatch or utilize the hotlines below. \n\nHelping a suicidal person requires training and skill sets that the average person does not possess. Unqualified users may have good intentions, but might inadvertently worsen the situation and/or strain their own mental health significantly.\n\nSimilarly, self harm is a complex and deeply-rooted behavior that the average person is not equipped to help with.",
        "kind": "link",
        "priority": 9,
        "violation_reason": "No suicide or self harm posts"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T00:33:20.854647",
    "hours_tracked": 4.698591628273328
  },
  {
    "id": "1km543v",
    "title": "I F/22 have been asked to a frat formal by my ex-friends F/22 ex-boyfriend M/21",
    "text": "Description: I had this one friend, lets call her B. B and I have been friends for around 4 years. We had some personal issues revolving respecting boundaries and ultimately, I felt like I couldnt be around her anymore and we parted ways. I never fully confronted or explained my position to her, so we arent on bad terms per se, but we arent on very friendly terms anymore. I have no desire to try and regain or continue that friendship. We havent been friends for around 6 months, but even before then we had been slowly drifting apart. 6 months ago, B was dating this guy, lets call him J. I met J, didnt really like him but I also didnt really care. Fast forward to the present. I started working with J and found that hes actually a decent person. Were pretty friendly and I found out that J and B broke up around a month and a half ago. I dont know who broke up with who. Now, J is looking for a date to his frats formal. I was talking with one of our colleagues and they said that J asked them to the formal but they rejected him. They said theyre already interested in someone else. I do feel a bit bad for him, as Im sure it isnt easy asking someone out. Today, J asked me if I would be interested in going as friends/colleagues to the formal with him. I havent responded yet. Im currently leaning towards going. I like J, though I have zero romantic interest in him and feel like it would be fun. Ive asked several different people and gotten mixed responses. The only thing holding me back is the reaction from my coworkers. Many of them know B, and know that I was friends with B. Im worried about the social backlash, as I dont want to seem like a backstabbing asshole, even though B and I arent technically friends and havent been for a while. But, on the other hand, Ill be leaving this job in around a month, so any social backlash wont really matter. tldr My old friends boyfriend, whom I now work with, asked me to go with him to a frat formal as friends. Im worried about the social repercussions of going with him. Question: Would going with J have severe social backlash?",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/relationship_advice/comments/1km543v/i_f22_have_been_asked_to_a_frat_formal_by_my/",
    "author": "Humblecows",
    "created_utc": 1747192150.0,
    "subreddit": "relationship_advice",
    "score": 1,
    "num_comments": 1,
    "timestamp_collected": "2025-05-13T20:09:21.650291",
    "comments": [],
    "post_length": 2124,
    "title_length": 86,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Posts must contain a title, description, TLDR, & basic info like ages, genders",
        "description": "Posts MUST include: \n\n* A title that summarizes the problem or question. This is where the ages/genders should be placed.\n* A description of your situation.\n* A question or a request for what advice you want.\n* Length of Relationship\n* A brief [**tl;dr**](http://en.wiktionary.org/wiki/TLDR) if your post is long.\n\nExamples of ages/genders in the title:\n\n- I [24M] have an issue with my aunt, [45F]\n\n- My partner [19NB] told me [21MtF]\n\n- I [45F] love my husband [51M]",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Post does not feature detailed information, or lacks a descriptive title, tldr, or similar"
      },
      {
        "short_name": "All posts must request specific advice on a specific, real situation between two or more people",
        "description": "We do not allow vague requests for advice such as:\n\n- What would you do?\n\n- What should I do?\n\n- Any advice would be appreciated\n\nLikewise, we do not allow:\n\n- Vents/rants\n\n- Posts about past or potential relationships\n\n- Posts giving advice\n\nLastly, this subreddit relies on honesty. If your content is in any capacity dishonest (examples include: chatGPT posts, creative writing, profile inconsistencies) it will be removed and you will be banned.",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Post does not request advice on a real situation between two or more people."
      },
      {
        "short_name": "No questions that can be answered with yes or no (aka moral judgment)",
        "description": "Your post is a yes or no question (aka moral judgement) if your question starts with or contains any of the following:\n\n- Is it...?\n\n- Asking if you or the subject of the post is right or wrong.\n\n- Am I....?\n\n- Any variation of “Am I The Asshole?”, including AITA\n\n- Does/Have anybody else...?\n\n- Should I…?\n\n- Would you....?\n\n- Is this.....?\n\n- Can I...?\n\n\n#If the question in your post can be answered with a yes or no question, it is moral judgement and will be removed.",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Yes or no/ Moral Judgement Request"
      },
      {
        "short_name": "Things This Sub Can't Give Advice On:",
        "description": "Rants, unsolicited advice, letters to an ex, \"body counts\" or number of sexual partners, mental health issues, medical health issues, legal problems, financial problems, any situations involving minors (under 18 regardless of local laws), and any situations involving abuse (violence, sexual, emotional etc). All of these will be removed and locked.",
        "kind": "link",
        "priority": 3,
        "violation_reason": "Not Applicable to the Sub"
      },
      {
        "short_name": "Only One Update Is Allowed",
        "description": "You can submit **one** update post at any time after 48 hours has past from the original post. \n\nAdditional advice may be requested in new posts but they may not be continuations of the orignal one. E.g. no titles saying \"Update 2\" or \"Update 4\". We're not a blog. Please post further updates on your own profile.",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Too many updates"
      },
      {
        "short_name": "Surveys, Academic Research, Information Requests, and Media Questions Should Be Sent to Modmail",
        "description": "Surveys, information requests, and journalistic or academic research questions must be sent to [modmail](https://www.reddit.com/message/compose?to=/r/relationship_advice) prior to posting.  If you are doing academic research, message us with your IRB number, a point of contact for us to verify your pending research, and the details of your research for consideration. Press Requests must be routed through modmail, via u/eganist , before communicating with users directly.",
        "kind": "link",
        "priority": 5,
        "violation_reason": "Surveys, Academic Research, Information Requests, and Media Questions Should Be Sent to Modmail"
      },
      {
        "short_name": "All comments must be on topic, and focus on the OP, and be made in good faith",
        "description": "Derailing arguments, jokes fighting, and moral whataboutism is not allowed. Give good, ethical advice. Remember, the goal is to help your fellow human.",
        "kind": "all",
        "priority": 6,
        "violation_reason": "derailing, fighting, whataboutism, or not in good faith"
      },
      {
        "short_name": "Keep It Civil",
        "description": "No insults, no threats of violence, no encouraging violence, no telling an OP to go to punch someone else, no threats, no harassment, no trolling, no advertising other subs, no spam. You will be banned. \n\nAll bans in this sub are permanent. You don't get a free pass.\n\nFor more information, please see our [rules](https://www.reddit.com/r/relationship_advice/wiki/rules#wiki_rule_8)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Insults, violence, harassment, trolling, spam"
      },
      {
        "short_name": "No referencing hateful or abusive subs/individuals/content",
        "description": "**No referencing hateful or abusive subs/individuals and content**. No advocating for or referencing content that is conspiratorial in nature, transphobic, anti-women/men, anti-LBGT+, that promote anti-vaxx or anti-science content, or contains harmful rhetoric against groups of people. Think includes linking to subs that feature this. You will be banned. You don't get a free pass. \n\n[Further information](https://www.reddit.com/r/relationship_advice/wiki/rules#wiki_rule_9)",
        "kind": "all",
        "priority": 8,
        "violation_reason": "references hateful/abusive content/subs/individuals"
      },
      {
        "short_name": "Do not directly message users",
        "description": "If you wish to opine on the matter at hand, you are to comment on the post. Users found to be privately messaging other users to circumvent this directive will be met with a permanent, irrevocable ban. \n\n**If a user has sent you harassing messages, please upload your screenshot to Imgur.com, and notify the mods via modmail. We will action the user accordingly.**",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Do not directly message users"
      },
      {
        "short_name": "No situations involving people under 18",
        "description": "Your content has been removed because it involves a situation with someone under the age of 18. Please note that changing your ages to get around this rule will result in an immediate ban.\n\nPlease consider posting this to our sister subreddit, r/teenrelationships",
        "kind": "link",
        "priority": 10,
        "violation_reason": "No situations involving people under 18"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T00:35:59.005134",
    "hours_tracked": 4.390789087414742
  },
  {
    "id": "1km6j8m",
    "title": "What is happening to the generation now?",
    "text": "",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/AskReddit/comments/1km6j8m/what_is_happening_to_the_generation_now/",
    "author": "LimeSoakedinSprite",
    "created_utc": 1747196961.0,
    "subreddit": "AskReddit",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-13T21:29:36.981720",
    "comments": [],
    "post_length": 0,
    "title_length": 40,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Rule 1 - Questions must be clear and direct and may not use the body textbox",
        "description": "* All questions must be clear, written in English, and conclude with a question mark\n* All context in the title must be ***necessary to understanding the question***; do not give “example answers” in the post title (i.e. “Other than your mom, \\_\\_\\_\\_\\_\\_?”)\n* No text in the text box - any additional info from you must be added as a comment to your post\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_1-)",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Rule 1 - Questions must be clear and direct and may not use the body textbox"
      },
      {
        "short_name": "Rule 2 - No personal or professional advice requests",
        "description": "* Askreddit is NOT your personal or professional advice platform\n\n* Do not makes posts asking for professional advice - medical, legal, financial, or otherwise\n\n* All posts asking for advice must be generic and not specific to your situation alone\n\n* Do not use first person pronouns\n\n* No crowdsourcing naming or purchasing decisions\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_2-)",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Rule 2 - No personal or professional advice requests"
      },
      {
        "short_name": "Rule 3 - Open ended questions only",
        "description": "* Post must be an open-ended discussion question\n\n* Title must not be phrased to allow a simple yes/no answer\n\n* No questions that have definite answers\n\n* Question must not be a poll or survey\n\n* No “Either/Or” type questions\n\n* Do not ask for NSFW links\n\n* Do not specify a length (eg \"in three words...\") or make your post into a game\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_3-)",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Rule 3 - Open ended questions only"
      },
      {
        "short_name": "Rule 4 - No personal info",
        "description": "* Do not post or seek any **real or fake** personal information (examples include: full names, phone numbers, email addresses, or social media accounts)\n\n* Only link another user's comment when it is relevant and **never** when it is to launch a personal attack or encourage others to do so\n\n* Do not ask questions designed to target specific usernames or links to social media\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_4-)",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Rule 4 - No personal info"
      },
      {
        "short_name": "Rule 5 - No loaded questions",
        "description": "- Do not include an opinion, bias, or lead respondents towards expressing a specific opinion in your post title\n\n- Do not use this subreddit to promote a specific agenda or to gain positive or negative publicity for an entity or person\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_5-)",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Rule 5 - No loaded questions"
      },
      {
        "short_name": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies",
        "description": "* [Serious] posts are off-limits for joke replies and irrelevant or off-topic comments and discussion\n\n* If the OP asks for answers from a specific group in a [Serious] post, top level comments must be made from members of that group\n\n* Posts that do not receive relevant answers within an hour will be removed\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_6-)",
        "kind": "all",
        "priority": 5,
        "violation_reason": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies"
      },
      {
        "short_name": "Rule 7 - No begging for goods or services, or Reddit rewards",
        "description": "* Do not ask for Reddit rewards, money, goods, services,or favors\n\n* Do not form a brigade to draw positive or negative attention to posts or comments in AskReddit, even from other subreddits\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_7-)",
        "kind": "all",
        "priority": 6,
        "violation_reason": "Rule 7 - No begging for goods or services, or Reddit rewards"
      },
      {
        "short_name": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner",
        "description": "* Do not make personal attacks, insult, or demean a specific group or person\n\n* Do not use slurs without relevant context and quotes\n\n* No blatant statements of bigotry\n\n* No posts that 'bait' users into breaking other rules\n\n* Zero tolerance for posts/comments that sexualize minors\n\n* Zero tolerance for posts/comments that encourage suicide\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_8-)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner"
      },
      {
        "short_name": "Rule 9 -  No image only replies or large ascii art",
        "description": "* Comment replies must consist of more than just an image or link\n\n* No ASCII/emoji images over one line\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_9-)",
        "kind": "comment",
        "priority": 8,
        "violation_reason": "Rule 9 -  No image only replies or large ascii art"
      },
      {
        "short_name": "Rule 10 - Harmful Misinformation",
        "description": "* Do not downplay the effects of a medical crisis\n* Do not undermine the efficacy of vaccines where there is widespread agreement among the medical and scientific communities\n* Do not encourage illegal activity\n* Do not encourage delayed medical treatment\n\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-harmful_misinformation-)",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Rule 10 - Harmful Misinformation"
      },
      {
        "short_name": "Rule 11 - No spam, machine generated content or karma farming",
        "description": "* Do not post spam\n* Do not edit comments to mislead and/or advertise\n* Do not farm karma or shotgun comments\n* Bots are not allowed in r/AskReddit\n\n[The full rule can be viewed here](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_11-)",
        "kind": "all",
        "priority": 10,
        "violation_reason": "Rule 11 - No spam, machine generated content or karma farming"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T00:44:52.119572",
    "hours_tracked": 3.0531964851750266
  },
  {
    "id": "1km8lti",
    "title": "Virginia Giuffre, a key Epstein accuser who once tweeted she has no intention in ending her life was found in her home passed away by just that 19 days ago. Do you believe this was just a coincidence, or is there more to the story than we know?",
    "text": "",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/AskReddit/comments/1km8lti/virginia_giuffre_a_key_epstein_accuser_who_once/",
    "author": "pimpyocean",
    "created_utc": 1747204997.0,
    "subreddit": "AskReddit",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-13T23:43:32.099740",
    "comments": [],
    "post_length": 0,
    "title_length": 244,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Rule 1 - Questions must be clear and direct and may not use the body textbox",
        "description": "* All questions must be clear, written in English, and conclude with a question mark\n* All context in the title must be ***necessary to understanding the question***; do not give “example answers” in the post title (i.e. “Other than your mom, \\_\\_\\_\\_\\_\\_?”)\n* No text in the text box - any additional info from you must be added as a comment to your post\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_1-)",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Rule 1 - Questions must be clear and direct and may not use the body textbox"
      },
      {
        "short_name": "Rule 2 - No personal or professional advice requests",
        "description": "* Askreddit is NOT your personal or professional advice platform\n\n* Do not makes posts asking for professional advice - medical, legal, financial, or otherwise\n\n* All posts asking for advice must be generic and not specific to your situation alone\n\n* Do not use first person pronouns\n\n* No crowdsourcing naming or purchasing decisions\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_2-)",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Rule 2 - No personal or professional advice requests"
      },
      {
        "short_name": "Rule 3 - Open ended questions only",
        "description": "* Post must be an open-ended discussion question\n\n* Title must not be phrased to allow a simple yes/no answer\n\n* No questions that have definite answers\n\n* Question must not be a poll or survey\n\n* No “Either/Or” type questions\n\n* Do not ask for NSFW links\n\n* Do not specify a length (eg \"in three words...\") or make your post into a game\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_3-)",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Rule 3 - Open ended questions only"
      },
      {
        "short_name": "Rule 4 - No personal info",
        "description": "* Do not post or seek any **real or fake** personal information (examples include: full names, phone numbers, email addresses, or social media accounts)\n\n* Only link another user's comment when it is relevant and **never** when it is to launch a personal attack or encourage others to do so\n\n* Do not ask questions designed to target specific usernames or links to social media\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_4-)",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Rule 4 - No personal info"
      },
      {
        "short_name": "Rule 5 - No loaded questions",
        "description": "- Do not include an opinion, bias, or lead respondents towards expressing a specific opinion in your post title\n\n- Do not use this subreddit to promote a specific agenda or to gain positive or negative publicity for an entity or person\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_5-)",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Rule 5 - No loaded questions"
      },
      {
        "short_name": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies",
        "description": "* [Serious] posts are off-limits for joke replies and irrelevant or off-topic comments and discussion\n\n* If the OP asks for answers from a specific group in a [Serious] post, top level comments must be made from members of that group\n\n* Posts that do not receive relevant answers within an hour will be removed\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_6-)",
        "kind": "all",
        "priority": 5,
        "violation_reason": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies"
      },
      {
        "short_name": "Rule 7 - No begging for goods or services, or Reddit rewards",
        "description": "* Do not ask for Reddit rewards, money, goods, services,or favors\n\n* Do not form a brigade to draw positive or negative attention to posts or comments in AskReddit, even from other subreddits\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_7-)",
        "kind": "all",
        "priority": 6,
        "violation_reason": "Rule 7 - No begging for goods or services, or Reddit rewards"
      },
      {
        "short_name": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner",
        "description": "* Do not make personal attacks, insult, or demean a specific group or person\n\n* Do not use slurs without relevant context and quotes\n\n* No blatant statements of bigotry\n\n* No posts that 'bait' users into breaking other rules\n\n* Zero tolerance for posts/comments that sexualize minors\n\n* Zero tolerance for posts/comments that encourage suicide\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_8-)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner"
      },
      {
        "short_name": "Rule 9 -  No image only replies or large ascii art",
        "description": "* Comment replies must consist of more than just an image or link\n\n* No ASCII/emoji images over one line\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_9-)",
        "kind": "comment",
        "priority": 8,
        "violation_reason": "Rule 9 -  No image only replies or large ascii art"
      },
      {
        "short_name": "Rule 10 - Harmful Misinformation",
        "description": "* Do not downplay the effects of a medical crisis\n* Do not undermine the efficacy of vaccines where there is widespread agreement among the medical and scientific communities\n* Do not encourage illegal activity\n* Do not encourage delayed medical treatment\n\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-harmful_misinformation-)",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Rule 10 - Harmful Misinformation"
      },
      {
        "short_name": "Rule 11 - No spam, machine generated content or karma farming",
        "description": "* Do not post spam\n* Do not edit comments to mislead and/or advertise\n* Do not farm karma or shotgun comments\n* Bots are not allowed in r/AskReddit\n\n[The full rule can be viewed here](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_11-)",
        "kind": "all",
        "priority": 10,
        "violation_reason": "Rule 11 - No spam, machine generated content or karma farming"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "moderator",
    "raw_banned_by": null,
    "raw_author_is_none": false,
    "raw_selftext_value": null,
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T00:58:12.828999",
    "hours_tracked": 0.8212192377116945
  },
  {
    "id": "1km8pgu",
    "title": "How can one stop bedrotting?",
    "text": "",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/AskReddit/comments/1km8pgu/how_can_one_stop_bedrotting/",
    "author": "properpeanut14",
    "created_utc": 1747205414.0,
    "subreddit": "AskReddit",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-13T23:50:34.455477",
    "comments": [],
    "post_length": 0,
    "title_length": 28,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Rule 1 - Questions must be clear and direct and may not use the body textbox",
        "description": "* All questions must be clear, written in English, and conclude with a question mark\n* All context in the title must be ***necessary to understanding the question***; do not give “example answers” in the post title (i.e. “Other than your mom, \\_\\_\\_\\_\\_\\_?”)\n* No text in the text box - any additional info from you must be added as a comment to your post\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_1-)",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Rule 1 - Questions must be clear and direct and may not use the body textbox"
      },
      {
        "short_name": "Rule 2 - No personal or professional advice requests",
        "description": "* Askreddit is NOT your personal or professional advice platform\n\n* Do not makes posts asking for professional advice - medical, legal, financial, or otherwise\n\n* All posts asking for advice must be generic and not specific to your situation alone\n\n* Do not use first person pronouns\n\n* No crowdsourcing naming or purchasing decisions\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_2-)",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Rule 2 - No personal or professional advice requests"
      },
      {
        "short_name": "Rule 3 - Open ended questions only",
        "description": "* Post must be an open-ended discussion question\n\n* Title must not be phrased to allow a simple yes/no answer\n\n* No questions that have definite answers\n\n* Question must not be a poll or survey\n\n* No “Either/Or” type questions\n\n* Do not ask for NSFW links\n\n* Do not specify a length (eg \"in three words...\") or make your post into a game\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_3-)",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Rule 3 - Open ended questions only"
      },
      {
        "short_name": "Rule 4 - No personal info",
        "description": "* Do not post or seek any **real or fake** personal information (examples include: full names, phone numbers, email addresses, or social media accounts)\n\n* Only link another user's comment when it is relevant and **never** when it is to launch a personal attack or encourage others to do so\n\n* Do not ask questions designed to target specific usernames or links to social media\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_4-)",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Rule 4 - No personal info"
      },
      {
        "short_name": "Rule 5 - No loaded questions",
        "description": "- Do not include an opinion, bias, or lead respondents towards expressing a specific opinion in your post title\n\n- Do not use this subreddit to promote a specific agenda or to gain positive or negative publicity for an entity or person\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_5-)",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Rule 5 - No loaded questions"
      },
      {
        "short_name": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies",
        "description": "* [Serious] posts are off-limits for joke replies and irrelevant or off-topic comments and discussion\n\n* If the OP asks for answers from a specific group in a [Serious] post, top level comments must be made from members of that group\n\n* Posts that do not receive relevant answers within an hour will be removed\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_6-)",
        "kind": "all",
        "priority": 5,
        "violation_reason": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies"
      },
      {
        "short_name": "Rule 7 - No begging for goods or services, or Reddit rewards",
        "description": "* Do not ask for Reddit rewards, money, goods, services,or favors\n\n* Do not form a brigade to draw positive or negative attention to posts or comments in AskReddit, even from other subreddits\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_7-)",
        "kind": "all",
        "priority": 6,
        "violation_reason": "Rule 7 - No begging for goods or services, or Reddit rewards"
      },
      {
        "short_name": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner",
        "description": "* Do not make personal attacks, insult, or demean a specific group or person\n\n* Do not use slurs without relevant context and quotes\n\n* No blatant statements of bigotry\n\n* No posts that 'bait' users into breaking other rules\n\n* Zero tolerance for posts/comments that sexualize minors\n\n* Zero tolerance for posts/comments that encourage suicide\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_8-)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner"
      },
      {
        "short_name": "Rule 9 -  No image only replies or large ascii art",
        "description": "* Comment replies must consist of more than just an image or link\n\n* No ASCII/emoji images over one line\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_9-)",
        "kind": "comment",
        "priority": 8,
        "violation_reason": "Rule 9 -  No image only replies or large ascii art"
      },
      {
        "short_name": "Rule 10 - Harmful Misinformation",
        "description": "* Do not downplay the effects of a medical crisis\n* Do not undermine the efficacy of vaccines where there is widespread agreement among the medical and scientific communities\n* Do not encourage illegal activity\n* Do not encourage delayed medical treatment\n\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-harmful_misinformation-)",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Rule 10 - Harmful Misinformation"
      },
      {
        "short_name": "Rule 11 - No spam, machine generated content or karma farming",
        "description": "* Do not post spam\n* Do not edit comments to mislead and/or advertise\n* Do not farm karma or shotgun comments\n* Bots are not allowed in r/AskReddit\n\n[The full rule can be viewed here](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_11-)",
        "kind": "all",
        "priority": 10,
        "violation_reason": "Rule 11 - No spam, machine generated content or karma farming"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "moderator",
    "raw_banned_by": null,
    "raw_author_is_none": false,
    "raw_selftext_value": null,
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T00:59:04.905106",
    "hours_tracked": 0.7038987884918849
  },
  {
    "id": "1km8qsb",
    "title": "I 27F found out a few days ago that my partner 33M of almost 7 years cheated on me last year.",
    "text": "This will be long, apologies. For context, in the very beginning of our relationship I was 20 years old and he was 26. He is my first official boyfriend, and we moved together to a different country. Being very honest I am mature enough now to admit out relationship already started with him ommitting information from me regarding other people he was seeing and maybe even had a relationship with. Three months after we moved countries and were living together he was texting his ex telling her he missed fucking her while telling me he did not wanted sex with me because he was depressed he didnt have a job yet. At that point that destroyed me but I had no friends yet, no money left after the move so I stayed. It took me a while to recover from it, but it wasnt the first time, as I found out again he kept sexting online with people he knew and strangers. Last year was a strange one as he was away for at least a weekend every single month of the year until around October, always saying it were work meetings with work people. There was this girl always there, and I could feel something wasnt right, so I even asked him about her, who the hell is she and whats going on, but as usual he said she was just a friend. After he stopped going away, he came to me saying how depressed he was, that nothing made him happy anymore and that he was even thinking about klling himself, and that it has been a while since he was happy in our relationship. I said I too wasnt happy while telling him he needed to ask for help from professionals for the other matter. Asked what he wanted to do about our relationship, if he wanted to break up, if he wanted to take some time, if he wanted to try couples counselling, but he always has been someone who has a problem but never accepts any solution. So the months go by and things slowly start to get better. The past couple of months have been pretty chill and nice if I may, and we planned a trip to Japan later this year, which is something weve been wanting to do for ages. Until this weekend where I met a friend and she told me he cheated on me. We have a lot of mutual friends, and one of them works with her flatmate and he made a comment about him that made her friend question him, but she didnt know any more details. I meet this friend and ask him about it, if he knows anything and he says yes. Said that it apparently happened on one of the very first trips of last year, and that my partner told him that he had sorted things out with me as he told me and we talked, and we are good, which he obviously didnt. That girl comes to my mind and I go check her socials just to find out Ive been blocked by her. Why the hell someone Ive never met would just block me like that? Then I had my answer. This friend also mentioned that when he was talking about offing himself was because the girl dumped him. Apparently most of his friends know about it too. In a way, I wasnt even surprised but still obviously hurts like hell. I havent spoken to him yet, as I am not sure what to do about the trip. I already have invested a good amount of money in it, there is a friend in common coming over with us too, and ideally I still would like to go. Im not sure if I should just tell him now that I know and that I will be leaving as soon as I find myself a new place, if I should shut up and wait a few more months and do it after the trip, or if I should just leave him next month when he is travelling once more for another work event. I will also speak to my therapist and talk about it. What would be your advice, Reddit?",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/relationship_advice/comments/1km8qsb/i_27f_found_out_a_few_days_ago_that_my_partner/",
    "author": "heavenqueen__",
    "created_utc": 1747205563.0,
    "subreddit": "relationship_advice",
    "score": 1,
    "num_comments": 1,
    "timestamp_collected": "2025-05-13T23:52:56.597914",
    "comments": [],
    "post_length": 3617,
    "title_length": 93,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Posts must contain a title, description, TLDR, & basic info like ages, genders",
        "description": "Posts MUST include: \n\n* A title that summarizes the problem or question. This is where the ages/genders should be placed.\n* A description of your situation.\n* A question or a request for what advice you want.\n* Length of Relationship\n* A brief [**tl;dr**](http://en.wiktionary.org/wiki/TLDR) if your post is long.\n\nExamples of ages/genders in the title:\n\n- I [24M] have an issue with my aunt, [45F]\n\n- My partner [19NB] told me [21MtF]\n\n- I [45F] love my husband [51M]",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Post does not feature detailed information, or lacks a descriptive title, tldr, or similar"
      },
      {
        "short_name": "All posts must request specific advice on a specific, real situation between two or more people",
        "description": "We do not allow vague requests for advice such as:\n\n- What would you do?\n\n- What should I do?\n\n- Any advice would be appreciated\n\nLikewise, we do not allow:\n\n- Vents/rants\n\n- Posts about past or potential relationships\n\n- Posts giving advice\n\nLastly, this subreddit relies on honesty. If your content is in any capacity dishonest (examples include: chatGPT posts, creative writing, profile inconsistencies) it will be removed and you will be banned.",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Post does not request advice on a real situation between two or more people."
      },
      {
        "short_name": "No questions that can be answered with yes or no (aka moral judgment)",
        "description": "Your post is a yes or no question (aka moral judgement) if your question starts with or contains any of the following:\n\n- Is it...?\n\n- Asking if you or the subject of the post is right or wrong.\n\n- Am I....?\n\n- Any variation of “Am I The Asshole?”, including AITA\n\n- Does/Have anybody else...?\n\n- Should I…?\n\n- Would you....?\n\n- Is this.....?\n\n- Can I...?\n\n\n#If the question in your post can be answered with a yes or no question, it is moral judgement and will be removed.",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Yes or no/ Moral Judgement Request"
      },
      {
        "short_name": "Things This Sub Can't Give Advice On:",
        "description": "Rants, unsolicited advice, letters to an ex, \"body counts\" or number of sexual partners, mental health issues, medical health issues, legal problems, financial problems, any situations involving minors (under 18 regardless of local laws), and any situations involving abuse (violence, sexual, emotional etc). All of these will be removed and locked.",
        "kind": "link",
        "priority": 3,
        "violation_reason": "Not Applicable to the Sub"
      },
      {
        "short_name": "Only One Update Is Allowed",
        "description": "You can submit **one** update post at any time after 48 hours has past from the original post. \n\nAdditional advice may be requested in new posts but they may not be continuations of the orignal one. E.g. no titles saying \"Update 2\" or \"Update 4\". We're not a blog. Please post further updates on your own profile.",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Too many updates"
      },
      {
        "short_name": "Surveys, Academic Research, Information Requests, and Media Questions Should Be Sent to Modmail",
        "description": "Surveys, information requests, and journalistic or academic research questions must be sent to [modmail](https://www.reddit.com/message/compose?to=/r/relationship_advice) prior to posting.  If you are doing academic research, message us with your IRB number, a point of contact for us to verify your pending research, and the details of your research for consideration. Press Requests must be routed through modmail, via u/eganist , before communicating with users directly.",
        "kind": "link",
        "priority": 5,
        "violation_reason": "Surveys, Academic Research, Information Requests, and Media Questions Should Be Sent to Modmail"
      },
      {
        "short_name": "All comments must be on topic, and focus on the OP, and be made in good faith",
        "description": "Derailing arguments, jokes fighting, and moral whataboutism is not allowed. Give good, ethical advice. Remember, the goal is to help your fellow human.",
        "kind": "all",
        "priority": 6,
        "violation_reason": "derailing, fighting, whataboutism, or not in good faith"
      },
      {
        "short_name": "Keep It Civil",
        "description": "No insults, no threats of violence, no encouraging violence, no telling an OP to go to punch someone else, no threats, no harassment, no trolling, no advertising other subs, no spam. You will be banned. \n\nAll bans in this sub are permanent. You don't get a free pass.\n\nFor more information, please see our [rules](https://www.reddit.com/r/relationship_advice/wiki/rules#wiki_rule_8)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Insults, violence, harassment, trolling, spam"
      },
      {
        "short_name": "No referencing hateful or abusive subs/individuals/content",
        "description": "**No referencing hateful or abusive subs/individuals and content**. No advocating for or referencing content that is conspiratorial in nature, transphobic, anti-women/men, anti-LBGT+, that promote anti-vaxx or anti-science content, or contains harmful rhetoric against groups of people. Think includes linking to subs that feature this. You will be banned. You don't get a free pass. \n\n[Further information](https://www.reddit.com/r/relationship_advice/wiki/rules#wiki_rule_9)",
        "kind": "all",
        "priority": 8,
        "violation_reason": "references hateful/abusive content/subs/individuals"
      },
      {
        "short_name": "Do not directly message users",
        "description": "If you wish to opine on the matter at hand, you are to comment on the post. Users found to be privately messaging other users to circumvent this directive will be met with a permanent, irrevocable ban. \n\n**If a user has sent you harassing messages, please upload your screenshot to Imgur.com, and notify the mods via modmail. We will action the user accordingly.**",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Do not directly message users"
      },
      {
        "short_name": "No situations involving people under 18",
        "description": "Your content has been removed because it involves a situation with someone under the age of 18. Please note that changing your ages to get around this rule will result in an immediate ban.\n\nPlease consider posting this to our sister subreddit, r/teenrelationships",
        "kind": "link",
        "priority": 10,
        "violation_reason": "No situations involving people under 18"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T00:59:16.882266",
    "hours_tracked": 0.6644131807486217
  },
  {
    "id": "1km8u3w",
    "title": "I feel like I am getting robbed in my the trust",
    "text": "Location: south Africa For money you can divide rands by 20 to get the dollar value. So R10k is roughly 500 So my dad was a multimillionaire. He had many kids from many mothers. Was married twice divorced first time, second mom passed away and refused to marry his late partner My mom and 2 other sisters, whom j met at the memorial was an affair sort of a thing. He had an accountant who he has been working with for years, I think close to 20 years now. He has a mall and hotel as well as properties, investments, farms. Now He passed away on last week. The mall has a couple of large shops 1 anchor tenant. When my dad was still alive he said the anchor tenant was paying roughly R600k Just the small shops alone each pay a minimum of R10k each! There are 19 of those shops most of the ones inside their monthly rental hovers at R15k to R20k So you do the maths The big shops large clothing shops and one fast food joint The hotel is being rented out and makes R60k per month So his accountant said there is a trust set up. Kids B from his second marriage but thier mother passed away. Are both both trustees With the accountant as the executioner of the will and also a trustee. I was told I would only be getting R10k per month in my mind, that doesnt make sense with the way things looked I should be getting atleast R30k per month There would be no lump sum His properties would be co owned which is fucking stupid, I more talking about his houses and flats They also not giving me anything in writing, doesnt want to write msg or voice note. Only phoning over WhatsApp I cant record WhatsApp phone calls. Tried many apps I was told also that there would be 15 beneficiaries. There are 1o kids and was never a mention of other people inheriting. Also his late partner, whom he refused to marry but had kids with, three in total is going to be receiving R120k pm. That is someones annual salary she will be receiving per month. Now the reason they gave is because her kids are under 21 and need to go do college etc. So in total her and the three kids each receive R30k per month on top of that she is keeping one of his businesses to support herself. Its a bottle store. Which is unfair when you consider the monthly amount and property she received I have been in contact with the other sisters from marriage A and we believe that kids B both trustees and the accountant want to rob us. They will be receiving Hundreds of thousands per month, while we receive a baby 10k pm. They are keeping us in the dark and have never brought us together as a group to explain. We are only receiving calls individually What can I do the will and trust will be out roughly in 3-4 months, as he is claiming he has to pay of bonds Now the accountant has made it know to me that I should be greatful to be receiving anything becuase before I was getting nothing and now I will be receiving R10k per month. Which in all could afford a decent life apartment, groceries clothes, maybe a second hand car after many years of frugal living and saving etc. But we are honestly being robbed here My thought is the accountant struck a deal with the two kids, who are both trustees and who also veiw themselves as the true kids who deserve to inherit. While the rest of us are all just illegitimate kids or mistakes. And hence we just get a little so we keep our mouths shut while they really eat Like it is plain as day, what can I do",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/legaladvice/comments/1km8u3w/i_feel_like_i_am_getting_robbed_in_my_the_trust/",
    "author": "This-is-awesosme",
    "created_utc": 1747205938.0,
    "subreddit": "legaladvice",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-13T23:59:19.814266",
    "comments": [],
    "post_length": 3484,
    "title_length": 47,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "All responses must contain legal information/answers only. No off-topic or anecdotal comments.",
        "description": "",
        "kind": "all",
        "priority": 0,
        "violation_reason": "Off-topic, anecdotal, or generally unhelpful"
      },
      {
        "short_name": "Do Not Give Illegal Advice",
        "description": "Don't advise people on how to break the law.",
        "kind": "comment",
        "priority": 1,
        "violation_reason": "Illegal or bad advice"
      },
      {
        "short_name": "Do Not Advise Media Exposure",
        "description": "Do not advise users to publicize the situation.",
        "kind": "comment",
        "priority": 2,
        "violation_reason": "Advising media exposure"
      },
      {
        "short_name": "Personally Identifying Information",
        "description": "Posts or submissions that ask for or contain information that could be used to identify either party are subject to immediate removal.",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Personally Identifying Information"
      },
      {
        "short_name": "Personal Attacks Prohibited",
        "description": "Only civil remarks are allowed.",
        "kind": "all",
        "priority": 4,
        "violation_reason": "Personal attack"
      },
      {
        "short_name": "Advertising or Recommending a Lawyer or Business",
        "description": "We do not allow referrals to particular lawyers, law firms, or other businesses.",
        "kind": "all",
        "priority": 5,
        "violation_reason": "Advertising or recommending a lawyer or business"
      },
      {
        "short_name": "Troll Post",
        "description": "We do not allow troll posts.",
        "kind": "link",
        "priority": 6,
        "violation_reason": "Troll Post"
      },
      {
        "short_name": "Duplicate Post",
        "description": "Do not post the same question or comment multiple times.",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Duplicate Post or Comment"
      },
      {
        "short_name": "Requesting PM",
        "description": "Do not request a PM.",
        "kind": "all",
        "priority": 8,
        "violation_reason": "Requesting PM"
      },
      {
        "short_name": "Include your location",
        "description": "If you don't leave your location in your post, we probably can't help you. INCLUDE YOUR LOCATION.",
        "kind": "link",
        "priority": 9,
        "violation_reason": "No location"
      },
      {
        "short_name": "Read our full list of rules",
        "description": "Read our full list of rules here: https://www.reddit.com/r/legaladvice/wiki/index#wiki_general_rules",
        "kind": "all",
        "priority": 10,
        "violation_reason": "Read our full list of rules"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "moderator",
    "raw_banned_by": null,
    "raw_author_is_none": false,
    "raw_selftext_value": "[removed]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T01:00:00.914559",
    "hours_tracked": 0.5579645207193162
  },
  {
    "id": "1km8v5z",
    "title": "Which Hindu goddess is worshiped for female celibacy ?",
    "text": "",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/AskReddit/comments/1km8v5z/which_hindu_goddess_is_worshiped_for_female/",
    "author": "LonelyRecipe6150",
    "created_utc": 1747206053.0,
    "subreddit": "AskReddit",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-14T00:01:07.002130",
    "comments": [],
    "post_length": 0,
    "title_length": 54,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Rule 1 - Questions must be clear and direct and may not use the body textbox",
        "description": "* All questions must be clear, written in English, and conclude with a question mark\n* All context in the title must be ***necessary to understanding the question***; do not give “example answers” in the post title (i.e. “Other than your mom, \\_\\_\\_\\_\\_\\_?”)\n* No text in the text box - any additional info from you must be added as a comment to your post\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_1-)",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Rule 1 - Questions must be clear and direct and may not use the body textbox"
      },
      {
        "short_name": "Rule 2 - No personal or professional advice requests",
        "description": "* Askreddit is NOT your personal or professional advice platform\n\n* Do not makes posts asking for professional advice - medical, legal, financial, or otherwise\n\n* All posts asking for advice must be generic and not specific to your situation alone\n\n* Do not use first person pronouns\n\n* No crowdsourcing naming or purchasing decisions\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_2-)",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Rule 2 - No personal or professional advice requests"
      },
      {
        "short_name": "Rule 3 - Open ended questions only",
        "description": "* Post must be an open-ended discussion question\n\n* Title must not be phrased to allow a simple yes/no answer\n\n* No questions that have definite answers\n\n* Question must not be a poll or survey\n\n* No “Either/Or” type questions\n\n* Do not ask for NSFW links\n\n* Do not specify a length (eg \"in three words...\") or make your post into a game\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_3-)",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Rule 3 - Open ended questions only"
      },
      {
        "short_name": "Rule 4 - No personal info",
        "description": "* Do not post or seek any **real or fake** personal information (examples include: full names, phone numbers, email addresses, or social media accounts)\n\n* Only link another user's comment when it is relevant and **never** when it is to launch a personal attack or encourage others to do so\n\n* Do not ask questions designed to target specific usernames or links to social media\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_4-)",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Rule 4 - No personal info"
      },
      {
        "short_name": "Rule 5 - No loaded questions",
        "description": "- Do not include an opinion, bias, or lead respondents towards expressing a specific opinion in your post title\n\n- Do not use this subreddit to promote a specific agenda or to gain positive or negative publicity for an entity or person\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_5-)",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Rule 5 - No loaded questions"
      },
      {
        "short_name": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies",
        "description": "* [Serious] posts are off-limits for joke replies and irrelevant or off-topic comments and discussion\n\n* If the OP asks for answers from a specific group in a [Serious] post, top level comments must be made from members of that group\n\n* Posts that do not receive relevant answers within an hour will be removed\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_6-)",
        "kind": "all",
        "priority": 5,
        "violation_reason": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies"
      },
      {
        "short_name": "Rule 7 - No begging for goods or services, or Reddit rewards",
        "description": "* Do not ask for Reddit rewards, money, goods, services,or favors\n\n* Do not form a brigade to draw positive or negative attention to posts or comments in AskReddit, even from other subreddits\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_7-)",
        "kind": "all",
        "priority": 6,
        "violation_reason": "Rule 7 - No begging for goods or services, or Reddit rewards"
      },
      {
        "short_name": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner",
        "description": "* Do not make personal attacks, insult, or demean a specific group or person\n\n* Do not use slurs without relevant context and quotes\n\n* No blatant statements of bigotry\n\n* No posts that 'bait' users into breaking other rules\n\n* Zero tolerance for posts/comments that sexualize minors\n\n* Zero tolerance for posts/comments that encourage suicide\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_8-)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner"
      },
      {
        "short_name": "Rule 9 -  No image only replies or large ascii art",
        "description": "* Comment replies must consist of more than just an image or link\n\n* No ASCII/emoji images over one line\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_9-)",
        "kind": "comment",
        "priority": 8,
        "violation_reason": "Rule 9 -  No image only replies or large ascii art"
      },
      {
        "short_name": "Rule 10 - Harmful Misinformation",
        "description": "* Do not downplay the effects of a medical crisis\n* Do not undermine the efficacy of vaccines where there is widespread agreement among the medical and scientific communities\n* Do not encourage illegal activity\n* Do not encourage delayed medical treatment\n\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-harmful_misinformation-)",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Rule 10 - Harmful Misinformation"
      },
      {
        "short_name": "Rule 11 - No spam, machine generated content or karma farming",
        "description": "* Do not post spam\n* Do not edit comments to mislead and/or advertise\n* Do not farm karma or shotgun comments\n* Bots are not allowed in r/AskReddit\n\n[The full rule can be viewed here](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_11-)",
        "kind": "all",
        "priority": 10,
        "violation_reason": "Rule 11 - No spam, machine generated content or karma farming"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T01:00:18.938325",
    "hours_tracked": 0.5281922672192255
  },
  {
    "id": "1km8yvh",
    "title": "Hey Im new to this!",
    "text": "New to investing! Just want some help Heyy guys Im 19F Im going to apologize now for my new lingo Ill be using- sorry! Im a newbie lol Ill learn over time. I have been interested in investing since I turned 18 and finally pulled the trigger set everything up last night- my Roth IRA my CMA. Dont judge I definitely used ChatGPT to help out on questions I had. It led me to my path now where I have 1000 in my CMA saxx for my emergency savings. I also just bought a whole share of FSKAX through my IRA 160. Im aware i didnt need to buy the whole share but I thought why not if Ill make more I have the money right? Through my not so thorough but trying my best research I realized making a post asking for help may be the best, coming from real-life people. I honestly didnt come from by an means a very finance involved family, I actually know more about this than them sad i just want some opinions on how Im doing and what you would do in my shoes to make the most out of your money. Idk if it will help with thoughts but I have 2k in my banks checking/savings. If youve made it this far I very much appreciate it, just looking for some tips from smart people haha. I read these sub reddits and am very impressed by how you all talk with eachother about these things! Hopefully Ill get there.",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/personalfinance/comments/1km8yvh/hey_im_new_to_this/",
    "author": "Holiday-Comb-8175",
    "created_utc": 1747206479.0,
    "subreddit": "personalfinance",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-14T00:08:15.396921",
    "comments": [],
    "post_length": 1328,
    "title_length": 20,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Submission guidelines",
        "description": "Posts must be a personal finance question or discussion with a descriptive title.\n\nWe don't allow:\n\n* Polls, surveys, or requests for personal data, experiences, or other types of self-reporting\n* Success stories or thanks (use weekday/weekend thread)\n* Several [disallowed topics](http://bit.ly/3mxqnSl)\n* Meta posts\n* IAmA/AMA requests or posts\n* News without a discussion, quote, or summary\n\nFor more information on the subreddit rules, read the [rules wiki](/r/personalfinance/w/rules).",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Submission guidelines"
      },
      {
        "short_name": "Self-promotional advertising or soliciting",
        "description": "We don't allow:\n\n* Promotion of web content, products, services, companies, or anything else owned by you (or anyone affiliated with you), even if not monetized\n* Accounts with promotional profiles or usernames\n* Offering referral, invite, or affiliate links/codes\n* Soliciting business/investors, market research, media requests, or recruiting\n* Repeatedly or prominently stating financial credentials\n* PM/DM requests or offers\n\nRequires pre-approval: open source tools, customer service replies",
        "kind": "all",
        "priority": 1,
        "violation_reason": "Self-promotional advertising or soliciting"
      },
      {
        "short_name": "Unhelpful or disrespectful",
        "description": "We don't allow:\n\n* Circlejerking or karmawhoring\n* Posting just for upvotes or humor\n* Insincerity or dishonesty\n* Trolling, brigading, loaded questions/language, or provoking unproductive conversation\n* Memes or low-effort content\n* Clickbait titles\n* Excessive large, bold, or spaced-out text\n* [Bots](http://bit.ly/3GJH5om) or AI-generated content\n* In-character novelty accounts\n* Insubstantive/ephemeral posts\n* Requesting votes\n* Excessive profanity\n* [Poor reddiquette](http://bit.ly/2vKxaO6)",
        "kind": "all",
        "priority": 2,
        "violation_reason": "Unhelpful or disrespectful"
      },
      {
        "short_name": "Asking for handouts or transactions",
        "description": "We don't allow asking for handouts or transactions.  That includes:\n\n* Asking (even indirectly) for gifts, loans, or donations for yourself or on behalf of any organization or person(s)\n* Any mention of a fundraising campaign even without a link\n* Requesting a job\n* Asking for loan cosigners\n* Soliciting for anyone to engage in any kind of transaction",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Asking for handouts or transactions"
      },
      {
        "short_name": "Legal or business discussion",
        "description": "We don't allow legal or business discussions. That includes:\n\n- Discussions that are predominantly legal issues\n- Discussions about starting, funding, or running a business, corporation, partnership, etc.\n- Content better suited for /r/legaladvice, /r/smallbusiness, /r/entrepreneur, or /r/business",
        "kind": "all",
        "priority": 4,
        "violation_reason": "Legal or business discussion"
      },
      {
        "short_name": "Politicizing",
        "description": "We don't allow:\n\n- Moralizing issues\n- Petitions or calls-to-action\n- Political discussions\n- Political baiting\n- Soapboxing\n",
        "kind": "all",
        "priority": 5,
        "violation_reason": "Politicizing"
      },
      {
        "short_name": "Lawbreaking information",
        "description": "We don't allow:\n\n* Suggesting another user perform an activity that is illegal, unlawful, or fraudulent in most jurisdictions\n* Linking to illegal content or lawbreaking information\n* Asking for advice on any of the above",
        "kind": "all",
        "priority": 6,
        "violation_reason": "Lawbreaking information"
      },
      {
        "short_name": "Personal attack or abusive language",
        "description": "We don't allow:\n\n* Personal attacks\n * Raw criticism without any constructive feedback\n * Name-calling, flaming, shaming, or otherwise harassing another poster (or person being helped)\n * Telling a user to harm themselves or others\n* Abusive language\n * Intentionally rude or very harsh language\n * [Hate speech](/r/personalfinance/wiki/rules#wiki_definitions)\n * Suggesting [sex work](/r/personalfinance/wiki/rules#wiki_definitions) (even indirectly)\n * Retaliating in response to an affront",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Personal attack or abusive language"
      },
      {
        "short_name": "Personal advice discussion",
        "description": "We don't allow personal advice discussions. That includes:\n\n* Content better suited for /r/relationships\n* Recommending a poster end their relationship or start a new relationship\n* Posts about suicide or violence\n* Posts asking for advice on how to convince someone else to change their behavior\n* Relationship drama not essential to a question or discussion\n* Family planning advice, especially unsolicited or flippant\n* Career, job, and education questions\n* Medical advice",
        "kind": "all",
        "priority": 8,
        "violation_reason": "Personal advice discussion"
      },
      {
        "short_name": "Other bad behavior",
        "description": "* Missing－Disappearing after posting a discussion or posting for another with inadequate information or involvement\n* Hyping－Pushing speculative, volatile, illiquid, or meme investments, especially flippantly, tersely, or implying huge returns\n* Rabble rousing－We're not your personal army\n* Doxing－Posting or seeking personal information, dox attempts or threats\n* Flooding－Posting excessively frequently\n* Duplicates－Reposting news or information\n* Plagiarism－Not giving credit properly",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Other bad behavior"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "automod_filtered",
    "raw_banned_by": null,
    "raw_author_is_none": false,
    "raw_selftext_value": "[removed]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T01:01:05.068343",
    "hours_tracked": 0.4091916577021281
  },
  {
    "id": "1km8trf",
    "title": "𝑯𝒂𝒗𝒆 𝒚𝒐𝒖 𝒆𝒗𝒆𝒓 𝒇𝒆𝒍𝒕 𝒍𝒊𝒌𝒆 𝒚𝒐𝒖𝒓𝒆 𝒘𝒂𝒔𝒕𝒊𝒏𝒈 𝒑𝒓𝒆𝒄𝒊𝒐𝒖𝒔 𝒕𝒊𝒎𝒆 𝒍𝒐𝒐𝒌𝒊𝒏𝒈 𝒇𝒐𝒓 𝒕𝒉𝒆 𝒓𝒊𝒈𝒉𝒕 𝒑𝒆𝒐𝒑𝒍𝒆 𝒇𝒐𝒓 𝒚𝒐𝒖𝒓 𝒑𝒓𝒐𝒋𝒆𝒄𝒕𝒔?",
    "text": "Dozens of ads, fruitless conversations, broken promises... and youre still left worrying. Ive found a complete solution - a platform with thousands of vetted professionals from all creative and technical fields. Videos, logos, text, ads, websites, consulting... whatever you need, its there. But Im not giving you the name directly - because the link I have makes all the difference. Go straight from here and discover what it can do for you: Its not just a platform. Its a complete resource for your ideas. smartsolutions entrepreneurship design freelancing efficiency yuuhu_net yuuhu_pro",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/personalfinance/comments/1km8trf/𝑯𝒂𝒗𝒆_𝒚𝒐𝒖_𝒆𝒗𝒆𝒓_𝒇𝒆𝒍𝒕_𝒍𝒊𝒌𝒆_𝒚𝒐𝒖𝒓𝒆_𝒘𝒂𝒔𝒕𝒊𝒏𝒈_𝒑𝒓𝒆𝒄𝒊𝒐𝒖𝒔/",
    "author": "Mysterious-Walk7698",
    "created_utc": 1747205898.0,
    "subreddit": "personalfinance",
    "score": 1,
    "num_comments": 1,
    "timestamp_collected": "2025-05-14T00:10:29.566789",
    "comments": [],
    "post_length": 626,
    "title_length": 100,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Submission guidelines",
        "description": "Posts must be a personal finance question or discussion with a descriptive title.\n\nWe don't allow:\n\n* Polls, surveys, or requests for personal data, experiences, or other types of self-reporting\n* Success stories or thanks (use weekday/weekend thread)\n* Several [disallowed topics](http://bit.ly/3mxqnSl)\n* Meta posts\n* IAmA/AMA requests or posts\n* News without a discussion, quote, or summary\n\nFor more information on the subreddit rules, read the [rules wiki](/r/personalfinance/w/rules).",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Submission guidelines"
      },
      {
        "short_name": "Self-promotional advertising or soliciting",
        "description": "We don't allow:\n\n* Promotion of web content, products, services, companies, or anything else owned by you (or anyone affiliated with you), even if not monetized\n* Accounts with promotional profiles or usernames\n* Offering referral, invite, or affiliate links/codes\n* Soliciting business/investors, market research, media requests, or recruiting\n* Repeatedly or prominently stating financial credentials\n* PM/DM requests or offers\n\nRequires pre-approval: open source tools, customer service replies",
        "kind": "all",
        "priority": 1,
        "violation_reason": "Self-promotional advertising or soliciting"
      },
      {
        "short_name": "Unhelpful or disrespectful",
        "description": "We don't allow:\n\n* Circlejerking or karmawhoring\n* Posting just for upvotes or humor\n* Insincerity or dishonesty\n* Trolling, brigading, loaded questions/language, or provoking unproductive conversation\n* Memes or low-effort content\n* Clickbait titles\n* Excessive large, bold, or spaced-out text\n* [Bots](http://bit.ly/3GJH5om) or AI-generated content\n* In-character novelty accounts\n* Insubstantive/ephemeral posts\n* Requesting votes\n* Excessive profanity\n* [Poor reddiquette](http://bit.ly/2vKxaO6)",
        "kind": "all",
        "priority": 2,
        "violation_reason": "Unhelpful or disrespectful"
      },
      {
        "short_name": "Asking for handouts or transactions",
        "description": "We don't allow asking for handouts or transactions.  That includes:\n\n* Asking (even indirectly) for gifts, loans, or donations for yourself or on behalf of any organization or person(s)\n* Any mention of a fundraising campaign even without a link\n* Requesting a job\n* Asking for loan cosigners\n* Soliciting for anyone to engage in any kind of transaction",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Asking for handouts or transactions"
      },
      {
        "short_name": "Legal or business discussion",
        "description": "We don't allow legal or business discussions. That includes:\n\n- Discussions that are predominantly legal issues\n- Discussions about starting, funding, or running a business, corporation, partnership, etc.\n- Content better suited for /r/legaladvice, /r/smallbusiness, /r/entrepreneur, or /r/business",
        "kind": "all",
        "priority": 4,
        "violation_reason": "Legal or business discussion"
      },
      {
        "short_name": "Politicizing",
        "description": "We don't allow:\n\n- Moralizing issues\n- Petitions or calls-to-action\n- Political discussions\n- Political baiting\n- Soapboxing\n",
        "kind": "all",
        "priority": 5,
        "violation_reason": "Politicizing"
      },
      {
        "short_name": "Lawbreaking information",
        "description": "We don't allow:\n\n* Suggesting another user perform an activity that is illegal, unlawful, or fraudulent in most jurisdictions\n* Linking to illegal content or lawbreaking information\n* Asking for advice on any of the above",
        "kind": "all",
        "priority": 6,
        "violation_reason": "Lawbreaking information"
      },
      {
        "short_name": "Personal attack or abusive language",
        "description": "We don't allow:\n\n* Personal attacks\n * Raw criticism without any constructive feedback\n * Name-calling, flaming, shaming, or otherwise harassing another poster (or person being helped)\n * Telling a user to harm themselves or others\n* Abusive language\n * Intentionally rude or very harsh language\n * [Hate speech](/r/personalfinance/wiki/rules#wiki_definitions)\n * Suggesting [sex work](/r/personalfinance/wiki/rules#wiki_definitions) (even indirectly)\n * Retaliating in response to an affront",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Personal attack or abusive language"
      },
      {
        "short_name": "Personal advice discussion",
        "description": "We don't allow personal advice discussions. That includes:\n\n* Content better suited for /r/relationships\n* Recommending a poster end their relationship or start a new relationship\n* Posts about suicide or violence\n* Posts asking for advice on how to convince someone else to change their behavior\n* Relationship drama not essential to a question or discussion\n* Family planning advice, especially unsolicited or flippant\n* Career, job, and education questions\n* Medical advice",
        "kind": "all",
        "priority": 8,
        "violation_reason": "Personal advice discussion"
      },
      {
        "short_name": "Other bad behavior",
        "description": "* Missing－Disappearing after posting a discussion or posting for another with inadequate information or involvement\n* Hyping－Pushing speculative, volatile, illiquid, or meme investments, especially flippantly, tersely, or implying huge returns\n* Rabble rousing－We're not your personal army\n* Doxing－Posting or seeking personal information, dox attempts or threats\n* Flooding－Posting excessively frequently\n* Duplicates－Reposting news or information\n* Plagiarism－Not giving credit properly",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Other bad behavior"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "automod_filtered",
    "raw_banned_by": null,
    "raw_author_is_none": false,
    "raw_selftext_value": "[removed]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T01:01:16.985864",
    "hours_tracked": 0.3719230049186283
  },
  {
    "id": "1km90d9",
    "title": "What is it about Andor that makes it so boring?",
    "text": "",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/AskReddit/comments/1km90d9/what_is_it_about_andor_that_makes_it_so_boring/",
    "author": "Foxtrot_Uniform_CK69",
    "created_utc": 1747206655.0,
    "subreddit": "AskReddit",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-14T00:11:11.612223",
    "comments": [],
    "post_length": 0,
    "title_length": 47,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Rule 1 - Questions must be clear and direct and may not use the body textbox",
        "description": "* All questions must be clear, written in English, and conclude with a question mark\n* All context in the title must be ***necessary to understanding the question***; do not give “example answers” in the post title (i.e. “Other than your mom, \\_\\_\\_\\_\\_\\_?”)\n* No text in the text box - any additional info from you must be added as a comment to your post\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_1-)",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Rule 1 - Questions must be clear and direct and may not use the body textbox"
      },
      {
        "short_name": "Rule 2 - No personal or professional advice requests",
        "description": "* Askreddit is NOT your personal or professional advice platform\n\n* Do not makes posts asking for professional advice - medical, legal, financial, or otherwise\n\n* All posts asking for advice must be generic and not specific to your situation alone\n\n* Do not use first person pronouns\n\n* No crowdsourcing naming or purchasing decisions\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_2-)",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Rule 2 - No personal or professional advice requests"
      },
      {
        "short_name": "Rule 3 - Open ended questions only",
        "description": "* Post must be an open-ended discussion question\n\n* Title must not be phrased to allow a simple yes/no answer\n\n* No questions that have definite answers\n\n* Question must not be a poll or survey\n\n* No “Either/Or” type questions\n\n* Do not ask for NSFW links\n\n* Do not specify a length (eg \"in three words...\") or make your post into a game\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_3-)",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Rule 3 - Open ended questions only"
      },
      {
        "short_name": "Rule 4 - No personal info",
        "description": "* Do not post or seek any **real or fake** personal information (examples include: full names, phone numbers, email addresses, or social media accounts)\n\n* Only link another user's comment when it is relevant and **never** when it is to launch a personal attack or encourage others to do so\n\n* Do not ask questions designed to target specific usernames or links to social media\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_4-)",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Rule 4 - No personal info"
      },
      {
        "short_name": "Rule 5 - No loaded questions",
        "description": "- Do not include an opinion, bias, or lead respondents towards expressing a specific opinion in your post title\n\n- Do not use this subreddit to promote a specific agenda or to gain positive or negative publicity for an entity or person\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_5-)",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Rule 5 - No loaded questions"
      },
      {
        "short_name": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies",
        "description": "* [Serious] posts are off-limits for joke replies and irrelevant or off-topic comments and discussion\n\n* If the OP asks for answers from a specific group in a [Serious] post, top level comments must be made from members of that group\n\n* Posts that do not receive relevant answers within an hour will be removed\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_6-)",
        "kind": "all",
        "priority": 5,
        "violation_reason": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies"
      },
      {
        "short_name": "Rule 7 - No begging for goods or services, or Reddit rewards",
        "description": "* Do not ask for Reddit rewards, money, goods, services,or favors\n\n* Do not form a brigade to draw positive or negative attention to posts or comments in AskReddit, even from other subreddits\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_7-)",
        "kind": "all",
        "priority": 6,
        "violation_reason": "Rule 7 - No begging for goods or services, or Reddit rewards"
      },
      {
        "short_name": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner",
        "description": "* Do not make personal attacks, insult, or demean a specific group or person\n\n* Do not use slurs without relevant context and quotes\n\n* No blatant statements of bigotry\n\n* No posts that 'bait' users into breaking other rules\n\n* Zero tolerance for posts/comments that sexualize minors\n\n* Zero tolerance for posts/comments that encourage suicide\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_8-)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner"
      },
      {
        "short_name": "Rule 9 -  No image only replies or large ascii art",
        "description": "* Comment replies must consist of more than just an image or link\n\n* No ASCII/emoji images over one line\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_9-)",
        "kind": "comment",
        "priority": 8,
        "violation_reason": "Rule 9 -  No image only replies or large ascii art"
      },
      {
        "short_name": "Rule 10 - Harmful Misinformation",
        "description": "* Do not downplay the effects of a medical crisis\n* Do not undermine the efficacy of vaccines where there is widespread agreement among the medical and scientific communities\n* Do not encourage illegal activity\n* Do not encourage delayed medical treatment\n\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-harmful_misinformation-)",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Rule 10 - Harmful Misinformation"
      },
      {
        "short_name": "Rule 11 - No spam, machine generated content or karma farming",
        "description": "* Do not post spam\n* Do not edit comments to mislead and/or advertise\n* Do not farm karma or shotgun comments\n* Bots are not allowed in r/AskReddit\n\n[The full rule can be viewed here](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_11-)",
        "kind": "all",
        "priority": 10,
        "violation_reason": "Rule 11 - No spam, machine generated content or karma farming"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T01:01:20.998759",
    "hours_tracked": 0.36024353245894114
  },
  {
    "id": "1km90dq",
    "title": "What type of business partner you would never trust to engage business with him/her again?",
    "text": "",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/AskReddit/comments/1km90dq/what_type_of_business_partner_you_would_never/",
    "author": "LimeSoakedinSprite",
    "created_utc": 1747206656.0,
    "subreddit": "AskReddit",
    "score": 0,
    "num_comments": 0,
    "timestamp_collected": "2025-05-14T00:11:13.612519",
    "comments": [],
    "post_length": 0,
    "title_length": 90,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 0.5,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Rule 1 - Questions must be clear and direct and may not use the body textbox",
        "description": "* All questions must be clear, written in English, and conclude with a question mark\n* All context in the title must be ***necessary to understanding the question***; do not give “example answers” in the post title (i.e. “Other than your mom, \\_\\_\\_\\_\\_\\_?”)\n* No text in the text box - any additional info from you must be added as a comment to your post\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_1-)",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Rule 1 - Questions must be clear and direct and may not use the body textbox"
      },
      {
        "short_name": "Rule 2 - No personal or professional advice requests",
        "description": "* Askreddit is NOT your personal or professional advice platform\n\n* Do not makes posts asking for professional advice - medical, legal, financial, or otherwise\n\n* All posts asking for advice must be generic and not specific to your situation alone\n\n* Do not use first person pronouns\n\n* No crowdsourcing naming or purchasing decisions\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_2-)",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Rule 2 - No personal or professional advice requests"
      },
      {
        "short_name": "Rule 3 - Open ended questions only",
        "description": "* Post must be an open-ended discussion question\n\n* Title must not be phrased to allow a simple yes/no answer\n\n* No questions that have definite answers\n\n* Question must not be a poll or survey\n\n* No “Either/Or” type questions\n\n* Do not ask for NSFW links\n\n* Do not specify a length (eg \"in three words...\") or make your post into a game\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_3-)",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Rule 3 - Open ended questions only"
      },
      {
        "short_name": "Rule 4 - No personal info",
        "description": "* Do not post or seek any **real or fake** personal information (examples include: full names, phone numbers, email addresses, or social media accounts)\n\n* Only link another user's comment when it is relevant and **never** when it is to launch a personal attack or encourage others to do so\n\n* Do not ask questions designed to target specific usernames or links to social media\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_4-)",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Rule 4 - No personal info"
      },
      {
        "short_name": "Rule 5 - No loaded questions",
        "description": "- Do not include an opinion, bias, or lead respondents towards expressing a specific opinion in your post title\n\n- Do not use this subreddit to promote a specific agenda or to gain positive or negative publicity for an entity or person\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_5-)",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Rule 5 - No loaded questions"
      },
      {
        "short_name": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies",
        "description": "* [Serious] posts are off-limits for joke replies and irrelevant or off-topic comments and discussion\n\n* If the OP asks for answers from a specific group in a [Serious] post, top level comments must be made from members of that group\n\n* Posts that do not receive relevant answers within an hour will be removed\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_6-)",
        "kind": "all",
        "priority": 5,
        "violation_reason": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies"
      },
      {
        "short_name": "Rule 7 - No begging for goods or services, or Reddit rewards",
        "description": "* Do not ask for Reddit rewards, money, goods, services,or favors\n\n* Do not form a brigade to draw positive or negative attention to posts or comments in AskReddit, even from other subreddits\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_7-)",
        "kind": "all",
        "priority": 6,
        "violation_reason": "Rule 7 - No begging for goods or services, or Reddit rewards"
      },
      {
        "short_name": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner",
        "description": "* Do not make personal attacks, insult, or demean a specific group or person\n\n* Do not use slurs without relevant context and quotes\n\n* No blatant statements of bigotry\n\n* No posts that 'bait' users into breaking other rules\n\n* Zero tolerance for posts/comments that sexualize minors\n\n* Zero tolerance for posts/comments that encourage suicide\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_8-)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner"
      },
      {
        "short_name": "Rule 9 -  No image only replies or large ascii art",
        "description": "* Comment replies must consist of more than just an image or link\n\n* No ASCII/emoji images over one line\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_9-)",
        "kind": "comment",
        "priority": 8,
        "violation_reason": "Rule 9 -  No image only replies or large ascii art"
      },
      {
        "short_name": "Rule 10 - Harmful Misinformation",
        "description": "* Do not downplay the effects of a medical crisis\n* Do not undermine the efficacy of vaccines where there is widespread agreement among the medical and scientific communities\n* Do not encourage illegal activity\n* Do not encourage delayed medical treatment\n\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-harmful_misinformation-)",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Rule 10 - Harmful Misinformation"
      },
      {
        "short_name": "Rule 11 - No spam, machine generated content or karma farming",
        "description": "* Do not post spam\n* Do not edit comments to mislead and/or advertise\n* Do not farm karma or shotgun comments\n* Bots are not allowed in r/AskReddit\n\n[The full rule can be viewed here](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_11-)",
        "kind": "all",
        "priority": 10,
        "violation_reason": "Rule 11 - No spam, machine generated content or karma farming"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T01:01:22.976477",
    "hours_tracked": 0.3596881929371092
  },
  {
    "id": "1km91lh",
    "title": "Saudi Arabia changes its tune on US-Iran nuclear negotiations, offers full-throated support",
    "text": "",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/worldnews/comments/1km91lh/saudi_arabia_changes_its_tune_on_usiran_nuclear/",
    "author": "Party_Judgment5780",
    "created_utc": 1747206801.0,
    "subreddit": "worldnews",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-14T00:13:35.742763",
    "comments": [],
    "post_length": 0,
    "title_length": 91,
    "is_self": false,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "No US Internal News or Politics",
        "description": "Articles about events within the US or related to the US internal political process with no involvement of foreign officials or international organizations and no effect on people outside the US are not allowed here. The large subreddits for these topics are /r/news and /r/politics.",
        "kind": "link",
        "priority": 0,
        "violation_reason": "US Internal News or Politics"
      },
      {
        "short_name": "No Editorialized or Misleading Titles",
        "description": "Do not add opinion/commentary to the submission title. Don't add something that isn't covered by the article, and don't misrepresent the article. Adding a sentence from within the article that is more representative of the content is generally OK.\n\nAn article's title must not be misleading.  It may be removed if the title states a source's opinion as fact, or misrepresents the facts in the article or multiple other sources. \n\nAll caps words are not allowed, except for acronyms of course.",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Editorialized or Misleading Title"
      },
      {
        "short_name": "No Feature stories",
        "description": "Feature stories are journalistic reports providing more descriptive background information than a straight news report will contain. Dictionary.com: \"a newspaper or magazine article or report of a person, event, an aspect of a major event, or the like, often having a personal slant and written in an individual style.\"",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Feature story"
      },
      {
        "short_name": "No Editorials, Opinion or Analysis Pieces",
        "description": "/r/worldnews is for news, rather than analysis. There are several subreddits listed at the top of the page that are good for this. If the writer injects his/her opinion in the article or tries to draw any conclusion about a set of events, then it is no longer straight news and is not permitted in /r/worldnews.",
        "kind": "link",
        "priority": 3,
        "violation_reason": "Editorial, Opinion, or Analysis"
      },
      {
        "short_name": "No Articles In Languages Other Than English",
        "description": "This includes articles that are auto-translated.",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Not in English"
      },
      {
        "short_name": "No Images, Videos or Audio Clips",
        "description": "If images, videos or audio files are part of an article that's fine, but the accompanying article must have some value of its own. Merely providing image captions or video descriptions isn't sufficient.",
        "kind": "link",
        "priority": 5,
        "violation_reason": "Image, Video or Audio Clip"
      },
      {
        "short_name": "No Old News Articles (≥ 1 Week old)",
        "description": "Old News is any news older than one week.",
        "kind": "link",
        "priority": 6,
        "violation_reason": "Out of Date"
      },
      {
        "short_name": "Your content might be removed if /r/worldnews is not the appropriate subreddit for the story.",
        "description": "Examples include but are not limited to:\n\nCelebrity gossip, local crimes, sports results, social media posts, goofy/zany/oddball stories, conspiracy/UFO/UAP/paranormal stories, commercial product and financial news, etc.\n\nPlease refer to our full rule in the [wiki](https://www.reddit.com/r/worldnews/wiki/rules/#wiki_inappropriate_content) .",
        "kind": "link",
        "priority": 7,
        "violation_reason": "Inappropriate content for the subreddit"
      },
      {
        "short_name": "No Bigotry or Other Offensive Content",
        "description": "Hate speech directed towards an entire group of people who share a race, gender, sexual orientation, ethnicity, religion, nationality, social status or disability is not allowed.  This also applies to user names.",
        "kind": "comment",
        "priority": 8,
        "violation_reason": "Bigotry or Other Offensive Content"
      },
      {
        "short_name": "No Personal Attacks On Other Users",
        "description": "You may criticize a user's comment but not their person. Calling people names shuts down discussion. Accusing another user of being a \"shill\" is considered a personal attack. Stick to the issues and remain civil.",
        "kind": "comment",
        "priority": 9,
        "violation_reason": "Personal Attack"
      },
      {
        "short_name": "No Memes, Gifs, unlabeled NSFW images",
        "description": "Memes may show up in image or in text form. Both are not allowed.\n\nBesides, porn or shock images unrelated to the story discussed will always be removed and posting them is an easy way to get banned.",
        "kind": "comment",
        "priority": 10,
        "violation_reason": "Memes, Gifs, unlabeled NSFW images"
      },
      {
        "short_name": "No chatGPT bots or copy/paste bots",
        "description": "",
        "kind": "comment",
        "priority": 11,
        "violation_reason": "No chatGPT bots or copy/paste bots"
      }
    ],
    "media_type": "link",
    "image_urls": [],
    "video_url": null,
    "original_url": "http://gulfif.org/saudi-arabia-changes-its-tune-on-nuclear-negotiations-with-iran/",
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T01:01:40.997724",
    "hours_tracked": 0.3202073148886363
  },
  {
    "id": "1km91ml",
    "title": "What static point of time are the highest of Americans asleep ?",
    "text": "",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/AskReddit/comments/1km91ml/what_static_point_of_time_are_the_highest_of/",
    "author": "No-Discipline-3610",
    "created_utc": 1747206805.0,
    "subreddit": "AskReddit",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-14T00:13:39.734756",
    "comments": [],
    "post_length": 0,
    "title_length": 65,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Rule 1 - Questions must be clear and direct and may not use the body textbox",
        "description": "* All questions must be clear, written in English, and conclude with a question mark\n* All context in the title must be ***necessary to understanding the question***; do not give “example answers” in the post title (i.e. “Other than your mom, \\_\\_\\_\\_\\_\\_?”)\n* No text in the text box - any additional info from you must be added as a comment to your post\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_1-)",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Rule 1 - Questions must be clear and direct and may not use the body textbox"
      },
      {
        "short_name": "Rule 2 - No personal or professional advice requests",
        "description": "* Askreddit is NOT your personal or professional advice platform\n\n* Do not makes posts asking for professional advice - medical, legal, financial, or otherwise\n\n* All posts asking for advice must be generic and not specific to your situation alone\n\n* Do not use first person pronouns\n\n* No crowdsourcing naming or purchasing decisions\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_2-)",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Rule 2 - No personal or professional advice requests"
      },
      {
        "short_name": "Rule 3 - Open ended questions only",
        "description": "* Post must be an open-ended discussion question\n\n* Title must not be phrased to allow a simple yes/no answer\n\n* No questions that have definite answers\n\n* Question must not be a poll or survey\n\n* No “Either/Or” type questions\n\n* Do not ask for NSFW links\n\n* Do not specify a length (eg \"in three words...\") or make your post into a game\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_3-)",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Rule 3 - Open ended questions only"
      },
      {
        "short_name": "Rule 4 - No personal info",
        "description": "* Do not post or seek any **real or fake** personal information (examples include: full names, phone numbers, email addresses, or social media accounts)\n\n* Only link another user's comment when it is relevant and **never** when it is to launch a personal attack or encourage others to do so\n\n* Do not ask questions designed to target specific usernames or links to social media\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_4-)",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Rule 4 - No personal info"
      },
      {
        "short_name": "Rule 5 - No loaded questions",
        "description": "- Do not include an opinion, bias, or lead respondents towards expressing a specific opinion in your post title\n\n- Do not use this subreddit to promote a specific agenda or to gain positive or negative publicity for an entity or person\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_5-)",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Rule 5 - No loaded questions"
      },
      {
        "short_name": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies",
        "description": "* [Serious] posts are off-limits for joke replies and irrelevant or off-topic comments and discussion\n\n* If the OP asks for answers from a specific group in a [Serious] post, top level comments must be made from members of that group\n\n* Posts that do not receive relevant answers within an hour will be removed\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_6-)",
        "kind": "all",
        "priority": 5,
        "violation_reason": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies"
      },
      {
        "short_name": "Rule 7 - No begging for goods or services, or Reddit rewards",
        "description": "* Do not ask for Reddit rewards, money, goods, services,or favors\n\n* Do not form a brigade to draw positive or negative attention to posts or comments in AskReddit, even from other subreddits\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_7-)",
        "kind": "all",
        "priority": 6,
        "violation_reason": "Rule 7 - No begging for goods or services, or Reddit rewards"
      },
      {
        "short_name": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner",
        "description": "* Do not make personal attacks, insult, or demean a specific group or person\n\n* Do not use slurs without relevant context and quotes\n\n* No blatant statements of bigotry\n\n* No posts that 'bait' users into breaking other rules\n\n* Zero tolerance for posts/comments that sexualize minors\n\n* Zero tolerance for posts/comments that encourage suicide\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_8-)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner"
      },
      {
        "short_name": "Rule 9 -  No image only replies or large ascii art",
        "description": "* Comment replies must consist of more than just an image or link\n\n* No ASCII/emoji images over one line\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_9-)",
        "kind": "comment",
        "priority": 8,
        "violation_reason": "Rule 9 -  No image only replies or large ascii art"
      },
      {
        "short_name": "Rule 10 - Harmful Misinformation",
        "description": "* Do not downplay the effects of a medical crisis\n* Do not undermine the efficacy of vaccines where there is widespread agreement among the medical and scientific communities\n* Do not encourage illegal activity\n* Do not encourage delayed medical treatment\n\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-harmful_misinformation-)",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Rule 10 - Harmful Misinformation"
      },
      {
        "short_name": "Rule 11 - No spam, machine generated content or karma farming",
        "description": "* Do not post spam\n* Do not edit comments to mislead and/or advertise\n* Do not farm karma or shotgun comments\n* Bots are not allowed in r/AskReddit\n\n[The full rule can be viewed here](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_11-)",
        "kind": "all",
        "priority": 10,
        "violation_reason": "Rule 11 - No spam, machine generated content or karma farming"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T01:01:45.019461",
    "hours_tracked": 0.31909807860851286
  },
  {
    "id": "1km92cw",
    "title": "Feeling more distant from my 29f bf 23m, what can I do?",
    "text": "Weve been together for 8 months and though it was rocky in the beginning as we were trying to get to know more about each other and our boundaries, the past few months have been great. Through each fight, we tend to make up and feel closer than ever but the one we just had: I tend to bottle things up and say something along the lines of lets not do this ever again, rather than communicating it to him from when it first bothered me, let us both talk about it and make suitable compromise. I can be rational now that Im not feeling frustrated but I often just keep things to myself. For example, he would say things like I should really help out with some chores/lock in at the gym Im happy to hear that he is self aware of it so I figured theres no need for me to remind him or bring it up to him. Besides, i dont want to feel like Im nagging him like a mother given our age gap. However, when he doesnt end up doing what he said he would or I see him laying around for an extended period of time instead of doing what he said he would, i would feel disappointed but keep it to myself until i get annoyed and would just tell him off in a way thats not pleasant. Such as if youre not going to help out or go to the gym, dont bother saying it to begin with. these are just examples for a similar scenario, it isnt exactly what we fought about Right away, he got frustrated at me instead and said that if I felt certain way about something I should have brought it up to him in the first place. If something bothered me, I should have just voiced it out to him from the start. It turned into a situation where I am at fault for not communicating and talking to him about it before saying things that hurt him. Im generally a reserved and quiet person due to cultural and personal upbringing I tend to avoid conflicts and keep things to myself. It is difficult for me to start a difficult conversation but Ive been trying to change that since we had a talk about working on communicating more openly months ago. But because of the fight we just had, he seems to be more distant and just a little more closed up. Prior to this, every fight we had would only bring us closer together. But this time round, it seems like he is starting to feel fed up about fighting about something we already did before which is me not openly communicating about my feelings with him. I feel confused as I was initially annoyed at his behaviour but ended up feeling like shit for mine. He was frustrated at me from the beginning til now, we are nearing the end of day 2 of feeling distant between us and barely talked all day. I do want to be more open and communicate with him the way he wants/expects me to but its so deeply rooted in me, I honestly cannot seem to change that part of me as of yet approximately 4months and for him to lose patience in me and keep his distance from me made me feel more disheartened and alone. I regret bringing up anything at all and feel like I should shut myself in more than being more communicative with him judging from our situation right now. I cant tell if we are both filled with resentment or we just need to talk it through. Sometimes talking it out with him doesnt even feel like Im being heard at all. It turns into a pity party and he would try to one up me or minimise my feelings. I miss him but this distance that hes putting between us is kind of giving me some clarity and making me realise that we might be incompatible. Despite that, I decided that I would like to keep trying and be with him so Ill have a conversation with him tonight. Any advice on how or what can I do to help us get through this? Or does anybody have any advice on being more open and vocal with their partners? Any advice is greatly appreciated.",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/relationship_advice/comments/1km92cw/feeling_more_distant_from_my_29f_bf_23m_what_can/",
    "author": "mayhapsinlove",
    "created_utc": 1747206891.0,
    "subreddit": "relationship_advice",
    "score": 1,
    "num_comments": 1,
    "timestamp_collected": "2025-05-14T00:15:19.846584",
    "comments": [],
    "post_length": 3804,
    "title_length": 59,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Posts must contain a title, description, TLDR, & basic info like ages, genders",
        "description": "Posts MUST include: \n\n* A title that summarizes the problem or question. This is where the ages/genders should be placed.\n* A description of your situation.\n* A question or a request for what advice you want.\n* Length of Relationship\n* A brief [**tl;dr**](http://en.wiktionary.org/wiki/TLDR) if your post is long.\n\nExamples of ages/genders in the title:\n\n- I [24M] have an issue with my aunt, [45F]\n\n- My partner [19NB] told me [21MtF]\n\n- I [45F] love my husband [51M]",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Post does not feature detailed information, or lacks a descriptive title, tldr, or similar"
      },
      {
        "short_name": "All posts must request specific advice on a specific, real situation between two or more people",
        "description": "We do not allow vague requests for advice such as:\n\n- What would you do?\n\n- What should I do?\n\n- Any advice would be appreciated\n\nLikewise, we do not allow:\n\n- Vents/rants\n\n- Posts about past or potential relationships\n\n- Posts giving advice\n\nLastly, this subreddit relies on honesty. If your content is in any capacity dishonest (examples include: chatGPT posts, creative writing, profile inconsistencies) it will be removed and you will be banned.",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Post does not request advice on a real situation between two or more people."
      },
      {
        "short_name": "No questions that can be answered with yes or no (aka moral judgment)",
        "description": "Your post is a yes or no question (aka moral judgement) if your question starts with or contains any of the following:\n\n- Is it...?\n\n- Asking if you or the subject of the post is right or wrong.\n\n- Am I....?\n\n- Any variation of “Am I The Asshole?”, including AITA\n\n- Does/Have anybody else...?\n\n- Should I…?\n\n- Would you....?\n\n- Is this.....?\n\n- Can I...?\n\n\n#If the question in your post can be answered with a yes or no question, it is moral judgement and will be removed.",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Yes or no/ Moral Judgement Request"
      },
      {
        "short_name": "Things This Sub Can't Give Advice On:",
        "description": "Rants, unsolicited advice, letters to an ex, \"body counts\" or number of sexual partners, mental health issues, medical health issues, legal problems, financial problems, any situations involving minors (under 18 regardless of local laws), and any situations involving abuse (violence, sexual, emotional etc). All of these will be removed and locked.",
        "kind": "link",
        "priority": 3,
        "violation_reason": "Not Applicable to the Sub"
      },
      {
        "short_name": "Only One Update Is Allowed",
        "description": "You can submit **one** update post at any time after 48 hours has past from the original post. \n\nAdditional advice may be requested in new posts but they may not be continuations of the orignal one. E.g. no titles saying \"Update 2\" or \"Update 4\". We're not a blog. Please post further updates on your own profile.",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Too many updates"
      },
      {
        "short_name": "Surveys, Academic Research, Information Requests, and Media Questions Should Be Sent to Modmail",
        "description": "Surveys, information requests, and journalistic or academic research questions must be sent to [modmail](https://www.reddit.com/message/compose?to=/r/relationship_advice) prior to posting.  If you are doing academic research, message us with your IRB number, a point of contact for us to verify your pending research, and the details of your research for consideration. Press Requests must be routed through modmail, via u/eganist , before communicating with users directly.",
        "kind": "link",
        "priority": 5,
        "violation_reason": "Surveys, Academic Research, Information Requests, and Media Questions Should Be Sent to Modmail"
      },
      {
        "short_name": "All comments must be on topic, and focus on the OP, and be made in good faith",
        "description": "Derailing arguments, jokes fighting, and moral whataboutism is not allowed. Give good, ethical advice. Remember, the goal is to help your fellow human.",
        "kind": "all",
        "priority": 6,
        "violation_reason": "derailing, fighting, whataboutism, or not in good faith"
      },
      {
        "short_name": "Keep It Civil",
        "description": "No insults, no threats of violence, no encouraging violence, no telling an OP to go to punch someone else, no threats, no harassment, no trolling, no advertising other subs, no spam. You will be banned. \n\nAll bans in this sub are permanent. You don't get a free pass.\n\nFor more information, please see our [rules](https://www.reddit.com/r/relationship_advice/wiki/rules#wiki_rule_8)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Insults, violence, harassment, trolling, spam"
      },
      {
        "short_name": "No referencing hateful or abusive subs/individuals/content",
        "description": "**No referencing hateful or abusive subs/individuals and content**. No advocating for or referencing content that is conspiratorial in nature, transphobic, anti-women/men, anti-LBGT+, that promote anti-vaxx or anti-science content, or contains harmful rhetoric against groups of people. Think includes linking to subs that feature this. You will be banned. You don't get a free pass. \n\n[Further information](https://www.reddit.com/r/relationship_advice/wiki/rules#wiki_rule_9)",
        "kind": "all",
        "priority": 8,
        "violation_reason": "references hateful/abusive content/subs/individuals"
      },
      {
        "short_name": "Do not directly message users",
        "description": "If you wish to opine on the matter at hand, you are to comment on the post. Users found to be privately messaging other users to circumvent this directive will be met with a permanent, irrevocable ban. \n\n**If a user has sent you harassing messages, please upload your screenshot to Imgur.com, and notify the mods via modmail. We will action the user accordingly.**",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Do not directly message users"
      },
      {
        "short_name": "No situations involving people under 18",
        "description": "Your content has been removed because it involves a situation with someone under the age of 18. Please note that changing your ages to get around this rule will result in an immediate ban.\n\nPlease consider posting this to our sister subreddit, r/teenrelationships",
        "kind": "link",
        "priority": 10,
        "violation_reason": "No situations involving people under 18"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T01:01:53.014870",
    "hours_tracked": 0.29129087580574886
  },
  {
    "id": "1km92wu",
    "title": "How do I M23 move on from my Friend F22 who hurt me?",
    "text": "I M23 have been friends with a girl F22 for about a year and we were very close but after her breakup nearly a year ago. We were close and she would explain to me how she refused to date, wanted fun with friends, and we spent time together for sometime during the time of her break up we were close she wanted to meet my parents out of nowhere, got nervous meeting my father, when I got back with an ex F22 my friend was heavily against it and telling me to think about the bad too along with the arguments, the boundaries, rules and just wanting me to be happy. She always seemed nervous when talking to me when I would offer to spend time with her from time to time. She was being tense and saying yes but then acting distant but later when I was down she would not be quiet, ranting onto me about life and trying to break the silence because I was stressed with my career, chaotic family life, and feeling awkward in this tension of her acting super weird but then distant. Later on she vented to me about how she was in love with a guy she met at a bar and wanted to marry him and told him that desire only for him to be scared off but she is hoping to salvage it through friendship. I feel very betrayed as to be honest I did have feelings for her after all the time we spent together, I loved her personality, the connection we had, and the possibilities. I want to severe ties with her as it feels rather unhealthy.",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/relationship_advice/comments/1km92wu/how_do_i_m23_move_on_from_my_friend_f22_who_hurt/",
    "author": "Bellica32",
    "created_utc": 1747206956.0,
    "subreddit": "relationship_advice",
    "score": 1,
    "num_comments": 1,
    "timestamp_collected": "2025-05-14T00:16:13.877347",
    "comments": [],
    "post_length": 1428,
    "title_length": 52,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Posts must contain a title, description, TLDR, & basic info like ages, genders",
        "description": "Posts MUST include: \n\n* A title that summarizes the problem or question. This is where the ages/genders should be placed.\n* A description of your situation.\n* A question or a request for what advice you want.\n* Length of Relationship\n* A brief [**tl;dr**](http://en.wiktionary.org/wiki/TLDR) if your post is long.\n\nExamples of ages/genders in the title:\n\n- I [24M] have an issue with my aunt, [45F]\n\n- My partner [19NB] told me [21MtF]\n\n- I [45F] love my husband [51M]",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Post does not feature detailed information, or lacks a descriptive title, tldr, or similar"
      },
      {
        "short_name": "All posts must request specific advice on a specific, real situation between two or more people",
        "description": "We do not allow vague requests for advice such as:\n\n- What would you do?\n\n- What should I do?\n\n- Any advice would be appreciated\n\nLikewise, we do not allow:\n\n- Vents/rants\n\n- Posts about past or potential relationships\n\n- Posts giving advice\n\nLastly, this subreddit relies on honesty. If your content is in any capacity dishonest (examples include: chatGPT posts, creative writing, profile inconsistencies) it will be removed and you will be banned.",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Post does not request advice on a real situation between two or more people."
      },
      {
        "short_name": "No questions that can be answered with yes or no (aka moral judgment)",
        "description": "Your post is a yes or no question (aka moral judgement) if your question starts with or contains any of the following:\n\n- Is it...?\n\n- Asking if you or the subject of the post is right or wrong.\n\n- Am I....?\n\n- Any variation of “Am I The Asshole?”, including AITA\n\n- Does/Have anybody else...?\n\n- Should I…?\n\n- Would you....?\n\n- Is this.....?\n\n- Can I...?\n\n\n#If the question in your post can be answered with a yes or no question, it is moral judgement and will be removed.",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Yes or no/ Moral Judgement Request"
      },
      {
        "short_name": "Things This Sub Can't Give Advice On:",
        "description": "Rants, unsolicited advice, letters to an ex, \"body counts\" or number of sexual partners, mental health issues, medical health issues, legal problems, financial problems, any situations involving minors (under 18 regardless of local laws), and any situations involving abuse (violence, sexual, emotional etc). All of these will be removed and locked.",
        "kind": "link",
        "priority": 3,
        "violation_reason": "Not Applicable to the Sub"
      },
      {
        "short_name": "Only One Update Is Allowed",
        "description": "You can submit **one** update post at any time after 48 hours has past from the original post. \n\nAdditional advice may be requested in new posts but they may not be continuations of the orignal one. E.g. no titles saying \"Update 2\" or \"Update 4\". We're not a blog. Please post further updates on your own profile.",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Too many updates"
      },
      {
        "short_name": "Surveys, Academic Research, Information Requests, and Media Questions Should Be Sent to Modmail",
        "description": "Surveys, information requests, and journalistic or academic research questions must be sent to [modmail](https://www.reddit.com/message/compose?to=/r/relationship_advice) prior to posting.  If you are doing academic research, message us with your IRB number, a point of contact for us to verify your pending research, and the details of your research for consideration. Press Requests must be routed through modmail, via u/eganist , before communicating with users directly.",
        "kind": "link",
        "priority": 5,
        "violation_reason": "Surveys, Academic Research, Information Requests, and Media Questions Should Be Sent to Modmail"
      },
      {
        "short_name": "All comments must be on topic, and focus on the OP, and be made in good faith",
        "description": "Derailing arguments, jokes fighting, and moral whataboutism is not allowed. Give good, ethical advice. Remember, the goal is to help your fellow human.",
        "kind": "all",
        "priority": 6,
        "violation_reason": "derailing, fighting, whataboutism, or not in good faith"
      },
      {
        "short_name": "Keep It Civil",
        "description": "No insults, no threats of violence, no encouraging violence, no telling an OP to go to punch someone else, no threats, no harassment, no trolling, no advertising other subs, no spam. You will be banned. \n\nAll bans in this sub are permanent. You don't get a free pass.\n\nFor more information, please see our [rules](https://www.reddit.com/r/relationship_advice/wiki/rules#wiki_rule_8)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Insults, violence, harassment, trolling, spam"
      },
      {
        "short_name": "No referencing hateful or abusive subs/individuals/content",
        "description": "**No referencing hateful or abusive subs/individuals and content**. No advocating for or referencing content that is conspiratorial in nature, transphobic, anti-women/men, anti-LBGT+, that promote anti-vaxx or anti-science content, or contains harmful rhetoric against groups of people. Think includes linking to subs that feature this. You will be banned. You don't get a free pass. \n\n[Further information](https://www.reddit.com/r/relationship_advice/wiki/rules#wiki_rule_9)",
        "kind": "all",
        "priority": 8,
        "violation_reason": "references hateful/abusive content/subs/individuals"
      },
      {
        "short_name": "Do not directly message users",
        "description": "If you wish to opine on the matter at hand, you are to comment on the post. Users found to be privately messaging other users to circumvent this directive will be met with a permanent, irrevocable ban. \n\n**If a user has sent you harassing messages, please upload your screenshot to Imgur.com, and notify the mods via modmail. We will action the user accordingly.**",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Do not directly message users"
      },
      {
        "short_name": "No situations involving people under 18",
        "description": "Your content has been removed because it involves a situation with someone under the age of 18. Please note that changing your ages to get around this rule will result in an immediate ban.\n\nPlease consider posting this to our sister subreddit, r/teenrelationships",
        "kind": "link",
        "priority": 10,
        "violation_reason": "No situations involving people under 18"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T01:01:55.014030",
    "hours_tracked": 0.2762809205717511
  },
  {
    "id": "1km93w2",
    "title": "Who can make you ejaculate in under a minute?",
    "text": "",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/AskReddit/comments/1km93w2/who_can_make_you_ejaculate_in_under_a_minute/",
    "author": "Equivalent_Ad_9066",
    "created_utc": 1747207064.0,
    "subreddit": "AskReddit",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-14T00:18:05.983581",
    "comments": [],
    "post_length": 0,
    "title_length": 45,
    "is_self": true,
    "is_video": false,
    "over_18": true,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Rule 1 - Questions must be clear and direct and may not use the body textbox",
        "description": "* All questions must be clear, written in English, and conclude with a question mark\n* All context in the title must be ***necessary to understanding the question***; do not give “example answers” in the post title (i.e. “Other than your mom, \\_\\_\\_\\_\\_\\_?”)\n* No text in the text box - any additional info from you must be added as a comment to your post\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_1-)",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Rule 1 - Questions must be clear and direct and may not use the body textbox"
      },
      {
        "short_name": "Rule 2 - No personal or professional advice requests",
        "description": "* Askreddit is NOT your personal or professional advice platform\n\n* Do not makes posts asking for professional advice - medical, legal, financial, or otherwise\n\n* All posts asking for advice must be generic and not specific to your situation alone\n\n* Do not use first person pronouns\n\n* No crowdsourcing naming or purchasing decisions\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_2-)",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Rule 2 - No personal or professional advice requests"
      },
      {
        "short_name": "Rule 3 - Open ended questions only",
        "description": "* Post must be an open-ended discussion question\n\n* Title must not be phrased to allow a simple yes/no answer\n\n* No questions that have definite answers\n\n* Question must not be a poll or survey\n\n* No “Either/Or” type questions\n\n* Do not ask for NSFW links\n\n* Do not specify a length (eg \"in three words...\") or make your post into a game\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_3-)",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Rule 3 - Open ended questions only"
      },
      {
        "short_name": "Rule 4 - No personal info",
        "description": "* Do not post or seek any **real or fake** personal information (examples include: full names, phone numbers, email addresses, or social media accounts)\n\n* Only link another user's comment when it is relevant and **never** when it is to launch a personal attack or encourage others to do so\n\n* Do not ask questions designed to target specific usernames or links to social media\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_4-)",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Rule 4 - No personal info"
      },
      {
        "short_name": "Rule 5 - No loaded questions",
        "description": "- Do not include an opinion, bias, or lead respondents towards expressing a specific opinion in your post title\n\n- Do not use this subreddit to promote a specific agenda or to gain positive or negative publicity for an entity or person\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_5-)",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Rule 5 - No loaded questions"
      },
      {
        "short_name": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies",
        "description": "* [Serious] posts are off-limits for joke replies and irrelevant or off-topic comments and discussion\n\n* If the OP asks for answers from a specific group in a [Serious] post, top level comments must be made from members of that group\n\n* Posts that do not receive relevant answers within an hour will be removed\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_6-)",
        "kind": "all",
        "priority": 5,
        "violation_reason": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies"
      },
      {
        "short_name": "Rule 7 - No begging for goods or services, or Reddit rewards",
        "description": "* Do not ask for Reddit rewards, money, goods, services,or favors\n\n* Do not form a brigade to draw positive or negative attention to posts or comments in AskReddit, even from other subreddits\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_7-)",
        "kind": "all",
        "priority": 6,
        "violation_reason": "Rule 7 - No begging for goods or services, or Reddit rewards"
      },
      {
        "short_name": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner",
        "description": "* Do not make personal attacks, insult, or demean a specific group or person\n\n* Do not use slurs without relevant context and quotes\n\n* No blatant statements of bigotry\n\n* No posts that 'bait' users into breaking other rules\n\n* Zero tolerance for posts/comments that sexualize minors\n\n* Zero tolerance for posts/comments that encourage suicide\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_8-)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner"
      },
      {
        "short_name": "Rule 9 -  No image only replies or large ascii art",
        "description": "* Comment replies must consist of more than just an image or link\n\n* No ASCII/emoji images over one line\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_9-)",
        "kind": "comment",
        "priority": 8,
        "violation_reason": "Rule 9 -  No image only replies or large ascii art"
      },
      {
        "short_name": "Rule 10 - Harmful Misinformation",
        "description": "* Do not downplay the effects of a medical crisis\n* Do not undermine the efficacy of vaccines where there is widespread agreement among the medical and scientific communities\n* Do not encourage illegal activity\n* Do not encourage delayed medical treatment\n\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-harmful_misinformation-)",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Rule 10 - Harmful Misinformation"
      },
      {
        "short_name": "Rule 11 - No spam, machine generated content or karma farming",
        "description": "* Do not post spam\n* Do not edit comments to mislead and/or advertise\n* Do not farm karma or shotgun comments\n* Bots are not allowed in r/AskReddit\n\n[The full rule can be viewed here](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_11-)",
        "kind": "all",
        "priority": 10,
        "violation_reason": "Rule 11 - No spam, machine generated content or karma farming"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[removed]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T01:02:07.072025",
    "hours_tracked": 0.24514016422960494
  },
  {
    "id": "1km93yc",
    "title": "Whats the moment when you realized someone was really depressed, and it actually scared you?",
    "text": "",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/AskReddit/comments/1km93yc/whats_the_moment_when_you_realized_someone_was/",
    "author": "ThickMark6996",
    "created_utc": 1747207072.0,
    "subreddit": "AskReddit",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-14T00:18:09.977409",
    "comments": [],
    "post_length": 0,
    "title_length": 93,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Rule 1 - Questions must be clear and direct and may not use the body textbox",
        "description": "* All questions must be clear, written in English, and conclude with a question mark\n* All context in the title must be ***necessary to understanding the question***; do not give “example answers” in the post title (i.e. “Other than your mom, \\_\\_\\_\\_\\_\\_?”)\n* No text in the text box - any additional info from you must be added as a comment to your post\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_1-)",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Rule 1 - Questions must be clear and direct and may not use the body textbox"
      },
      {
        "short_name": "Rule 2 - No personal or professional advice requests",
        "description": "* Askreddit is NOT your personal or professional advice platform\n\n* Do not makes posts asking for professional advice - medical, legal, financial, or otherwise\n\n* All posts asking for advice must be generic and not specific to your situation alone\n\n* Do not use first person pronouns\n\n* No crowdsourcing naming or purchasing decisions\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_2-)",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Rule 2 - No personal or professional advice requests"
      },
      {
        "short_name": "Rule 3 - Open ended questions only",
        "description": "* Post must be an open-ended discussion question\n\n* Title must not be phrased to allow a simple yes/no answer\n\n* No questions that have definite answers\n\n* Question must not be a poll or survey\n\n* No “Either/Or” type questions\n\n* Do not ask for NSFW links\n\n* Do not specify a length (eg \"in three words...\") or make your post into a game\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_3-)",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Rule 3 - Open ended questions only"
      },
      {
        "short_name": "Rule 4 - No personal info",
        "description": "* Do not post or seek any **real or fake** personal information (examples include: full names, phone numbers, email addresses, or social media accounts)\n\n* Only link another user's comment when it is relevant and **never** when it is to launch a personal attack or encourage others to do so\n\n* Do not ask questions designed to target specific usernames or links to social media\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_4-)",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Rule 4 - No personal info"
      },
      {
        "short_name": "Rule 5 - No loaded questions",
        "description": "- Do not include an opinion, bias, or lead respondents towards expressing a specific opinion in your post title\n\n- Do not use this subreddit to promote a specific agenda or to gain positive or negative publicity for an entity or person\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_5-)",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Rule 5 - No loaded questions"
      },
      {
        "short_name": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies",
        "description": "* [Serious] posts are off-limits for joke replies and irrelevant or off-topic comments and discussion\n\n* If the OP asks for answers from a specific group in a [Serious] post, top level comments must be made from members of that group\n\n* Posts that do not receive relevant answers within an hour will be removed\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_6-)",
        "kind": "all",
        "priority": 5,
        "violation_reason": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies"
      },
      {
        "short_name": "Rule 7 - No begging for goods or services, or Reddit rewards",
        "description": "* Do not ask for Reddit rewards, money, goods, services,or favors\n\n* Do not form a brigade to draw positive or negative attention to posts or comments in AskReddit, even from other subreddits\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_7-)",
        "kind": "all",
        "priority": 6,
        "violation_reason": "Rule 7 - No begging for goods or services, or Reddit rewards"
      },
      {
        "short_name": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner",
        "description": "* Do not make personal attacks, insult, or demean a specific group or person\n\n* Do not use slurs without relevant context and quotes\n\n* No blatant statements of bigotry\n\n* No posts that 'bait' users into breaking other rules\n\n* Zero tolerance for posts/comments that sexualize minors\n\n* Zero tolerance for posts/comments that encourage suicide\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_8-)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner"
      },
      {
        "short_name": "Rule 9 -  No image only replies or large ascii art",
        "description": "* Comment replies must consist of more than just an image or link\n\n* No ASCII/emoji images over one line\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_9-)",
        "kind": "comment",
        "priority": 8,
        "violation_reason": "Rule 9 -  No image only replies or large ascii art"
      },
      {
        "short_name": "Rule 10 - Harmful Misinformation",
        "description": "* Do not downplay the effects of a medical crisis\n* Do not undermine the efficacy of vaccines where there is widespread agreement among the medical and scientific communities\n* Do not encourage illegal activity\n* Do not encourage delayed medical treatment\n\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-harmful_misinformation-)",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Rule 10 - Harmful Misinformation"
      },
      {
        "short_name": "Rule 11 - No spam, machine generated content or karma farming",
        "description": "* Do not post spam\n* Do not edit comments to mislead and/or advertise\n* Do not farm karma or shotgun comments\n* Bots are not allowed in r/AskReddit\n\n[The full rule can be viewed here](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_11-)",
        "kind": "all",
        "priority": 10,
        "violation_reason": "Rule 11 - No spam, machine generated content or karma farming"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T01:02:11.039372",
    "hours_tracked": 0.2440324945582284
  },
  {
    "id": "1km97gy",
    "title": "Is it called hear because of ear, or the other way around, and why?",
    "text": "",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/AskReddit/comments/1km97gy/is_it_called_hear_because_of_ear_or_the_other_way/",
    "author": "Mountain-Sign-3570",
    "created_utc": 1747207481.0,
    "subreddit": "AskReddit",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-14T00:24:56.349447",
    "comments": [],
    "post_length": 0,
    "title_length": 67,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Rule 1 - Questions must be clear and direct and may not use the body textbox",
        "description": "* All questions must be clear, written in English, and conclude with a question mark\n* All context in the title must be ***necessary to understanding the question***; do not give “example answers” in the post title (i.e. “Other than your mom, \\_\\_\\_\\_\\_\\_?”)\n* No text in the text box - any additional info from you must be added as a comment to your post\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_1-)",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Rule 1 - Questions must be clear and direct and may not use the body textbox"
      },
      {
        "short_name": "Rule 2 - No personal or professional advice requests",
        "description": "* Askreddit is NOT your personal or professional advice platform\n\n* Do not makes posts asking for professional advice - medical, legal, financial, or otherwise\n\n* All posts asking for advice must be generic and not specific to your situation alone\n\n* Do not use first person pronouns\n\n* No crowdsourcing naming or purchasing decisions\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_2-)",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Rule 2 - No personal or professional advice requests"
      },
      {
        "short_name": "Rule 3 - Open ended questions only",
        "description": "* Post must be an open-ended discussion question\n\n* Title must not be phrased to allow a simple yes/no answer\n\n* No questions that have definite answers\n\n* Question must not be a poll or survey\n\n* No “Either/Or” type questions\n\n* Do not ask for NSFW links\n\n* Do not specify a length (eg \"in three words...\") or make your post into a game\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_3-)",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Rule 3 - Open ended questions only"
      },
      {
        "short_name": "Rule 4 - No personal info",
        "description": "* Do not post or seek any **real or fake** personal information (examples include: full names, phone numbers, email addresses, or social media accounts)\n\n* Only link another user's comment when it is relevant and **never** when it is to launch a personal attack or encourage others to do so\n\n* Do not ask questions designed to target specific usernames or links to social media\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_4-)",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Rule 4 - No personal info"
      },
      {
        "short_name": "Rule 5 - No loaded questions",
        "description": "- Do not include an opinion, bias, or lead respondents towards expressing a specific opinion in your post title\n\n- Do not use this subreddit to promote a specific agenda or to gain positive or negative publicity for an entity or person\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_5-)",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Rule 5 - No loaded questions"
      },
      {
        "short_name": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies",
        "description": "* [Serious] posts are off-limits for joke replies and irrelevant or off-topic comments and discussion\n\n* If the OP asks for answers from a specific group in a [Serious] post, top level comments must be made from members of that group\n\n* Posts that do not receive relevant answers within an hour will be removed\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_6-)",
        "kind": "all",
        "priority": 5,
        "violation_reason": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies"
      },
      {
        "short_name": "Rule 7 - No begging for goods or services, or Reddit rewards",
        "description": "* Do not ask for Reddit rewards, money, goods, services,or favors\n\n* Do not form a brigade to draw positive or negative attention to posts or comments in AskReddit, even from other subreddits\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_7-)",
        "kind": "all",
        "priority": 6,
        "violation_reason": "Rule 7 - No begging for goods or services, or Reddit rewards"
      },
      {
        "short_name": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner",
        "description": "* Do not make personal attacks, insult, or demean a specific group or person\n\n* Do not use slurs without relevant context and quotes\n\n* No blatant statements of bigotry\n\n* No posts that 'bait' users into breaking other rules\n\n* Zero tolerance for posts/comments that sexualize minors\n\n* Zero tolerance for posts/comments that encourage suicide\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_8-)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner"
      },
      {
        "short_name": "Rule 9 -  No image only replies or large ascii art",
        "description": "* Comment replies must consist of more than just an image or link\n\n* No ASCII/emoji images over one line\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_9-)",
        "kind": "comment",
        "priority": 8,
        "violation_reason": "Rule 9 -  No image only replies or large ascii art"
      },
      {
        "short_name": "Rule 10 - Harmful Misinformation",
        "description": "* Do not downplay the effects of a medical crisis\n* Do not undermine the efficacy of vaccines where there is widespread agreement among the medical and scientific communities\n* Do not encourage illegal activity\n* Do not encourage delayed medical treatment\n\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-harmful_misinformation-)",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Rule 10 - Harmful Misinformation"
      },
      {
        "short_name": "Rule 11 - No spam, machine generated content or karma farming",
        "description": "* Do not post spam\n* Do not edit comments to mislead and/or advertise\n* Do not farm karma or shotgun comments\n* Bots are not allowed in r/AskReddit\n\n[The full rule can be viewed here](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_11-)",
        "kind": "all",
        "priority": 10,
        "violation_reason": "Rule 11 - No spam, machine generated content or karma farming"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "moderator",
    "raw_banned_by": null,
    "raw_author_is_none": false,
    "raw_selftext_value": null,
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T01:02:43.081004",
    "hours_tracked": 0.13114968644248115
  },
  {
    "id": "1km97iq",
    "title": "Have you ever stopped someone from taking their own life? What happened?",
    "text": "",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/AskReddit/comments/1km97iq/have_you_ever_stopped_someone_from_taking_their/",
    "author": "ThickMark6996",
    "created_utc": 1747207487.0,
    "subreddit": "AskReddit",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-14T00:25:00.350186",
    "comments": [],
    "post_length": 0,
    "title_length": 72,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Rule 1 - Questions must be clear and direct and may not use the body textbox",
        "description": "* All questions must be clear, written in English, and conclude with a question mark\n* All context in the title must be ***necessary to understanding the question***; do not give “example answers” in the post title (i.e. “Other than your mom, \\_\\_\\_\\_\\_\\_?”)\n* No text in the text box - any additional info from you must be added as a comment to your post\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_1-)",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Rule 1 - Questions must be clear and direct and may not use the body textbox"
      },
      {
        "short_name": "Rule 2 - No personal or professional advice requests",
        "description": "* Askreddit is NOT your personal or professional advice platform\n\n* Do not makes posts asking for professional advice - medical, legal, financial, or otherwise\n\n* All posts asking for advice must be generic and not specific to your situation alone\n\n* Do not use first person pronouns\n\n* No crowdsourcing naming or purchasing decisions\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_2-)",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Rule 2 - No personal or professional advice requests"
      },
      {
        "short_name": "Rule 3 - Open ended questions only",
        "description": "* Post must be an open-ended discussion question\n\n* Title must not be phrased to allow a simple yes/no answer\n\n* No questions that have definite answers\n\n* Question must not be a poll or survey\n\n* No “Either/Or” type questions\n\n* Do not ask for NSFW links\n\n* Do not specify a length (eg \"in three words...\") or make your post into a game\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_3-)",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Rule 3 - Open ended questions only"
      },
      {
        "short_name": "Rule 4 - No personal info",
        "description": "* Do not post or seek any **real or fake** personal information (examples include: full names, phone numbers, email addresses, or social media accounts)\n\n* Only link another user's comment when it is relevant and **never** when it is to launch a personal attack or encourage others to do so\n\n* Do not ask questions designed to target specific usernames or links to social media\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_4-)",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Rule 4 - No personal info"
      },
      {
        "short_name": "Rule 5 - No loaded questions",
        "description": "- Do not include an opinion, bias, or lead respondents towards expressing a specific opinion in your post title\n\n- Do not use this subreddit to promote a specific agenda or to gain positive or negative publicity for an entity or person\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_5-)",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Rule 5 - No loaded questions"
      },
      {
        "short_name": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies",
        "description": "* [Serious] posts are off-limits for joke replies and irrelevant or off-topic comments and discussion\n\n* If the OP asks for answers from a specific group in a [Serious] post, top level comments must be made from members of that group\n\n* Posts that do not receive relevant answers within an hour will be removed\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_6-)",
        "kind": "all",
        "priority": 5,
        "violation_reason": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies"
      },
      {
        "short_name": "Rule 7 - No begging for goods or services, or Reddit rewards",
        "description": "* Do not ask for Reddit rewards, money, goods, services,or favors\n\n* Do not form a brigade to draw positive or negative attention to posts or comments in AskReddit, even from other subreddits\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_7-)",
        "kind": "all",
        "priority": 6,
        "violation_reason": "Rule 7 - No begging for goods or services, or Reddit rewards"
      },
      {
        "short_name": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner",
        "description": "* Do not make personal attacks, insult, or demean a specific group or person\n\n* Do not use slurs without relevant context and quotes\n\n* No blatant statements of bigotry\n\n* No posts that 'bait' users into breaking other rules\n\n* Zero tolerance for posts/comments that sexualize minors\n\n* Zero tolerance for posts/comments that encourage suicide\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_8-)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner"
      },
      {
        "short_name": "Rule 9 -  No image only replies or large ascii art",
        "description": "* Comment replies must consist of more than just an image or link\n\n* No ASCII/emoji images over one line\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_9-)",
        "kind": "comment",
        "priority": 8,
        "violation_reason": "Rule 9 -  No image only replies or large ascii art"
      },
      {
        "short_name": "Rule 10 - Harmful Misinformation",
        "description": "* Do not downplay the effects of a medical crisis\n* Do not undermine the efficacy of vaccines where there is widespread agreement among the medical and scientific communities\n* Do not encourage illegal activity\n* Do not encourage delayed medical treatment\n\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-harmful_misinformation-)",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Rule 10 - Harmful Misinformation"
      },
      {
        "short_name": "Rule 11 - No spam, machine generated content or karma farming",
        "description": "* Do not post spam\n* Do not edit comments to mislead and/or advertise\n* Do not farm karma or shotgun comments\n* Bots are not allowed in r/AskReddit\n\n[The full rule can be viewed here](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_11-)",
        "kind": "all",
        "priority": 10,
        "violation_reason": "Rule 11 - No spam, machine generated content or karma farming"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "moderator",
    "raw_banned_by": null,
    "raw_author_is_none": false,
    "raw_selftext_value": null,
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T01:02:45.070621",
    "hours_tracked": 0.13003616750240327
  },
  {
    "id": "1km97ne",
    "title": "F20 and M21 I dont like my birthday gift. We agreed on a 50-50 relationship. What to do?",
    "text": "Reddit, today is my 20th birthday! Yay! Anyway, I asked my boyfriend what he was getting me for my birthday, and he said it was a surprise, so Ive been waiting for like a bit, and then he showed me the product. The thing that he got me was a box. Im not even joking. It was a box. He just painted it with his spraygun, and honestly, I feel a little bit mad if Im being honest, I was expecting maybe flowers or at least chocolate, you know, that things that girls typically want. Thats not even expensive. I know hes not a mind reader, but honestly, it does not take critical thinking to figure out that probably most people would not want a box for their birthday. Its just a tiny wooden box in a singular color. Honestly, things have been a little bit rough also cause whenever we go out on dates, he doesnt spend hardly anything on me. Im not a gold digger, read the text some more. Recently we went to the mall a couple weeks ago and I think it should be 50-50 when dating, so I treated my boyfriend to a bunch of different stuff then at the end of the date I said I wanted to go to cheesecake factory he said OK and when we went, I said I was hungry and he said wow thats way too expensive so he just ordered me a slice of cheesecake. I got so mad and frustrated, and embarrassed. He wouldnt even buy us dinner. I dont know was even right to be upset in the situation. He spent 13 on me while I spent over 100. Its not even like hes unemployed because then I could understand. A couple of months ago, I helped him get a job at my place, and hes been working there since, and he does make pretty decent money, and he tells me all the time how much hes got saved, so I know its not him not having money. Honestly, Im a little bit fed up because whenever I spend money on him, he does not spend money back on me. I think relationship should be 50-50, and thats what we agreed on. I dont like my gift and I wanna ask if I could have something different, but I dont wanna start something. I feel a little bit confused and angry. You can go through my other post to see what other relationship problems Ive had with him, but hes very nice the majority of the time and hes never really gotten super angry, so Im at a loss.",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/relationship_advice/comments/1km97ne/f20_and_m21_i_dont_like_my_birthday_gift_we/",
    "author": "CaramelInkk",
    "created_utc": 1747207503.0,
    "subreddit": "relationship_advice",
    "score": 1,
    "num_comments": 1,
    "timestamp_collected": "2025-05-14T00:25:20.376032",
    "comments": [],
    "post_length": 2251,
    "title_length": 89,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Posts must contain a title, description, TLDR, & basic info like ages, genders",
        "description": "Posts MUST include: \n\n* A title that summarizes the problem or question. This is where the ages/genders should be placed.\n* A description of your situation.\n* A question or a request for what advice you want.\n* Length of Relationship\n* A brief [**tl;dr**](http://en.wiktionary.org/wiki/TLDR) if your post is long.\n\nExamples of ages/genders in the title:\n\n- I [24M] have an issue with my aunt, [45F]\n\n- My partner [19NB] told me [21MtF]\n\n- I [45F] love my husband [51M]",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Post does not feature detailed information, or lacks a descriptive title, tldr, or similar"
      },
      {
        "short_name": "All posts must request specific advice on a specific, real situation between two or more people",
        "description": "We do not allow vague requests for advice such as:\n\n- What would you do?\n\n- What should I do?\n\n- Any advice would be appreciated\n\nLikewise, we do not allow:\n\n- Vents/rants\n\n- Posts about past or potential relationships\n\n- Posts giving advice\n\nLastly, this subreddit relies on honesty. If your content is in any capacity dishonest (examples include: chatGPT posts, creative writing, profile inconsistencies) it will be removed and you will be banned.",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Post does not request advice on a real situation between two or more people."
      },
      {
        "short_name": "No questions that can be answered with yes or no (aka moral judgment)",
        "description": "Your post is a yes or no question (aka moral judgement) if your question starts with or contains any of the following:\n\n- Is it...?\n\n- Asking if you or the subject of the post is right or wrong.\n\n- Am I....?\n\n- Any variation of “Am I The Asshole?”, including AITA\n\n- Does/Have anybody else...?\n\n- Should I…?\n\n- Would you....?\n\n- Is this.....?\n\n- Can I...?\n\n\n#If the question in your post can be answered with a yes or no question, it is moral judgement and will be removed.",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Yes or no/ Moral Judgement Request"
      },
      {
        "short_name": "Things This Sub Can't Give Advice On:",
        "description": "Rants, unsolicited advice, letters to an ex, \"body counts\" or number of sexual partners, mental health issues, medical health issues, legal problems, financial problems, any situations involving minors (under 18 regardless of local laws), and any situations involving abuse (violence, sexual, emotional etc). All of these will be removed and locked.",
        "kind": "link",
        "priority": 3,
        "violation_reason": "Not Applicable to the Sub"
      },
      {
        "short_name": "Only One Update Is Allowed",
        "description": "You can submit **one** update post at any time after 48 hours has past from the original post. \n\nAdditional advice may be requested in new posts but they may not be continuations of the orignal one. E.g. no titles saying \"Update 2\" or \"Update 4\". We're not a blog. Please post further updates on your own profile.",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Too many updates"
      },
      {
        "short_name": "Surveys, Academic Research, Information Requests, and Media Questions Should Be Sent to Modmail",
        "description": "Surveys, information requests, and journalistic or academic research questions must be sent to [modmail](https://www.reddit.com/message/compose?to=/r/relationship_advice) prior to posting.  If you are doing academic research, message us with your IRB number, a point of contact for us to verify your pending research, and the details of your research for consideration. Press Requests must be routed through modmail, via u/eganist , before communicating with users directly.",
        "kind": "link",
        "priority": 5,
        "violation_reason": "Surveys, Academic Research, Information Requests, and Media Questions Should Be Sent to Modmail"
      },
      {
        "short_name": "All comments must be on topic, and focus on the OP, and be made in good faith",
        "description": "Derailing arguments, jokes fighting, and moral whataboutism is not allowed. Give good, ethical advice. Remember, the goal is to help your fellow human.",
        "kind": "all",
        "priority": 6,
        "violation_reason": "derailing, fighting, whataboutism, or not in good faith"
      },
      {
        "short_name": "Keep It Civil",
        "description": "No insults, no threats of violence, no encouraging violence, no telling an OP to go to punch someone else, no threats, no harassment, no trolling, no advertising other subs, no spam. You will be banned. \n\nAll bans in this sub are permanent. You don't get a free pass.\n\nFor more information, please see our [rules](https://www.reddit.com/r/relationship_advice/wiki/rules#wiki_rule_8)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Insults, violence, harassment, trolling, spam"
      },
      {
        "short_name": "No referencing hateful or abusive subs/individuals/content",
        "description": "**No referencing hateful or abusive subs/individuals and content**. No advocating for or referencing content that is conspiratorial in nature, transphobic, anti-women/men, anti-LBGT+, that promote anti-vaxx or anti-science content, or contains harmful rhetoric against groups of people. Think includes linking to subs that feature this. You will be banned. You don't get a free pass. \n\n[Further information](https://www.reddit.com/r/relationship_advice/wiki/rules#wiki_rule_9)",
        "kind": "all",
        "priority": 8,
        "violation_reason": "references hateful/abusive content/subs/individuals"
      },
      {
        "short_name": "Do not directly message users",
        "description": "If you wish to opine on the matter at hand, you are to comment on the post. Users found to be privately messaging other users to circumvent this directive will be met with a permanent, irrevocable ban. \n\n**If a user has sent you harassing messages, please upload your screenshot to Imgur.com, and notify the mods via modmail. We will action the user accordingly.**",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Do not directly message users"
      },
      {
        "short_name": "No situations involving people under 18",
        "description": "Your content has been removed because it involves a situation with someone under the age of 18. Please note that changing your ages to get around this rule will result in an immediate ban.\n\nPlease consider posting this to our sister subreddit, r/teenrelationships",
        "kind": "link",
        "priority": 10,
        "violation_reason": "No situations involving people under 18"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T01:02:47.124032",
    "hours_tracked": 0.12446554217073652
  },
  {
    "id": "1km98gw",
    "title": "Mother in law has cancer and was given 3 months to live. Being at a loss for words, what would you tell your wife?",
    "text": "",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/AskReddit/comments/1km98gw/mother_in_law_has_cancer_and_was_given_3_months/",
    "author": "dislimb",
    "created_utc": 1747207600.0,
    "subreddit": "AskReddit",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-14T00:27:00.469170",
    "comments": [],
    "post_length": 0,
    "title_length": 114,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Rule 1 - Questions must be clear and direct and may not use the body textbox",
        "description": "* All questions must be clear, written in English, and conclude with a question mark\n* All context in the title must be ***necessary to understanding the question***; do not give “example answers” in the post title (i.e. “Other than your mom, \\_\\_\\_\\_\\_\\_?”)\n* No text in the text box - any additional info from you must be added as a comment to your post\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_1-)",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Rule 1 - Questions must be clear and direct and may not use the body textbox"
      },
      {
        "short_name": "Rule 2 - No personal or professional advice requests",
        "description": "* Askreddit is NOT your personal or professional advice platform\n\n* Do not makes posts asking for professional advice - medical, legal, financial, or otherwise\n\n* All posts asking for advice must be generic and not specific to your situation alone\n\n* Do not use first person pronouns\n\n* No crowdsourcing naming or purchasing decisions\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_2-)",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Rule 2 - No personal or professional advice requests"
      },
      {
        "short_name": "Rule 3 - Open ended questions only",
        "description": "* Post must be an open-ended discussion question\n\n* Title must not be phrased to allow a simple yes/no answer\n\n* No questions that have definite answers\n\n* Question must not be a poll or survey\n\n* No “Either/Or” type questions\n\n* Do not ask for NSFW links\n\n* Do not specify a length (eg \"in three words...\") or make your post into a game\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_3-)",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Rule 3 - Open ended questions only"
      },
      {
        "short_name": "Rule 4 - No personal info",
        "description": "* Do not post or seek any **real or fake** personal information (examples include: full names, phone numbers, email addresses, or social media accounts)\n\n* Only link another user's comment when it is relevant and **never** when it is to launch a personal attack or encourage others to do so\n\n* Do not ask questions designed to target specific usernames or links to social media\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_4-)",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Rule 4 - No personal info"
      },
      {
        "short_name": "Rule 5 - No loaded questions",
        "description": "- Do not include an opinion, bias, or lead respondents towards expressing a specific opinion in your post title\n\n- Do not use this subreddit to promote a specific agenda or to gain positive or negative publicity for an entity or person\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_5-)",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Rule 5 - No loaded questions"
      },
      {
        "short_name": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies",
        "description": "* [Serious] posts are off-limits for joke replies and irrelevant or off-topic comments and discussion\n\n* If the OP asks for answers from a specific group in a [Serious] post, top level comments must be made from members of that group\n\n* Posts that do not receive relevant answers within an hour will be removed\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_6-)",
        "kind": "all",
        "priority": 5,
        "violation_reason": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies"
      },
      {
        "short_name": "Rule 7 - No begging for goods or services, or Reddit rewards",
        "description": "* Do not ask for Reddit rewards, money, goods, services,or favors\n\n* Do not form a brigade to draw positive or negative attention to posts or comments in AskReddit, even from other subreddits\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_7-)",
        "kind": "all",
        "priority": 6,
        "violation_reason": "Rule 7 - No begging for goods or services, or Reddit rewards"
      },
      {
        "short_name": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner",
        "description": "* Do not make personal attacks, insult, or demean a specific group or person\n\n* Do not use slurs without relevant context and quotes\n\n* No blatant statements of bigotry\n\n* No posts that 'bait' users into breaking other rules\n\n* Zero tolerance for posts/comments that sexualize minors\n\n* Zero tolerance for posts/comments that encourage suicide\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_8-)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner"
      },
      {
        "short_name": "Rule 9 -  No image only replies or large ascii art",
        "description": "* Comment replies must consist of more than just an image or link\n\n* No ASCII/emoji images over one line\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_9-)",
        "kind": "comment",
        "priority": 8,
        "violation_reason": "Rule 9 -  No image only replies or large ascii art"
      },
      {
        "short_name": "Rule 10 - Harmful Misinformation",
        "description": "* Do not downplay the effects of a medical crisis\n* Do not undermine the efficacy of vaccines where there is widespread agreement among the medical and scientific communities\n* Do not encourage illegal activity\n* Do not encourage delayed medical treatment\n\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-harmful_misinformation-)",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Rule 10 - Harmful Misinformation"
      },
      {
        "short_name": "Rule 11 - No spam, machine generated content or karma farming",
        "description": "* Do not post spam\n* Do not edit comments to mislead and/or advertise\n* Do not farm karma or shotgun comments\n* Bots are not allowed in r/AskReddit\n\n[The full rule can be viewed here](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_11-)",
        "kind": "all",
        "priority": 10,
        "violation_reason": "Rule 11 - No spam, machine generated content or karma farming"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T01:02:55.101915",
    "hours_tracked": 0.09667186319828033
  },
  {
    "id": "1km98xz",
    "title": "Long-time married couples, what is your best advice for struggling couples?",
    "text": "",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/AskReddit/comments/1km98xz/longtime_married_couples_what_is_your_best_advice/",
    "author": "grahgrape",
    "created_utc": 1747207655.0,
    "subreddit": "AskReddit",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-14T00:27:57.784583",
    "comments": [],
    "post_length": 0,
    "title_length": 75,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Rule 1 - Questions must be clear and direct and may not use the body textbox",
        "description": "* All questions must be clear, written in English, and conclude with a question mark\n* All context in the title must be ***necessary to understanding the question***; do not give “example answers” in the post title (i.e. “Other than your mom, \\_\\_\\_\\_\\_\\_?”)\n* No text in the text box - any additional info from you must be added as a comment to your post\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_1-)",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Rule 1 - Questions must be clear and direct and may not use the body textbox"
      },
      {
        "short_name": "Rule 2 - No personal or professional advice requests",
        "description": "* Askreddit is NOT your personal or professional advice platform\n\n* Do not makes posts asking for professional advice - medical, legal, financial, or otherwise\n\n* All posts asking for advice must be generic and not specific to your situation alone\n\n* Do not use first person pronouns\n\n* No crowdsourcing naming or purchasing decisions\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_2-)",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Rule 2 - No personal or professional advice requests"
      },
      {
        "short_name": "Rule 3 - Open ended questions only",
        "description": "* Post must be an open-ended discussion question\n\n* Title must not be phrased to allow a simple yes/no answer\n\n* No questions that have definite answers\n\n* Question must not be a poll or survey\n\n* No “Either/Or” type questions\n\n* Do not ask for NSFW links\n\n* Do not specify a length (eg \"in three words...\") or make your post into a game\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_3-)",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Rule 3 - Open ended questions only"
      },
      {
        "short_name": "Rule 4 - No personal info",
        "description": "* Do not post or seek any **real or fake** personal information (examples include: full names, phone numbers, email addresses, or social media accounts)\n\n* Only link another user's comment when it is relevant and **never** when it is to launch a personal attack or encourage others to do so\n\n* Do not ask questions designed to target specific usernames or links to social media\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_4-)",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Rule 4 - No personal info"
      },
      {
        "short_name": "Rule 5 - No loaded questions",
        "description": "- Do not include an opinion, bias, or lead respondents towards expressing a specific opinion in your post title\n\n- Do not use this subreddit to promote a specific agenda or to gain positive or negative publicity for an entity or person\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_5-)",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Rule 5 - No loaded questions"
      },
      {
        "short_name": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies",
        "description": "* [Serious] posts are off-limits for joke replies and irrelevant or off-topic comments and discussion\n\n* If the OP asks for answers from a specific group in a [Serious] post, top level comments must be made from members of that group\n\n* Posts that do not receive relevant answers within an hour will be removed\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_6-)",
        "kind": "all",
        "priority": 5,
        "violation_reason": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies"
      },
      {
        "short_name": "Rule 7 - No begging for goods or services, or Reddit rewards",
        "description": "* Do not ask for Reddit rewards, money, goods, services,or favors\n\n* Do not form a brigade to draw positive or negative attention to posts or comments in AskReddit, even from other subreddits\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_7-)",
        "kind": "all",
        "priority": 6,
        "violation_reason": "Rule 7 - No begging for goods or services, or Reddit rewards"
      },
      {
        "short_name": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner",
        "description": "* Do not make personal attacks, insult, or demean a specific group or person\n\n* Do not use slurs without relevant context and quotes\n\n* No blatant statements of bigotry\n\n* No posts that 'bait' users into breaking other rules\n\n* Zero tolerance for posts/comments that sexualize minors\n\n* Zero tolerance for posts/comments that encourage suicide\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_8-)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner"
      },
      {
        "short_name": "Rule 9 -  No image only replies or large ascii art",
        "description": "* Comment replies must consist of more than just an image or link\n\n* No ASCII/emoji images over one line\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_9-)",
        "kind": "comment",
        "priority": 8,
        "violation_reason": "Rule 9 -  No image only replies or large ascii art"
      },
      {
        "short_name": "Rule 10 - Harmful Misinformation",
        "description": "* Do not downplay the effects of a medical crisis\n* Do not undermine the efficacy of vaccines where there is widespread agreement among the medical and scientific communities\n* Do not encourage illegal activity\n* Do not encourage delayed medical treatment\n\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-harmful_misinformation-)",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Rule 10 - Harmful Misinformation"
      },
      {
        "short_name": "Rule 11 - No spam, machine generated content or karma farming",
        "description": "* Do not post spam\n* Do not edit comments to mislead and/or advertise\n* Do not farm karma or shotgun comments\n* Bots are not allowed in r/AskReddit\n\n[The full rule can be viewed here](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_11-)",
        "kind": "all",
        "priority": 10,
        "violation_reason": "Rule 11 - No spam, machine generated content or karma farming"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "moderator",
    "raw_banned_by": null,
    "raw_author_is_none": false,
    "raw_selftext_value": null,
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T01:02:59.077096",
    "hours_tracked": 0.08075140602058835
  },
  {
    "id": "1km996z",
    "title": "Whats a small habit youve adopted thats had a huge positive impact on your life?",
    "text": "",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/AskReddit/comments/1km996z/whats_a_small_habit_youve_adopted_thats_had_a/",
    "author": "Hefty-Election319",
    "created_utc": 1747207686.0,
    "subreddit": "AskReddit",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-14T00:28:19.126797",
    "comments": [],
    "post_length": 0,
    "title_length": 83,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Rule 1 - Questions must be clear and direct and may not use the body textbox",
        "description": "* All questions must be clear, written in English, and conclude with a question mark\n* All context in the title must be ***necessary to understanding the question***; do not give “example answers” in the post title (i.e. “Other than your mom, \\_\\_\\_\\_\\_\\_?”)\n* No text in the text box - any additional info from you must be added as a comment to your post\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_1-)",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Rule 1 - Questions must be clear and direct and may not use the body textbox"
      },
      {
        "short_name": "Rule 2 - No personal or professional advice requests",
        "description": "* Askreddit is NOT your personal or professional advice platform\n\n* Do not makes posts asking for professional advice - medical, legal, financial, or otherwise\n\n* All posts asking for advice must be generic and not specific to your situation alone\n\n* Do not use first person pronouns\n\n* No crowdsourcing naming or purchasing decisions\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_2-)",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Rule 2 - No personal or professional advice requests"
      },
      {
        "short_name": "Rule 3 - Open ended questions only",
        "description": "* Post must be an open-ended discussion question\n\n* Title must not be phrased to allow a simple yes/no answer\n\n* No questions that have definite answers\n\n* Question must not be a poll or survey\n\n* No “Either/Or” type questions\n\n* Do not ask for NSFW links\n\n* Do not specify a length (eg \"in three words...\") or make your post into a game\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_3-)",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Rule 3 - Open ended questions only"
      },
      {
        "short_name": "Rule 4 - No personal info",
        "description": "* Do not post or seek any **real or fake** personal information (examples include: full names, phone numbers, email addresses, or social media accounts)\n\n* Only link another user's comment when it is relevant and **never** when it is to launch a personal attack or encourage others to do so\n\n* Do not ask questions designed to target specific usernames or links to social media\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_4-)",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Rule 4 - No personal info"
      },
      {
        "short_name": "Rule 5 - No loaded questions",
        "description": "- Do not include an opinion, bias, or lead respondents towards expressing a specific opinion in your post title\n\n- Do not use this subreddit to promote a specific agenda or to gain positive or negative publicity for an entity or person\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_5-)",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Rule 5 - No loaded questions"
      },
      {
        "short_name": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies",
        "description": "* [Serious] posts are off-limits for joke replies and irrelevant or off-topic comments and discussion\n\n* If the OP asks for answers from a specific group in a [Serious] post, top level comments must be made from members of that group\n\n* Posts that do not receive relevant answers within an hour will be removed\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_6-)",
        "kind": "all",
        "priority": 5,
        "violation_reason": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies"
      },
      {
        "short_name": "Rule 7 - No begging for goods or services, or Reddit rewards",
        "description": "* Do not ask for Reddit rewards, money, goods, services,or favors\n\n* Do not form a brigade to draw positive or negative attention to posts or comments in AskReddit, even from other subreddits\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_7-)",
        "kind": "all",
        "priority": 6,
        "violation_reason": "Rule 7 - No begging for goods or services, or Reddit rewards"
      },
      {
        "short_name": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner",
        "description": "* Do not make personal attacks, insult, or demean a specific group or person\n\n* Do not use slurs without relevant context and quotes\n\n* No blatant statements of bigotry\n\n* No posts that 'bait' users into breaking other rules\n\n* Zero tolerance for posts/comments that sexualize minors\n\n* Zero tolerance for posts/comments that encourage suicide\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_8-)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner"
      },
      {
        "short_name": "Rule 9 -  No image only replies or large ascii art",
        "description": "* Comment replies must consist of more than just an image or link\n\n* No ASCII/emoji images over one line\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_9-)",
        "kind": "comment",
        "priority": 8,
        "violation_reason": "Rule 9 -  No image only replies or large ascii art"
      },
      {
        "short_name": "Rule 10 - Harmful Misinformation",
        "description": "* Do not downplay the effects of a medical crisis\n* Do not undermine the efficacy of vaccines where there is widespread agreement among the medical and scientific communities\n* Do not encourage illegal activity\n* Do not encourage delayed medical treatment\n\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-harmful_misinformation-)",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Rule 10 - Harmful Misinformation"
      },
      {
        "short_name": "Rule 11 - No spam, machine generated content or karma farming",
        "description": "* Do not post spam\n* Do not edit comments to mislead and/or advertise\n* Do not farm karma or shotgun comments\n* Bots are not allowed in r/AskReddit\n\n[The full rule can be viewed here](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_11-)",
        "kind": "all",
        "priority": 10,
        "violation_reason": "Rule 11 - No spam, machine generated content or karma farming"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "reddit",
    "raw_banned_by": null,
    "raw_author_is_none": false,
    "raw_selftext_value": null,
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T01:03:05.097543",
    "hours_tracked": 0.0748249950673845
  },
  {
    "id": "1km9b4w",
    "title": "Im skeptical about my sexuality",
    "text": "Ive been having mixed feelings for who Im being attracted towards, Im not sure what to do. Please help me Ill give you a kinderjoy.",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/Advice/comments/1km9b4w/im_skeptical_about_my_sexuality/",
    "author": "CartooonSenpai",
    "created_utc": 1747207913.0,
    "subreddit": "Advice",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-14T00:32:19.503097",
    "comments": [],
    "post_length": 135,
    "title_length": 32,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Be Nice.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* No trolling, harassment, threats, hate-speech, triggering, rudeness, or other uncivil actions\n\n* No advocating violence\n\n* If you see someone being mean, please report them and move on\n\n* Gather your thoughts and emotions, do not snap at commenters who are just trying to help.\n\n* Know the difference between tough love, and being rude",
        "kind": "all",
        "priority": 0,
        "violation_reason": "Not Nice"
      },
      {
        "short_name": "Posts must ask for advice.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* Your post MUST have a clear question on what you need advice on\n\n* No asking for speculation\n\n* Posts that are purely ranting or venting don't belong here\n\n* No random, general, or hypothetical questions\n\n* Updates should be added as an edit to your original post, unless you are seeking additional advice\n\n* No asking for private chat/messages. Keep the conversation in r/Advice",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Not asking for advice"
      },
      {
        "short_name": "Forbidden Topics",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n**No topics requiring any sort of professional expertise:**\n\n* Medical advice\n\n* Therapizing or counseling\n\n* Legal advice\n\n* Insurance questions\n\n* Automotive / mechanic advice\n\n**Non-professional forbidden topics:**\n\n* Tech support\n\n* Homework or any schoolwork\n\n* Criticism of appearance or talents\n\n* Revenge\n\n* Posts about Reddit itself",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Forbidden topics"
      },
      {
        "short_name": "Follow the rules of Reddit.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\nAll rules of the Reddit Content Policy and User Agreement apply here.\n\n* No harassment, bullying, or inciting violence.\n\n* No spamming or ban evasion\n\n* Do not post personal or confidential information\n\n* No instigating doxxing, witch hunting, or brigading of any kind\n\n* No sexual content involving minors\n\n* The minimum age to use Reddit is 13\n\n* No posting about any sort of illegal activities.",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Violation of Reddit Rule"
      },
      {
        "short_name": "No discrimination.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n**No racism, sexism, misogyny, or misandry**\n\n* Generalizations, hate, or insensitivity based on race, nationality, sex, gender, or sexuality\n\n* Incel behavior, regardless of gender\n\n**No hate or insensitivity to LGBTQ+ people**\n\n* Homophobia or transphobia\n\n* Phobia towards queer, genderfluid, nonbinary, or any other genders\n\n* No discrimination based on any other factors, beliefs, or categorizations not listed",
        "kind": "all",
        "priority": 4,
        "violation_reason": "Discrimination"
      },
      {
        "short_name": "Give OP the benefit of the doubt.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* Offer only advice, not judgement, scrutiny, or disbelief\n\n* No victim blaming or shaming\n\n* Do not try to call people out in the comments. If you believe a post is fake or lying, report it and move on.",
        "kind": "comment",
        "priority": 5,
        "violation_reason": "Unnecessary Scrutiny"
      },
      {
        "short_name": "Only post twice per day in /r/advice",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\nTo reduce the effect of spammers and trolls, you are limited to two posts per day in /r/advice.",
        "kind": "link",
        "priority": 6,
        "violation_reason": "Posted more than twice today in /r/advice (submit proof to mods)."
      },
      {
        "short_name": "No reassurance, validation, or affirmation seeking",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\nThis subreddit is for advice, NOT moral judgement, validation, affirming your opinions/feelings, or settling arguments\n\n* No AITA posts or AITA abbreviations.\n\n* No asking if you are right or wrong in a situation\n\n* No asking if your feelings are justified\n\n* No asking if you're overthinking, overreacting, being paranoid, etc.\n\nThis is not an all-inclusive list. See full rule for more",
        "kind": "link",
        "priority": 7,
        "violation_reason": "Reassurance Seeking"
      },
      {
        "short_name": "No Spam",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* No reposting without moderator approval\n\n* Do not put any external links in your post\n\n* No shitposting, fake posts, or joke posts. Get a life.\n\n* No asking for money or donations of any kind\n\n* No self promotion of any kind\n\n* No advertising of any kind, including posting referral links.\n\n* No asking for survey/research/interview participation",
        "kind": "all",
        "priority": 8,
        "violation_reason": "Spam"
      },
      {
        "short_name": "No suicide or self harm posts",
        "description": "This subreddit will not host any posts about suicide or self harm. Please post in r/SuicideWatch or utilize the hotlines below. \n\nHelping a suicidal person requires training and skill sets that the average person does not possess. Unqualified users may have good intentions, but might inadvertently worsen the situation and/or strain their own mental health significantly.\n\nSimilarly, self harm is a complex and deeply-rooted behavior that the average person is not equipped to help with.",
        "kind": "link",
        "priority": 9,
        "violation_reason": "No suicide or self harm posts"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-14T01:03:25.133700",
    "hours_tracked": 0.008051935897933113
  }
]