[
  {
    "id": "1km5li3",
    "title": "feeling lost in life",
    "text": "Hello, Im feeling a bit lost in life. Ive seen some therapists but none of them seem to ever help you know? People have told me to try a few different ones out but idk. I just feel like no one has the answers you know? I feel like the answers only come through experience. Experiential knowledge. Cuz I guess Im a bit hard headed. How will I ever know unless I find out for myself? A little bit about me. Im 32, turning 33 this November. I just got sober on July 26 2022. I thought Id be further along in life in almost 3 years of sobriety but Im nowhere materially where Id want to be. I mean Im comfortable, you could say, I live with my parents normal in my culture, I have a bed I have a roof I have food in my belly. And I even have a little bit of money coming in through disability per month. I guess you could say Im better off than some people. But Im not satisfied you know? I want an adventurous life. I dont want to live a mediocre life. Not to confuse my intentions with the lives we see on social media. But I want something that burns my soul with a passion you know. Like I dont just wanna exist I wanna LIVE. Also a bit I want to quote unquote escape the matrix you know. Like was I really put on this planet to spend 40 hours a week working some job I hate? Id rather spend 80 hours a week on a project I love right? But I mean. Everyones all like if you love what you do youll never work a day in your life. But how many people can really say they love what they do you know? I guess, my greatest passion is travel. I want to be a travel vlogger. I have a YouTube channel with about 40 subscribers and Im slowly working towards that dream. But its still a dream for now you know? And its not enough to pay the bills. I guess idk, idk what life is supposed to be like. I feel like I just got reborn or something when I got sober. I feel like I just started living. I feel like the previous 30 years of my life were just a warmup or something. I feel like my best is ahead of me. But idk, I guess Im worried about money. But Im equally worried about freedom. I guess maybe money comes first freedom comes later? Yeah maybe thats the progression. You need to build a base before you can fly off or something. Im not sure what Im looking for from here. I guess Im just hoping someone will say some magical words and it will all make sense. About me: - technology background been working with tech since I was 10 - single never been in a serious relationship - 32 - 1535/mo income disability - lost in life - trying to escape the matrix build a life of meaning - spiritually inclined Let me know if theres anything youd like to know about me. Thanks",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/Advice/comments/1km5li3/feeling_lost_in_life/",
    "author": "aflvx",
    "created_utc": 1747193742.0,
    "subreddit": "Advice",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-13T20:36:00.475831",
    "comments": [],
    "post_length": 2716,
    "title_length": 20,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Be Nice.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* No trolling, harassment, threats, hate-speech, triggering, rudeness, or other uncivil actions\n\n* No advocating violence\n\n* If you see someone being mean, please report them and move on\n\n* Gather your thoughts and emotions, do not snap at commenters who are just trying to help.\n\n* Know the difference between tough love, and being rude",
        "kind": "all",
        "priority": 0,
        "violation_reason": "Not Nice"
      },
      {
        "short_name": "Posts must ask for advice.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* Your post MUST have a clear question on what you need advice on\n\n* No asking for speculation\n\n* Posts that are purely ranting or venting don't belong here\n\n* No random, general, or hypothetical questions\n\n* Updates should be added as an edit to your original post, unless you are seeking additional advice\n\n* No asking for private chat/messages. Keep the conversation in r/Advice",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Not asking for advice"
      },
      {
        "short_name": "Forbidden Topics",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n**No topics requiring any sort of professional expertise:**\n\n* Medical advice\n\n* Therapizing or counseling\n\n* Legal advice\n\n* Insurance questions\n\n* Automotive / mechanic advice\n\n**Non-professional forbidden topics:**\n\n* Tech support\n\n* Homework or any schoolwork\n\n* Criticism of appearance or talents\n\n* Revenge\n\n* Posts about Reddit itself",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Forbidden topics"
      },
      {
        "short_name": "Follow the rules of Reddit.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\nAll rules of the Reddit Content Policy and User Agreement apply here.\n\n* No harassment, bullying, or inciting violence.\n\n* No spamming or ban evasion\n\n* Do not post personal or confidential information\n\n* No instigating doxxing, witch hunting, or brigading of any kind\n\n* No sexual content involving minors\n\n* The minimum age to use Reddit is 13\n\n* No posting about any sort of illegal activities.",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Violation of Reddit Rule"
      },
      {
        "short_name": "No discrimination.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n**No racism, sexism, misogyny, or misandry**\n\n* Generalizations, hate, or insensitivity based on race, nationality, sex, gender, or sexuality\n\n* Incel behavior, regardless of gender\n\n**No hate or insensitivity to LGBTQ+ people**\n\n* Homophobia or transphobia\n\n* Phobia towards queer, genderfluid, nonbinary, or any other genders\n\n* No discrimination based on any other factors, beliefs, or categorizations not listed",
        "kind": "all",
        "priority": 4,
        "violation_reason": "Discrimination"
      },
      {
        "short_name": "Give OP the benefit of the doubt.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* Offer only advice, not judgement, scrutiny, or disbelief\n\n* No victim blaming or shaming\n\n* Do not try to call people out in the comments. If you believe a post is fake or lying, report it and move on.",
        "kind": "comment",
        "priority": 5,
        "violation_reason": "Unnecessary Scrutiny"
      },
      {
        "short_name": "Only post twice per day in /r/advice",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\nTo reduce the effect of spammers and trolls, you are limited to two posts per day in /r/advice.",
        "kind": "link",
        "priority": 6,
        "violation_reason": "Posted more than twice today in /r/advice (submit proof to mods)."
      },
      {
        "short_name": "No reassurance, validation, or affirmation seeking",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\nThis subreddit is for advice, NOT moral judgement, validation, affirming your opinions/feelings, or settling arguments\n\n* No AITA posts or AITA abbreviations.\n\n* No asking if you are right or wrong in a situation\n\n* No asking if your feelings are justified\n\n* No asking if you're overthinking, overreacting, being paranoid, etc.\n\nThis is not an all-inclusive list. See full rule for more",
        "kind": "link",
        "priority": 7,
        "violation_reason": "Reassurance Seeking"
      },
      {
        "short_name": "No Spam",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* No reposting without moderator approval\n\n* Do not put any external links in your post\n\n* No shitposting, fake posts, or joke posts. Get a life.\n\n* No asking for money or donations of any kind\n\n* No self promotion of any kind\n\n* No advertising of any kind, including posting referral links.\n\n* No asking for survey/research/interview participation",
        "kind": "all",
        "priority": 8,
        "violation_reason": "Spam"
      },
      {
        "short_name": "No suicide or self harm posts",
        "description": "This subreddit will not host any posts about suicide or self harm. Please post in r/SuicideWatch or utilize the hotlines below. \n\nHelping a suicidal person requires training and skill sets that the average person does not possess. Unqualified users may have good intentions, but might inadvertently worsen the situation and/or strain their own mental health significantly.\n\nSimilarly, self harm is a complex and deeply-rooted behavior that the average person is not equipped to help with.",
        "kind": "link",
        "priority": 9,
        "violation_reason": "No suicide or self harm posts"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-13T21:41:33.696516",
    "hours_tracked": 0.9923732162184186
  },
  {
    "id": "1km5vsj",
    "title": "F 27/ M28",
    "text": "So my boyfriend and I have been together for 5 years. Recently I 27 female drank to much and kissed his 22 year old brothers best friend. Some back story, we work together me 27 female and 22 male in a restaurant and he comes over often and hangs with our friend group and me. Chills at the house before his friend arrives He invited me to continue but I laid down and went to bed. I swear he kissed me but regardless of that I ended up liking him a lot. I love my boyfriend but am genuinely surprised about my feelings. Im wondering if anyone has a similar situation and wonder if my relationship is worth saving? I do not want to be with 22m if we break up as i think thats bad karma but why would I get so attached? My boyfriend and I have been fighting a bit and Ive been pulling away for a few months. Just because Im depressed. Im unsure if its because of him or my anxiety/depression disorder. I just feel like our conversations go in circles and I did try to break up with him. I told him the next day but continued to text the 22m after the fact with no reply from him. This really hurt my bf as the 22m told his best friend my bfs brother a week after my last text he always was dog sitting for us. He lied and said I instigated everything and was just trying to get him alone when I just wanted to talk it out. If you dont like me just say that, or tell me to stay away and I will. Im starting a new job so I wont have to see him but now I feel bad about the situation at our house. My bfs brother lives with us in a large house I am really sad my bfs brother has not said a word to me since it happened and I feel uncomfortable in our house. We just got a puppy together in December and I pay him rent and split everything in the house 50/50 he just owns it which I respect its his house down to the point. Just need some outside advice I cant figure out my feelings and am waiting on the insurance from my new job to go to therapy. Ive been on and off meds since I was 13.",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/relationship_advice/comments/1km5vsj/f_27_m28/",
    "author": "Correct_Lab_6705",
    "created_utc": 1747194697.0,
    "subreddit": "relationship_advice",
    "score": 1,
    "num_comments": 1,
    "timestamp_collected": "2025-05-13T20:51:56.408701",
    "comments": [],
    "post_length": 2008,
    "title_length": 9,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Posts must contain a title, description, TLDR, & basic info like ages, genders",
        "description": "Posts MUST include: \n\n* A title that summarizes the problem or question. This is where the ages/genders should be placed.\n* A description of your situation.\n* A question or a request for what advice you want.\n* Length of Relationship\n* A brief [**tl;dr**](http://en.wiktionary.org/wiki/TLDR) if your post is long.\n\nExamples of ages/genders in the title:\n\n- I [24M] have an issue with my aunt, [45F]\n\n- My partner [19NB] told me [21MtF]\n\n- I [45F] love my husband [51M]",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Post does not feature detailed information, or lacks a descriptive title, tldr, or similar"
      },
      {
        "short_name": "All posts must request specific advice on a specific, real situation between two or more people",
        "description": "We do not allow vague requests for advice such as:\n\n- What would you do?\n\n- What should I do?\n\n- Any advice would be appreciated\n\nLikewise, we do not allow:\n\n- Vents/rants\n\n- Posts about past or potential relationships\n\n- Posts giving advice\n\nLastly, this subreddit relies on honesty. If your content is in any capacity dishonest (examples include: chatGPT posts, creative writing, profile inconsistencies) it will be removed and you will be banned.",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Post does not request advice on a real situation between two or more people."
      },
      {
        "short_name": "No questions that can be answered with yes or no (aka moral judgment)",
        "description": "Your post is a yes or no question (aka moral judgement) if your question starts with or contains any of the following:\n\n- Is it...?\n\n- Asking if you or the subject of the post is right or wrong.\n\n- Am I....?\n\n- Any variation of “Am I The Asshole?”, including AITA\n\n- Does/Have anybody else...?\n\n- Should I…?\n\n- Would you....?\n\n- Is this.....?\n\n- Can I...?\n\n\n#If the question in your post can be answered with a yes or no question, it is moral judgement and will be removed.",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Yes or no/ Moral Judgement Request"
      },
      {
        "short_name": "Things This Sub Can't Give Advice On:",
        "description": "Rants, unsolicited advice, letters to an ex, \"body counts\" or number of sexual partners, mental health issues, medical health issues, legal problems, financial problems, any situations involving minors (under 18 regardless of local laws), and any situations involving abuse (violence, sexual, emotional etc). All of these will be removed and locked.",
        "kind": "link",
        "priority": 3,
        "violation_reason": "Not Applicable to the Sub"
      },
      {
        "short_name": "Only One Update Is Allowed",
        "description": "You can submit **one** update post at any time after 48 hours has past from the original post. \n\nAdditional advice may be requested in new posts but they may not be continuations of the orignal one. E.g. no titles saying \"Update 2\" or \"Update 4\". We're not a blog. Please post further updates on your own profile.",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Too many updates"
      },
      {
        "short_name": "Surveys, Academic Research, Information Requests, and Media Questions Should Be Sent to Modmail",
        "description": "Surveys, information requests, and journalistic or academic research questions must be sent to [modmail](https://www.reddit.com/message/compose?to=/r/relationship_advice) prior to posting.  If you are doing academic research, message us with your IRB number, a point of contact for us to verify your pending research, and the details of your research for consideration. Press Requests must be routed through modmail, via u/eganist , before communicating with users directly.",
        "kind": "link",
        "priority": 5,
        "violation_reason": "Surveys, Academic Research, Information Requests, and Media Questions Should Be Sent to Modmail"
      },
      {
        "short_name": "All comments must be on topic, and focus on the OP, and be made in good faith",
        "description": "Derailing arguments, jokes fighting, and moral whataboutism is not allowed. Give good, ethical advice. Remember, the goal is to help your fellow human.",
        "kind": "all",
        "priority": 6,
        "violation_reason": "derailing, fighting, whataboutism, or not in good faith"
      },
      {
        "short_name": "Keep It Civil",
        "description": "No insults, no threats of violence, no encouraging violence, no telling an OP to go to punch someone else, no threats, no harassment, no trolling, no advertising other subs, no spam. You will be banned. \n\nAll bans in this sub are permanent. You don't get a free pass.\n\nFor more information, please see our [rules](https://www.reddit.com/r/relationship_advice/wiki/rules#wiki_rule_8)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Insults, violence, harassment, trolling, spam"
      },
      {
        "short_name": "No referencing hateful or abusive subs/individuals/content",
        "description": "**No referencing hateful or abusive subs/individuals and content**. No advocating for or referencing content that is conspiratorial in nature, transphobic, anti-women/men, anti-LBGT+, that promote anti-vaxx or anti-science content, or contains harmful rhetoric against groups of people. Think includes linking to subs that feature this. You will be banned. You don't get a free pass. \n\n[Further information](https://www.reddit.com/r/relationship_advice/wiki/rules#wiki_rule_9)",
        "kind": "all",
        "priority": 8,
        "violation_reason": "references hateful/abusive content/subs/individuals"
      },
      {
        "short_name": "Do not directly message users",
        "description": "If you wish to opine on the matter at hand, you are to comment on the post. Users found to be privately messaging other users to circumvent this directive will be met with a permanent, irrevocable ban. \n\n**If a user has sent you harassing messages, please upload your screenshot to Imgur.com, and notify the mods via modmail. We will action the user accordingly.**",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Do not directly message users"
      },
      {
        "short_name": "No situations involving people under 18",
        "description": "Your content has been removed because it involves a situation with someone under the age of 18. Please note that changing your ages to get around this rule will result in an immediate ban.\n\nPlease consider posting this to our sister subreddit, r/teenrelationships",
        "kind": "link",
        "priority": 10,
        "violation_reason": "No situations involving people under 18"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-13T21:43:29.850392",
    "hours_tracked": 0.7268352697292964
  },
  {
    "id": "1km5w6n",
    "title": "If you could go back in time to witness one event what would it be?",
    "text": "",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/AskReddit/comments/1km5w6n/if_you_could_go_back_in_time_to_witness_one_event/",
    "author": "greenducks12",
    "created_utc": 1747194735.0,
    "subreddit": "AskReddit",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-13T20:52:28.445522",
    "comments": [],
    "post_length": 0,
    "title_length": 67,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Rule 1 - Questions must be clear and direct and may not use the body textbox",
        "description": "* All questions must be clear, written in English, and conclude with a question mark\n* All context in the title must be ***necessary to understanding the question***; do not give “example answers” in the post title (i.e. “Other than your mom, \\_\\_\\_\\_\\_\\_?”)\n* No text in the text box - any additional info from you must be added as a comment to your post\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_1-)",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Rule 1 - Questions must be clear and direct and may not use the body textbox"
      },
      {
        "short_name": "Rule 2 - No personal or professional advice requests",
        "description": "* Askreddit is NOT your personal or professional advice platform\n\n* Do not makes posts asking for professional advice - medical, legal, financial, or otherwise\n\n* All posts asking for advice must be generic and not specific to your situation alone\n\n* Do not use first person pronouns\n\n* No crowdsourcing naming or purchasing decisions\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_2-)",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Rule 2 - No personal or professional advice requests"
      },
      {
        "short_name": "Rule 3 - Open ended questions only",
        "description": "* Post must be an open-ended discussion question\n\n* Title must not be phrased to allow a simple yes/no answer\n\n* No questions that have definite answers\n\n* Question must not be a poll or survey\n\n* No “Either/Or” type questions\n\n* Do not ask for NSFW links\n\n* Do not specify a length (eg \"in three words...\") or make your post into a game\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_3-)",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Rule 3 - Open ended questions only"
      },
      {
        "short_name": "Rule 4 - No personal info",
        "description": "* Do not post or seek any **real or fake** personal information (examples include: full names, phone numbers, email addresses, or social media accounts)\n\n* Only link another user's comment when it is relevant and **never** when it is to launch a personal attack or encourage others to do so\n\n* Do not ask questions designed to target specific usernames or links to social media\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_4-)",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Rule 4 - No personal info"
      },
      {
        "short_name": "Rule 5 - No loaded questions",
        "description": "- Do not include an opinion, bias, or lead respondents towards expressing a specific opinion in your post title\n\n- Do not use this subreddit to promote a specific agenda or to gain positive or negative publicity for an entity or person\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_5-)",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Rule 5 - No loaded questions"
      },
      {
        "short_name": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies",
        "description": "* [Serious] posts are off-limits for joke replies and irrelevant or off-topic comments and discussion\n\n* If the OP asks for answers from a specific group in a [Serious] post, top level comments must be made from members of that group\n\n* Posts that do not receive relevant answers within an hour will be removed\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_6-)",
        "kind": "all",
        "priority": 5,
        "violation_reason": "Rule 6 - [Serious] tagged posts are off-limits to jokes or irrelevant replies"
      },
      {
        "short_name": "Rule 7 - No begging for goods or services, or Reddit rewards",
        "description": "* Do not ask for Reddit rewards, money, goods, services,or favors\n\n* Do not form a brigade to draw positive or negative attention to posts or comments in AskReddit, even from other subreddits\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_7-)",
        "kind": "all",
        "priority": 6,
        "violation_reason": "Rule 7 - No begging for goods or services, or Reddit rewards"
      },
      {
        "short_name": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner",
        "description": "* Do not make personal attacks, insult, or demean a specific group or person\n\n* Do not use slurs without relevant context and quotes\n\n* No blatant statements of bigotry\n\n* No posts that 'bait' users into breaking other rules\n\n* Zero tolerance for posts/comments that sexualize minors\n\n* Zero tolerance for posts/comments that encourage suicide\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_8-)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Rule 8 - Be respectful to other users at all times and conduct your behaviour in a civil manner"
      },
      {
        "short_name": "Rule 9 -  No image only replies or large ascii art",
        "description": "* Comment replies must consist of more than just an image or link\n\n* No ASCII/emoji images over one line\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-rule_9-)",
        "kind": "comment",
        "priority": 8,
        "violation_reason": "Rule 9 -  No image only replies or large ascii art"
      },
      {
        "short_name": "Rule 10 - Harmful Misinformation",
        "description": "* Do not downplay the effects of a medical crisis\n* Do not undermine the efficacy of vaccines where there is widespread agreement among the medical and scientific communities\n* Do not encourage illegal activity\n* Do not encourage delayed medical treatment\n\n\n[The full rule can be viewed here](https://www.reddit.com/r/askreddit/wiki/index#wiki_-harmful_misinformation-)",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Rule 10 - Harmful Misinformation"
      },
      {
        "short_name": "Rule 11 - No spam, machine generated content or karma farming",
        "description": "* Do not post spam\n* Do not edit comments to mislead and/or advertise\n* Do not farm karma or shotgun comments\n* Bots are not allowed in r/AskReddit\n\n[The full rule can be viewed here](https://www.reddit.com/r/AskReddit/wiki/index#wiki_-rule_11-)",
        "kind": "all",
        "priority": 10,
        "violation_reason": "Rule 11 - No spam, machine generated content or karma farming"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "reddit",
    "raw_banned_by": null,
    "raw_author_is_none": false,
    "raw_selftext_value": null,
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-13T21:43:41.890312",
    "hours_tracked": 0.7179358726077609
  },
  {
    "id": "1km5y7g",
    "title": "After 4.5 years together, my SO and I dont have much in common anymore and I feel we are growing apart. Any advice?",
    "text": "My boyfriend and I, both 27, have been together since we were 22 and live together. Things were truly chemical when we first got together. We fell in love very fast, and really I felt like I was dating my best friend because we had such strongly overlapping interests. For the first few years together, we did most things togetherwe both were very into rock climbing and running, and casually played volleyball on the side. We also both liked going to concerts, camping, and making art, and would do both of those things together a lot. As time has gone on, hes gotten more and more into this specific club sport of which hes a team captain. He loves it and often is occupied with it most of the weekends and a couple week nights per week. He has dropped climbing, art, and volleyball pretty much altogether. He doesnt really like going to concerts much anymore, and his music taste has started diverging more from mine such that he rarely wants to go to concerts with me now. He also takes a lot of convincing to go camping, and hes busy with his club team most weekends anyways. I also am a lot more social than him generally and like to get out with people a lot more. I feel like we dont spend that much time together these days, and dont have so much to talk about anymore because our interests are so different. I still love him, but I no longer feel like were close in the way we once were. I still love him, but I am a bit worried that we are growing apart. Im not sure if this normal in a relationship, given how long weve been together. What to do?",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/Advice/comments/1km5y7g/after_45_years_together_my_so_and_i_dont_have/",
    "author": "ThrowRAmanate",
    "created_utc": 1747194935.0,
    "subreddit": "Advice",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-13T20:56:04.648209",
    "comments": [],
    "post_length": 1578,
    "title_length": 116,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Be Nice.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* No trolling, harassment, threats, hate-speech, triggering, rudeness, or other uncivil actions\n\n* No advocating violence\n\n* If you see someone being mean, please report them and move on\n\n* Gather your thoughts and emotions, do not snap at commenters who are just trying to help.\n\n* Know the difference between tough love, and being rude",
        "kind": "all",
        "priority": 0,
        "violation_reason": "Not Nice"
      },
      {
        "short_name": "Posts must ask for advice.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* Your post MUST have a clear question on what you need advice on\n\n* No asking for speculation\n\n* Posts that are purely ranting or venting don't belong here\n\n* No random, general, or hypothetical questions\n\n* Updates should be added as an edit to your original post, unless you are seeking additional advice\n\n* No asking for private chat/messages. Keep the conversation in r/Advice",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Not asking for advice"
      },
      {
        "short_name": "Forbidden Topics",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n**No topics requiring any sort of professional expertise:**\n\n* Medical advice\n\n* Therapizing or counseling\n\n* Legal advice\n\n* Insurance questions\n\n* Automotive / mechanic advice\n\n**Non-professional forbidden topics:**\n\n* Tech support\n\n* Homework or any schoolwork\n\n* Criticism of appearance or talents\n\n* Revenge\n\n* Posts about Reddit itself",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Forbidden topics"
      },
      {
        "short_name": "Follow the rules of Reddit.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\nAll rules of the Reddit Content Policy and User Agreement apply here.\n\n* No harassment, bullying, or inciting violence.\n\n* No spamming or ban evasion\n\n* Do not post personal or confidential information\n\n* No instigating doxxing, witch hunting, or brigading of any kind\n\n* No sexual content involving minors\n\n* The minimum age to use Reddit is 13\n\n* No posting about any sort of illegal activities.",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Violation of Reddit Rule"
      },
      {
        "short_name": "No discrimination.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n**No racism, sexism, misogyny, or misandry**\n\n* Generalizations, hate, or insensitivity based on race, nationality, sex, gender, or sexuality\n\n* Incel behavior, regardless of gender\n\n**No hate or insensitivity to LGBTQ+ people**\n\n* Homophobia or transphobia\n\n* Phobia towards queer, genderfluid, nonbinary, or any other genders\n\n* No discrimination based on any other factors, beliefs, or categorizations not listed",
        "kind": "all",
        "priority": 4,
        "violation_reason": "Discrimination"
      },
      {
        "short_name": "Give OP the benefit of the doubt.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* Offer only advice, not judgement, scrutiny, or disbelief\n\n* No victim blaming or shaming\n\n* Do not try to call people out in the comments. If you believe a post is fake or lying, report it and move on.",
        "kind": "comment",
        "priority": 5,
        "violation_reason": "Unnecessary Scrutiny"
      },
      {
        "short_name": "Only post twice per day in /r/advice",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\nTo reduce the effect of spammers and trolls, you are limited to two posts per day in /r/advice.",
        "kind": "link",
        "priority": 6,
        "violation_reason": "Posted more than twice today in /r/advice (submit proof to mods)."
      },
      {
        "short_name": "No reassurance, validation, or affirmation seeking",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\nThis subreddit is for advice, NOT moral judgement, validation, affirming your opinions/feelings, or settling arguments\n\n* No AITA posts or AITA abbreviations.\n\n* No asking if you are right or wrong in a situation\n\n* No asking if your feelings are justified\n\n* No asking if you're overthinking, overreacting, being paranoid, etc.\n\nThis is not an all-inclusive list. See full rule for more",
        "kind": "link",
        "priority": 7,
        "violation_reason": "Reassurance Seeking"
      },
      {
        "short_name": "No Spam",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* No reposting without moderator approval\n\n* Do not put any external links in your post\n\n* No shitposting, fake posts, or joke posts. Get a life.\n\n* No asking for money or donations of any kind\n\n* No self promotion of any kind\n\n* No advertising of any kind, including posting referral links.\n\n* No asking for survey/research/interview participation",
        "kind": "all",
        "priority": 8,
        "violation_reason": "Spam"
      },
      {
        "short_name": "No suicide or self harm posts",
        "description": "This subreddit will not host any posts about suicide or self harm. Please post in r/SuicideWatch or utilize the hotlines below. \n\nHelping a suicidal person requires training and skill sets that the average person does not possess. Unqualified users may have good intentions, but might inadvertently worsen the situation and/or strain their own mental health significantly.\n\nSimilarly, self harm is a complex and deeply-rooted behavior that the average person is not equipped to help with.",
        "kind": "link",
        "priority": 9,
        "violation_reason": "No suicide or self harm posts"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-13T21:44:05.835971",
    "hours_tracked": 0.6578785689009561
  },
  {
    "id": "1km5zyv",
    "title": "My 57F girlfriend made a shitty remark to me 51F and I dont know how to take it.",
    "text": "My gf and I have been together for almost two years. I have a medical condition I have seizures 2-3 a month that affects my mood. The aftermath of a seizure causes me to withdraw and I get really depressed for a few days. Im adjusting to a new medication i take three seizure meds total which affects my memory. She knows all this, and knows my moods always go back to normal after a few days. Plus I have PMS that makes me moody but Im going to the doctor to see what can be done to help me. Otherwise, I spend a lot of my time catering to her. She says she feels like shes walking on eggshells around me lately and that I hurt her during my the days Im withdrawn, depressed or moody. I feel awful about that, I never want to hurt her and I know my moods are a lot to deal with. But I also dont feel supported at all. Now my girlfriend says Im acting distant, and shes right, I am. She was crying it kills me to see her cry and said Ive been treating her like shit. She said Im not being affectionate even though she makes no effort to be affectionate with me. We were trying to talk all of this out when she looked at me with a shitty smirk and said, Im smarter than you. I asked if she really meant it, and she said yes. That I might be book smart but shes smarter than me. WTH? Even if she was joking would that be okay? Now I feel like she just thinks Im dumb and everything that comes out of my mouth is dumb. My memory is shit now so Im sure I sound dumb. And now Im watching every thing I say around her. I dont know if I just need to vent or Im looking for validation or I just need opinions. Is it okay to say that to someone? Does this sound like a healthy relationship?",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/relationship_advice/comments/1km5zyv/my_57f_girlfriend_made_a_shitty_remark_to_me_51f/",
    "author": "Fast-Revolution-5345",
    "created_utc": 1747195106.0,
    "subreddit": "relationship_advice",
    "score": 1,
    "num_comments": 1,
    "timestamp_collected": "2025-05-13T20:58:44.804637",
    "comments": [],
    "post_length": 1716,
    "title_length": 85,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Posts must contain a title, description, TLDR, & basic info like ages, genders",
        "description": "Posts MUST include: \n\n* A title that summarizes the problem or question. This is where the ages/genders should be placed.\n* A description of your situation.\n* A question or a request for what advice you want.\n* Length of Relationship\n* A brief [**tl;dr**](http://en.wiktionary.org/wiki/TLDR) if your post is long.\n\nExamples of ages/genders in the title:\n\n- I [24M] have an issue with my aunt, [45F]\n\n- My partner [19NB] told me [21MtF]\n\n- I [45F] love my husband [51M]",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Post does not feature detailed information, or lacks a descriptive title, tldr, or similar"
      },
      {
        "short_name": "All posts must request specific advice on a specific, real situation between two or more people",
        "description": "We do not allow vague requests for advice such as:\n\n- What would you do?\n\n- What should I do?\n\n- Any advice would be appreciated\n\nLikewise, we do not allow:\n\n- Vents/rants\n\n- Posts about past or potential relationships\n\n- Posts giving advice\n\nLastly, this subreddit relies on honesty. If your content is in any capacity dishonest (examples include: chatGPT posts, creative writing, profile inconsistencies) it will be removed and you will be banned.",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Post does not request advice on a real situation between two or more people."
      },
      {
        "short_name": "No questions that can be answered with yes or no (aka moral judgment)",
        "description": "Your post is a yes or no question (aka moral judgement) if your question starts with or contains any of the following:\n\n- Is it...?\n\n- Asking if you or the subject of the post is right or wrong.\n\n- Am I....?\n\n- Any variation of “Am I The Asshole?”, including AITA\n\n- Does/Have anybody else...?\n\n- Should I…?\n\n- Would you....?\n\n- Is this.....?\n\n- Can I...?\n\n\n#If the question in your post can be answered with a yes or no question, it is moral judgement and will be removed.",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Yes or no/ Moral Judgement Request"
      },
      {
        "short_name": "Things This Sub Can't Give Advice On:",
        "description": "Rants, unsolicited advice, letters to an ex, \"body counts\" or number of sexual partners, mental health issues, medical health issues, legal problems, financial problems, any situations involving minors (under 18 regardless of local laws), and any situations involving abuse (violence, sexual, emotional etc). All of these will be removed and locked.",
        "kind": "link",
        "priority": 3,
        "violation_reason": "Not Applicable to the Sub"
      },
      {
        "short_name": "Only One Update Is Allowed",
        "description": "You can submit **one** update post at any time after 48 hours has past from the original post. \n\nAdditional advice may be requested in new posts but they may not be continuations of the orignal one. E.g. no titles saying \"Update 2\" or \"Update 4\". We're not a blog. Please post further updates on your own profile.",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Too many updates"
      },
      {
        "short_name": "Surveys, Academic Research, Information Requests, and Media Questions Should Be Sent to Modmail",
        "description": "Surveys, information requests, and journalistic or academic research questions must be sent to [modmail](https://www.reddit.com/message/compose?to=/r/relationship_advice) prior to posting.  If you are doing academic research, message us with your IRB number, a point of contact for us to verify your pending research, and the details of your research for consideration. Press Requests must be routed through modmail, via u/eganist , before communicating with users directly.",
        "kind": "link",
        "priority": 5,
        "violation_reason": "Surveys, Academic Research, Information Requests, and Media Questions Should Be Sent to Modmail"
      },
      {
        "short_name": "All comments must be on topic, and focus on the OP, and be made in good faith",
        "description": "Derailing arguments, jokes fighting, and moral whataboutism is not allowed. Give good, ethical advice. Remember, the goal is to help your fellow human.",
        "kind": "all",
        "priority": 6,
        "violation_reason": "derailing, fighting, whataboutism, or not in good faith"
      },
      {
        "short_name": "Keep It Civil",
        "description": "No insults, no threats of violence, no encouraging violence, no telling an OP to go to punch someone else, no threats, no harassment, no trolling, no advertising other subs, no spam. You will be banned. \n\nAll bans in this sub are permanent. You don't get a free pass.\n\nFor more information, please see our [rules](https://www.reddit.com/r/relationship_advice/wiki/rules#wiki_rule_8)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Insults, violence, harassment, trolling, spam"
      },
      {
        "short_name": "No referencing hateful or abusive subs/individuals/content",
        "description": "**No referencing hateful or abusive subs/individuals and content**. No advocating for or referencing content that is conspiratorial in nature, transphobic, anti-women/men, anti-LBGT+, that promote anti-vaxx or anti-science content, or contains harmful rhetoric against groups of people. Think includes linking to subs that feature this. You will be banned. You don't get a free pass. \n\n[Further information](https://www.reddit.com/r/relationship_advice/wiki/rules#wiki_rule_9)",
        "kind": "all",
        "priority": 8,
        "violation_reason": "references hateful/abusive content/subs/individuals"
      },
      {
        "short_name": "Do not directly message users",
        "description": "If you wish to opine on the matter at hand, you are to comment on the post. Users found to be privately messaging other users to circumvent this directive will be met with a permanent, irrevocable ban. \n\n**If a user has sent you harassing messages, please upload your screenshot to Imgur.com, and notify the mods via modmail. We will action the user accordingly.**",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Do not directly message users"
      },
      {
        "short_name": "No situations involving people under 18",
        "description": "Your content has been removed because it involves a situation with someone under the age of 18. Please note that changing your ages to get around this rule will result in an immediate ban.\n\nPlease consider posting this to our sister subreddit, r/teenrelationships",
        "kind": "link",
        "priority": 10,
        "violation_reason": "No situations involving people under 18"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-13T21:44:17.850575",
    "hours_tracked": 0.6133936984671486
  },
  {
    "id": "1km67im",
    "title": "False Report Felony Advice",
    "text": "A person gets into verbal dispute with another, on their own driveway, and feels threatened. Retrieves nearby gun and holds it behind back, out of view, while they gather their belongings from ground for 5 seconds, then retreats inside and locks up. Other party calls police and says gun was pointed at them. Charges ensue. Footage unseen by police or victim shows homeowner never pointed gun or ever moved hand from behind back. But the homeowner wasnt the owner of the gun, the homeowners roommate is. Gun was unloaded when found by police, witnessed by roommate and second officer, they grabbed an incompatible mag, belonging to a different gun, then said the gun was loaded in the report. Homeowner is a felon. Will the video absolve him of pointing the gun, make the call a false report/negate the charges already filed, along with any possible new charges of felon in possession of firearm? Location: Idaho, USA",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/legaladvice/comments/1km67im/false_report_felony_advice/",
    "author": "SPQR-GeminaXIII",
    "created_utc": 1747195817.0,
    "subreddit": "legaladvice",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-13T21:10:37.458430",
    "comments": [],
    "post_length": 921,
    "title_length": 26,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "All responses must contain legal information/answers only. No off-topic or anecdotal comments.",
        "description": "",
        "kind": "all",
        "priority": 0,
        "violation_reason": "Off-topic, anecdotal, or generally unhelpful"
      },
      {
        "short_name": "Do Not Give Illegal Advice",
        "description": "Don't advise people on how to break the law.",
        "kind": "comment",
        "priority": 1,
        "violation_reason": "Illegal or bad advice"
      },
      {
        "short_name": "Do Not Advise Media Exposure",
        "description": "Do not advise users to publicize the situation.",
        "kind": "comment",
        "priority": 2,
        "violation_reason": "Advising media exposure"
      },
      {
        "short_name": "Personally Identifying Information",
        "description": "Posts or submissions that ask for or contain information that could be used to identify either party are subject to immediate removal.",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Personally Identifying Information"
      },
      {
        "short_name": "Personal Attacks Prohibited",
        "description": "Only civil remarks are allowed.",
        "kind": "all",
        "priority": 4,
        "violation_reason": "Personal attack"
      },
      {
        "short_name": "Advertising or Recommending a Lawyer or Business",
        "description": "We do not allow referrals to particular lawyers, law firms, or other businesses.",
        "kind": "all",
        "priority": 5,
        "violation_reason": "Advertising or recommending a lawyer or business"
      },
      {
        "short_name": "Troll Post",
        "description": "We do not allow troll posts.",
        "kind": "link",
        "priority": 6,
        "violation_reason": "Troll Post"
      },
      {
        "short_name": "Duplicate Post",
        "description": "Do not post the same question or comment multiple times.",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Duplicate Post or Comment"
      },
      {
        "short_name": "Requesting PM",
        "description": "Do not request a PM.",
        "kind": "all",
        "priority": 8,
        "violation_reason": "Requesting PM"
      },
      {
        "short_name": "Include your location",
        "description": "If you don't leave your location in your post, we probably can't help you. INCLUDE YOUR LOCATION.",
        "kind": "link",
        "priority": 9,
        "violation_reason": "No location"
      },
      {
        "short_name": "Read our full list of rules",
        "description": "Read our full list of rules here: https://www.reddit.com/r/legaladvice/wiki/index#wiki_general_rules",
        "kind": "all",
        "priority": 10,
        "violation_reason": "Read our full list of rules"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-13T21:46:08.438821",
    "hours_tracked": 0.41543264269828795
  }
]