[
  {
    "id": "1km4nxj",
    "title": "How to Get Alcoholic Father Out of the House?",
    "text": "Location: Virginia In short, my mom and I dont want our alcoholic father in the house that they jointly own together. He had a protection order against him that my mom cancelled because at that time things were much better. Hes never physically abused anyone in our family, but he does inflict mental abuse and we constantly fear he will lash out and break things in the house like he has done before. My mom is trying to sell the house within the year, but we want him gone until then. Is there anything legal I can do? I am mostly worried another protection order wont be granted because the first one was cancelled voluntarily.",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/legaladvice/comments/1km4nxj/how_to_get_alcoholic_father_out_of_the_house/",
    "author": "TheAccessCode",
    "created_utc": 1747190760.0,
    "subreddit": "legaladvice",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-13T19:46:18.783639",
    "comments": [],
    "post_length": 636,
    "title_length": 45,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "All responses must contain legal information/answers only. No off-topic or anecdotal comments.",
        "description": "",
        "kind": "all",
        "priority": 0,
        "violation_reason": "Off-topic, anecdotal, or generally unhelpful"
      },
      {
        "short_name": "Do Not Give Illegal Advice",
        "description": "Don't advise people on how to break the law.",
        "kind": "comment",
        "priority": 1,
        "violation_reason": "Illegal or bad advice"
      },
      {
        "short_name": "Do Not Advise Media Exposure",
        "description": "Do not advise users to publicize the situation.",
        "kind": "comment",
        "priority": 2,
        "violation_reason": "Advising media exposure"
      },
      {
        "short_name": "Personally Identifying Information",
        "description": "Posts or submissions that ask for or contain information that could be used to identify either party are subject to immediate removal.",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Personally Identifying Information"
      },
      {
        "short_name": "Personal Attacks Prohibited",
        "description": "Only civil remarks are allowed.",
        "kind": "all",
        "priority": 4,
        "violation_reason": "Personal attack"
      },
      {
        "short_name": "Advertising or Recommending a Lawyer or Business",
        "description": "We do not allow referrals to particular lawyers, law firms, or other businesses.",
        "kind": "all",
        "priority": 5,
        "violation_reason": "Advertising or recommending a lawyer or business"
      },
      {
        "short_name": "Troll Post",
        "description": "We do not allow troll posts.",
        "kind": "link",
        "priority": 6,
        "violation_reason": "Troll Post"
      },
      {
        "short_name": "Duplicate Post",
        "description": "Do not post the same question or comment multiple times.",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Duplicate Post or Comment"
      },
      {
        "short_name": "Requesting PM",
        "description": "Do not request a PM.",
        "kind": "all",
        "priority": 8,
        "violation_reason": "Requesting PM"
      },
      {
        "short_name": "Include your location",
        "description": "If you don't leave your location in your post, we probably can't help you. INCLUDE YOUR LOCATION.",
        "kind": "link",
        "priority": 9,
        "violation_reason": "No location"
      },
      {
        "short_name": "Read our full list of rules",
        "description": "Read our full list of rules here: https://www.reddit.com/r/legaladvice/wiki/index#wiki_general_rules",
        "kind": "all",
        "priority": 10,
        "violation_reason": "Read our full list of rules"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-13T20:50:52.357812",
    "hours_tracked": 1.0747850400209427
  },
  {
    "id": "1km5nmz",
    "title": "How do I 39M get over my wifes 40F infidelity?",
    "text": "I cant believe Im writing this on the internet but here we go. In a nutshell: About 10 years ago my wife started a 3 year affair with the husband of one of her friends from college. They were our close friends. When the affair started, we didnt have children but when the affair was discovered by me, we did. After I found out, I divorced my wife and moved out. After a year or so of divorce, me and my ex-wife get back together to make things work. We are now re-married. I have never struggled so much with a decision in my life. Weve been back together for almost 4 years now and I feel like Im as lost as the day I found out about the affair. I need help getting over this or making a decision on what to do next. More context: I discovered the affair after my wifes phone syncd her photo gallery portions of it to my google photos account on our laptop. One day Im at work scrolling though my google photos and see a video of her pleasuring herself. I was STUNNED. I had been trying to get her to sext with me for years but she would never send me anything. Id get an occasional pajamas pic when I would go on business trips but nothing more. As I kept scrolling I saw more and more...dozens of videos and pictures of herself naked. Then I saw it. The video that I cant un-see and cant get over. It was them together. Then another video her using objects with his name written on them further confirming it was who I thought it was. I immediately left work and drove home and confronted her about it. She came clean after I showed her the evidence. We didnt divorce right away but instead started couples counseling. One of the things the counselor said was that she needs to share all email and app passwords with me to prove that I can trust her moving forward. I couldnt help myself so I got into her Gmail and started to dig. Big mistake FYI. She would use speech to text on her phone and google recorded all those messages so I got to hear a bunch of things she said to him that Id longed for her to say to me. Another day I grabbed her phone and found a picture safe app that had a passcode on it. She refused to give me the passcode telling me that she thought she had deleted the app. I was persistent and she caved and I found even more videos of them together. The videos and pictures have all been deleted but they still remain in my head. I keep waiting for the day that I wake up and have forgotten them. I keep waiting for the day that I dont think about the affair. This is going to sound fucked up but I think Im more upset about the person she was with him vs the person she was/is with me. Seeing her in those pictures and videos and how she would act is something that I cant get over. She was sexy. She was beautiful. She was romantic. She was everything that I wanted. Fast forward its been almost 4 years us being back together. We have worked through a lot. She really is a special person to me. I dont know if its wrong to say it but I thought she was my soulmate before the affair and even after I still think she is. I love being in a relationship with her. Shes funny, quick witted, super smart, shes the best mother Ive ever seen in my life, and I think she is drop dead gorgeous. All that to say, Im a complete mess. The one glaring factor in this story which I havent discussed yet is our child. We are a family again. We have a house. We have friends with children the same age as ours. We have a LIFE together. When I get down, I tell myself, Leave her. It will be hard but you will be happier. But then I think am I being unfair to our child? Both me and my wife were raised in broken homes and we both hated it. I dont want my child to experience visitations and weekends at dads. I dont want my child to have to deal with step parents and step siblings. Am I doing the noble thing by suffering internally for the sake of my child? Is it cowardly of me to leave the relationship and make my child experience co-parenting for the sake of my happiness. Heres the bottom line. Me and my wifes relationship now is solid. We laugh together, talk more than we ever did before, go on dates, good sex life. We are closer than we have ever been. I dont want you to think that the relationship is bad...its just tainted. When we are together life is good. When Im alone life gets dark and my mind drifts to the bad things. Its been over 5 years since I found about the affair and I think about it most every day. I dont know what to do because I feel like Im stuck. I dont know if I will ever get over the affair and I dont know if leaving her and breaking up our family will fix me. And because of this I am dying inside. Its killing me. I need help deciding what I should do.",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/relationship_advice/comments/1km5nmz/how_do_i_39m_get_over_my_wifes_40f_infidelity/",
    "author": "Throwaway-_-Account1",
    "created_utc": 1747193943.0,
    "subreddit": "relationship_advice",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-13T20:39:23.685997",
    "comments": [],
    "post_length": 4763,
    "title_length": 51,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Posts must contain a title, description, TLDR, & basic info like ages, genders",
        "description": "Posts MUST include: \n\n* A title that summarizes the problem or question. This is where the ages/genders should be placed.\n* A description of your situation.\n* A question or a request for what advice you want.\n* Length of Relationship\n* A brief [**tl;dr**](http://en.wiktionary.org/wiki/TLDR) if your post is long.\n\nExamples of ages/genders in the title:\n\n- I [24M] have an issue with my aunt, [45F]\n\n- My partner [19NB] told me [21MtF]\n\n- I [45F] love my husband [51M]",
        "kind": "link",
        "priority": 0,
        "violation_reason": "Post does not feature detailed information, or lacks a descriptive title, tldr, or similar"
      },
      {
        "short_name": "All posts must request specific advice on a specific, real situation between two or more people",
        "description": "We do not allow vague requests for advice such as:\n\n- What would you do?\n\n- What should I do?\n\n- Any advice would be appreciated\n\nLikewise, we do not allow:\n\n- Vents/rants\n\n- Posts about past or potential relationships\n\n- Posts giving advice\n\nLastly, this subreddit relies on honesty. If your content is in any capacity dishonest (examples include: chatGPT posts, creative writing, profile inconsistencies) it will be removed and you will be banned.",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Post does not request advice on a real situation between two or more people."
      },
      {
        "short_name": "No questions that can be answered with yes or no (aka moral judgment)",
        "description": "Your post is a yes or no question (aka moral judgement) if your question starts with or contains any of the following:\n\n- Is it...?\n\n- Asking if you or the subject of the post is right or wrong.\n\n- Am I....?\n\n- Any variation of “Am I The Asshole?”, including AITA\n\n- Does/Have anybody else...?\n\n- Should I…?\n\n- Would you....?\n\n- Is this.....?\n\n- Can I...?\n\n\n#If the question in your post can be answered with a yes or no question, it is moral judgement and will be removed.",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Yes or no/ Moral Judgement Request"
      },
      {
        "short_name": "Things This Sub Can't Give Advice On:",
        "description": "Rants, unsolicited advice, letters to an ex, \"body counts\" or number of sexual partners, mental health issues, medical health issues, legal problems, financial problems, any situations involving minors (under 18 regardless of local laws), and any situations involving abuse (violence, sexual, emotional etc). All of these will be removed and locked.",
        "kind": "link",
        "priority": 3,
        "violation_reason": "Not Applicable to the Sub"
      },
      {
        "short_name": "Only One Update Is Allowed",
        "description": "You can submit **one** update post at any time after 48 hours has past from the original post. \n\nAdditional advice may be requested in new posts but they may not be continuations of the orignal one. E.g. no titles saying \"Update 2\" or \"Update 4\". We're not a blog. Please post further updates on your own profile.",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Too many updates"
      },
      {
        "short_name": "Surveys, Academic Research, Information Requests, and Media Questions Should Be Sent to Modmail",
        "description": "Surveys, information requests, and journalistic or academic research questions must be sent to [modmail](https://www.reddit.com/message/compose?to=/r/relationship_advice) prior to posting.  If you are doing academic research, message us with your IRB number, a point of contact for us to verify your pending research, and the details of your research for consideration. Press Requests must be routed through modmail, via u/eganist , before communicating with users directly.",
        "kind": "link",
        "priority": 5,
        "violation_reason": "Surveys, Academic Research, Information Requests, and Media Questions Should Be Sent to Modmail"
      },
      {
        "short_name": "All comments must be on topic, and focus on the OP, and be made in good faith",
        "description": "Derailing arguments, jokes fighting, and moral whataboutism is not allowed. Give good, ethical advice. Remember, the goal is to help your fellow human.",
        "kind": "all",
        "priority": 6,
        "violation_reason": "derailing, fighting, whataboutism, or not in good faith"
      },
      {
        "short_name": "Keep It Civil",
        "description": "No insults, no threats of violence, no encouraging violence, no telling an OP to go to punch someone else, no threats, no harassment, no trolling, no advertising other subs, no spam. You will be banned. \n\nAll bans in this sub are permanent. You don't get a free pass.\n\nFor more information, please see our [rules](https://www.reddit.com/r/relationship_advice/wiki/rules#wiki_rule_8)",
        "kind": "all",
        "priority": 7,
        "violation_reason": "Insults, violence, harassment, trolling, spam"
      },
      {
        "short_name": "No referencing hateful or abusive subs/individuals/content",
        "description": "**No referencing hateful or abusive subs/individuals and content**. No advocating for or referencing content that is conspiratorial in nature, transphobic, anti-women/men, anti-LBGT+, that promote anti-vaxx or anti-science content, or contains harmful rhetoric against groups of people. Think includes linking to subs that feature this. You will be banned. You don't get a free pass. \n\n[Further information](https://www.reddit.com/r/relationship_advice/wiki/rules#wiki_rule_9)",
        "kind": "all",
        "priority": 8,
        "violation_reason": "references hateful/abusive content/subs/individuals"
      },
      {
        "short_name": "Do not directly message users",
        "description": "If you wish to opine on the matter at hand, you are to comment on the post. Users found to be privately messaging other users to circumvent this directive will be met with a permanent, irrevocable ban. \n\n**If a user has sent you harassing messages, please upload your screenshot to Imgur.com, and notify the mods via modmail. We will action the user accordingly.**",
        "kind": "all",
        "priority": 9,
        "violation_reason": "Do not directly message users"
      },
      {
        "short_name": "No situations involving people under 18",
        "description": "Your content has been removed because it involves a situation with someone under the age of 18. Please note that changing your ages to get around this rule will result in an immediate ban.\n\nPlease consider posting this to our sister subreddit, r/teenrelationships",
        "kind": "link",
        "priority": 10,
        "violation_reason": "No situations involving people under 18"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "moderator",
    "raw_banned_by": null,
    "raw_author_is_none": false,
    "raw_selftext_value": "[removed]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-13T20:57:18.733721",
    "hours_tracked": 0.1900911796092987
  },
  {
    "id": "1km5pqh",
    "title": "Democratic Pennsylvania State Rep Flatly Tells Teen Girls He Will Block Bill Protecting Womens Sports",
    "text": "",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/politics/comments/1km5pqh/democratic_pennsylvania_state_rep_flatly_tells/",
    "author": "Erm4ckInReddit",
    "created_utc": 1747194129.0,
    "subreddit": "politics",
    "score": 1,
    "num_comments": 1,
    "timestamp_collected": "2025-05-13T20:42:21.865162",
    "comments": [],
    "post_length": 0,
    "title_length": 102,
    "is_self": false,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "General: No hateful speech",
        "description": "See our hate speech rule [here](https://www.reddit.com/r/Politics/wiki/index#wiki_no_hateful_speech).",
        "kind": "all",
        "priority": 0,
        "violation_reason": "Hateful speech"
      },
      {
        "short_name": "General: No novelty accounts or bots",
        "description": "\"Novelty\" and \"gimmick\" accounts or bots are not allowed on /r/politics",
        "kind": "all",
        "priority": 1,
        "violation_reason": "No novelty accounts or bots"
      },
      {
        "short_name": "General: No spam or solicitation",
        "description": "Polls and petitions are not allowed here. This rule is applied to, but not limited to, any link or text post that is attempting to solicit money, signatures, poll responses, volunteer hours, or sign ups from users. \n\n\"Solicitation\" can include advertising a subreddit. \n\nArticles about polls or petitions are allowed as long as they are newsworthy.\n\nAdvertisements as submissions are not permitted.",
        "kind": "all",
        "priority": 2,
        "violation_reason": "Spam or solicitation: advertisements/petitions/volunteer hours/signups"
      },
      {
        "short_name": "Comments: No incivility or personal attacks towards users",
        "description": "[Our full civility rule is here](https://www.reddit.com/r/politics/wiki/index#wiki_no_personal_attacks).\n\nBe civil and constructive at all times. Attack ideas, not users. \n\nPersonal attacks are not permitted. This includes calling a user a shill/troll, or any other attack. [This is a broad rule](https://www.reddit.com/r/politics/wiki/index#wiki_no_personal_attacks).",
        "kind": "comment",
        "priority": 3,
        "violation_reason": "No incivility or personal attacks towards users"
      },
      {
        "short_name": "Comments: No flaming, baiting, or trolling",
        "description": "Participate in discussions here in good faith. Do not flame, bait, or troll. See our trolling rule [here](https://www.reddit.com/r/politics/wiki/index#wiki_no_trolling.2C_baiting_or_flaming).",
        "kind": "comment",
        "priority": 4,
        "violation_reason": "No flaming, baiting, or trolling"
      },
      {
        "short_name": "Comments: No witch hunts or personal information",
        "description": "Do not make calls to action directed at non-public persons, or post information with the purposes of causing harm or harassment. This includes but is not limited to: names, telephone numbers, street or email address, or hinting that you have this information.\n\nIf you have evidence that someone is a shill, spammer, manipulator or otherwise, message the moderators so we can take action. Public accusations are not okay.\n\nDo not use a username mention, regardless of context.",
        "kind": "comment",
        "priority": 5,
        "violation_reason": "Witch hunting or exposing personal information"
      },
      {
        "short_name": "Comments: Follow AMA specific rules",
        "description": "* Top level comments should be a question or supportive statement for the AMA guest.\n\n* Civility rules apply to all users including AMA guests. You may ask critical questions, but keep things respectful. \n\n* Discussion about Reddit, individual subreddits, or moderation is not allowed.\n\n* Comments such as \"they won't answer this\" or \"why haven't you started answering\" are not allowed.\n\n* No requests for personal favors from the AMA guest\n\n* Do not spam the same or similar comments",
        "kind": "comment",
        "priority": 6,
        "violation_reason": "Breaks AMA rules"
      },
      {
        "short_name": "Posts: Submissions must be explicitly about US politics",
        "description": "[Full on-topic rules here](https://www.reddit.com/r/politics/wiki/index#wiki_articles_must_deal_explicitly_with_us_politics).\n\nAll submissions to /r/politics need to be explicitly about current US politics.",
        "kind": "link",
        "priority": 7,
        "violation_reason": "Off-topic: Not explicitly about US politics"
      },
      {
        "short_name": "Posts: Submissions must be published within the last 7 days",
        "description": "All submissions to /r/politics must be published within the last 7 days.",
        "kind": "link",
        "priority": 8,
        "violation_reason": "Out of date: Not published within the last 7 days"
      },
      {
        "short_name": "Posts: Submissions must be from the Approved Domain List",
        "description": "All submissions to /r/politics must be from domains on the [approved domains list.](https://www.reddit.com/r/politics/wiki/approveddomainslist) Submissions from domains not on the approved domains list will be removed.\n\nAdditionally, users with young account ages are restricted to submissions from only wire services on the approved domains list.",
        "kind": "link",
        "priority": 9,
        "violation_reason": "Not on the Approved Domain List"
      },
      {
        "short_name": "Posts: Titles must be the exact headline from the article with minor exceptions",
        "description": "[Full rule here](https://www.reddit.com/r/politics/wiki/index#wiki_do_not_create_your_own_title).\n\nA title must be comprised only of the copied and pasted headline of the article.\n\nDo not add, remove, or change words, **except** when the actual title uses \"breaking\" or ALL CAPS.",
        "kind": "link",
        "priority": 10,
        "violation_reason": "Title: Not exact headline. No ALLCAPS or \"breaking\""
      },
      {
        "short_name": "Posts: Do not flood the new queue",
        "description": "Please make sure that you allow at least 10 minutes to pass between each submission, and submit no more than 5 articles within a 24 hour period.  Deleted posts are included in this rule. Moderator removed posts are not.",
        "kind": "link",
        "priority": 11,
        "violation_reason": "No queue flooding"
      },
      {
        "short_name": "Posts: No copy-pasted submissions or non-English articles",
        "description": "Please do not submit articles or videos which are either entirely copy-pasted from the original reporting.\n\nAll submissions must be **primarily** written in English for us to be able to moderate it and enforce our rules in a fair and unbiased manner.",
        "kind": "link",
        "priority": 12,
        "violation_reason": "Copy-pasted or non-English article"
      },
      {
        "short_name": "Posts: Disallowed submission types",
        "description": "[Full rule here](https://www.reddit.com/r/politics/wiki/index#wiki_submission_content_types).\n\nArticles that require users to take a survey, or to enter any information, or to become a paid subscriber, are not allowed.\n\nWe disallow solicitation of users (petitions, polls, requests for money, etc.), personal blogs, satire, images, social media content (Facebook, twitter, tumblr, LinkedIn, etc.), wikis, memes, and political advertisements.",
        "kind": "link",
        "priority": 13,
        "violation_reason": "Content: Not an article/video/sound clip/poll"
      },
      {
        "short_name": "Posts: Disclose employment or affiliation with a source",
        "description": "r/politics expressly forbids users who are employed by a source to post link submissions to that source without broadcasting their affiliation. Please contact the moderators to get started on our verification process. [More info.](https://www.reddit.com/r/Politics/wiki/index#wiki_disclosure_of_employment)",
        "kind": "link",
        "priority": 14,
        "violation_reason": "Failure to disclose related employment"
      }
    ],
    "media_type": "link",
    "image_urls": [],
    "video_url": null,
    "original_url": "https://dailycaller.com/2025/05/13/democrat-pennsylvania-peter-schweyer-josh-shapiro-paula-scanlan-womens-sports-bill/",
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-13T20:57:52.836765",
    "hours_tracked": 0.14059415876865386
  },
  {
    "id": "1km5t9f",
    "title": "How should I 21nb go about breaking up with my 21m boyfriend",
    "text": "How should I go about breaking up with my semi-long distance boyfriend? He lives an hour and a half away from me. Weve been together for eight months, and Ive felt more and more unhappy as time has gone on. I dont feel like he respects or loves me anymore, and that feeling was exemplified with a conversation we had yesterday. We were planning to see eachother in two weeks for a convention. Should I call him? Wait until then?",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/Advice/comments/1km5t9f/how_should_i_21nb_go_about_breaking_up_with_my/",
    "author": "Deep_Delivery_6447",
    "created_utc": 1747194453.0,
    "subreddit": "Advice",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-13T20:47:46.488059",
    "comments": [],
    "post_length": 431,
    "title_length": 64,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Be Nice.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* No trolling, harassment, threats, hate-speech, triggering, rudeness, or other uncivil actions\n\n* No advocating violence\n\n* If you see someone being mean, please report them and move on\n\n* Gather your thoughts and emotions, do not snap at commenters who are just trying to help.\n\n* Know the difference between tough love, and being rude",
        "kind": "all",
        "priority": 0,
        "violation_reason": "Not Nice"
      },
      {
        "short_name": "Posts must ask for advice.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* Your post MUST have a clear question on what you need advice on\n\n* No asking for speculation\n\n* Posts that are purely ranting or venting don't belong here\n\n* No random, general, or hypothetical questions\n\n* Updates should be added as an edit to your original post, unless you are seeking additional advice\n\n* No asking for private chat/messages. Keep the conversation in r/Advice",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Not asking for advice"
      },
      {
        "short_name": "Forbidden Topics",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n**No topics requiring any sort of professional expertise:**\n\n* Medical advice\n\n* Therapizing or counseling\n\n* Legal advice\n\n* Insurance questions\n\n* Automotive / mechanic advice\n\n**Non-professional forbidden topics:**\n\n* Tech support\n\n* Homework or any schoolwork\n\n* Criticism of appearance or talents\n\n* Revenge\n\n* Posts about Reddit itself",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Forbidden topics"
      },
      {
        "short_name": "Follow the rules of Reddit.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\nAll rules of the Reddit Content Policy and User Agreement apply here.\n\n* No harassment, bullying, or inciting violence.\n\n* No spamming or ban evasion\n\n* Do not post personal or confidential information\n\n* No instigating doxxing, witch hunting, or brigading of any kind\n\n* No sexual content involving minors\n\n* The minimum age to use Reddit is 13\n\n* No posting about any sort of illegal activities.",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Violation of Reddit Rule"
      },
      {
        "short_name": "No discrimination.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n**No racism, sexism, misogyny, or misandry**\n\n* Generalizations, hate, or insensitivity based on race, nationality, sex, gender, or sexuality\n\n* Incel behavior, regardless of gender\n\n**No hate or insensitivity to LGBTQ+ people**\n\n* Homophobia or transphobia\n\n* Phobia towards queer, genderfluid, nonbinary, or any other genders\n\n* No discrimination based on any other factors, beliefs, or categorizations not listed",
        "kind": "all",
        "priority": 4,
        "violation_reason": "Discrimination"
      },
      {
        "short_name": "Give OP the benefit of the doubt.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* Offer only advice, not judgement, scrutiny, or disbelief\n\n* No victim blaming or shaming\n\n* Do not try to call people out in the comments. If you believe a post is fake or lying, report it and move on.",
        "kind": "comment",
        "priority": 5,
        "violation_reason": "Unnecessary Scrutiny"
      },
      {
        "short_name": "Only post twice per day in /r/advice",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\nTo reduce the effect of spammers and trolls, you are limited to two posts per day in /r/advice.",
        "kind": "link",
        "priority": 6,
        "violation_reason": "Posted more than twice today in /r/advice (submit proof to mods)."
      },
      {
        "short_name": "No reassurance, validation, or affirmation seeking",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\nThis subreddit is for advice, NOT moral judgement, validation, affirming your opinions/feelings, or settling arguments\n\n* No AITA posts or AITA abbreviations.\n\n* No asking if you are right or wrong in a situation\n\n* No asking if your feelings are justified\n\n* No asking if you're overthinking, overreacting, being paranoid, etc.\n\nThis is not an all-inclusive list. See full rule for more",
        "kind": "link",
        "priority": 7,
        "violation_reason": "Reassurance Seeking"
      },
      {
        "short_name": "No Spam",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* No reposting without moderator approval\n\n* Do not put any external links in your post\n\n* No shitposting, fake posts, or joke posts. Get a life.\n\n* No asking for money or donations of any kind\n\n* No self promotion of any kind\n\n* No advertising of any kind, including posting referral links.\n\n* No asking for survey/research/interview participation",
        "kind": "all",
        "priority": 8,
        "violation_reason": "Spam"
      },
      {
        "short_name": "No suicide or self harm posts",
        "description": "This subreddit will not host any posts about suicide or self harm. Please post in r/SuicideWatch or utilize the hotlines below. \n\nHelping a suicidal person requires training and skill sets that the average person does not possess. Unqualified users may have good intentions, but might inadvertently worsen the situation and/or strain their own mental health significantly.\n\nSimilarly, self harm is a complex and deeply-rooted behavior that the average person is not equipped to help with.",
        "kind": "link",
        "priority": 9,
        "violation_reason": "No suicide or self harm posts"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-13T20:58:36.793719",
    "hours_tracked": 0.05042011347081926
  },
  {
    "id": "1km5tr6",
    "title": "What should I tell my friend?",
    "text": "P.S: Very long story! I 21F have an anxiety and depressive disorder that affects my daily life significantly. My anxiety would flare up and I wouldnt be able to think of the full situation properly. I have one irl friend 22F and she is my best friend for 6 years. I tend to text her what is happening in my day and most of it are sad and frustrating events. A lot of what I text her are events in which my anxiety is really bad and makes me jump to decisions where I didnt fully think of the situation. For example, the person that scheduled my shifts asked me if I can hold over to 2am I work from 2 PM to 10 PM. At that time, I was really tired dealt with too many upset and frustrating people and I jokingly said do I have a choice? My first thought was to not say that because that was unprofessional but I was so tired that I just decided to say it because I didnt know a way to say no. My scheduler said you have a choice because I can call this person. That went fine to me but when I text that to my friend, she said that was extremely unprofessional and that made me seem like I dont want to work. She said I have to do my best and work really hard on my first 3 months its been 2 months of working. I read that message and decided to apologize to my scheduler for the unprofessional language. He just laughed it off. I texted my friend that I apologized and she made a critical remark. I asked is it not ok for me to apologize and she said I dont know. You can do whatever you want to do. I apologized for dumping on what is happening in my daily life because I was thinking I have been doing it too much to her and she said it is not the dumping. It is the jumping into conclusion and making that decision right away. For example, she said my scheduler laughed it off because it was awkward. She said that all of this has been very overwhelming for her to see and hear me talk about these decisions as it make her feel very depressed. I read her message three times to try to understand what she is saying and I said ok, I will do that. The next day, I got into a car accident. It was not a bad car accident as a car rear ended me because a pedestrian suddenly crossed the street and I abruptly stopped. My anxiety flared up so I only looked at the car to see if there was any damage because I did not want to confront the man that crashed my car. I only saw the minor scratch and said its ok and drove off without getting his ID and insurance It was also 20 mins before work starts. Then, I told my friend about the car accident because I thought I could talk about it and I didnt think about the full depth of my message because I thought my decisions were fine. I only told her I got into one and she said did you get their insurance and ID. I said no. She got really upset and told me that is really bad and that I crossed her boundary again for talking about this. I apologized and she did not text me for two days. During this time, my anxiety went crazy because I broke my friends trust again. For more context, my friend had other boundaries that I did not respect for a year e.g. hitting her head and hitting her playfully. That was entirely my fault. I only got better at not doing that recently. I felt extremely guilty and scared that she was going to cut me off her life. I told my therapist all of this today. He told me my response to the car accident was appropriate as there was little damage and I was in a hurry to work. He also made me realized that decision-making was a part of my anxiety. He made me realize that anxiety was a huge part of my identity and it significantly affected my decision-making. He said that mistakes were there for me to learn from it. I realized that this boundary was going to be very hard for me to accept because I would have to suppress myself. He didnt say anything about me not respecting my friends boundary. Later that afternoon, my friend texted me that it is required for me by law to ask for ID and insurance because the other driver can report me as a hit and run misdemeanor. My statement Its ok means an admition of fault to the accident. Then, she said I need to place some protective measure because I have told you about how this overwhelms me. It really hurts me when my boundary keeps getting crossed even after we talk about it. I understand being tired makes things harder to achieve, but this keeps happening not just this boundary and I need you to actively try to respect this boundary. Im trying to write an apology in a document before I respond to her but when I was about to type From now on, I will stop talking about all decisions I make, I broke down. I could not do it. This feels like Im suppressing a huge part of my identity to my friend but I dont know what else to do as this is hurting her. I agree with all of her other boundaries but its this one that I cant accept. Thank you for reading all of this! I know its a lot If you guys have any advice for me, that would be so helfpul.",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/Advice/comments/1km5tr6/what_should_i_tell_my_friend/",
    "author": "grapefruitbreeze",
    "created_utc": 1747194498.0,
    "subreddit": "Advice",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-13T20:48:44.365500",
    "comments": [],
    "post_length": 5030,
    "title_length": 29,
    "is_self": true,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "Be Nice.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* No trolling, harassment, threats, hate-speech, triggering, rudeness, or other uncivil actions\n\n* No advocating violence\n\n* If you see someone being mean, please report them and move on\n\n* Gather your thoughts and emotions, do not snap at commenters who are just trying to help.\n\n* Know the difference between tough love, and being rude",
        "kind": "all",
        "priority": 0,
        "violation_reason": "Not Nice"
      },
      {
        "short_name": "Posts must ask for advice.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* Your post MUST have a clear question on what you need advice on\n\n* No asking for speculation\n\n* Posts that are purely ranting or venting don't belong here\n\n* No random, general, or hypothetical questions\n\n* Updates should be added as an edit to your original post, unless you are seeking additional advice\n\n* No asking for private chat/messages. Keep the conversation in r/Advice",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Not asking for advice"
      },
      {
        "short_name": "Forbidden Topics",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n**No topics requiring any sort of professional expertise:**\n\n* Medical advice\n\n* Therapizing or counseling\n\n* Legal advice\n\n* Insurance questions\n\n* Automotive / mechanic advice\n\n**Non-professional forbidden topics:**\n\n* Tech support\n\n* Homework or any schoolwork\n\n* Criticism of appearance or talents\n\n* Revenge\n\n* Posts about Reddit itself",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Forbidden topics"
      },
      {
        "short_name": "Follow the rules of Reddit.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\nAll rules of the Reddit Content Policy and User Agreement apply here.\n\n* No harassment, bullying, or inciting violence.\n\n* No spamming or ban evasion\n\n* Do not post personal or confidential information\n\n* No instigating doxxing, witch hunting, or brigading of any kind\n\n* No sexual content involving minors\n\n* The minimum age to use Reddit is 13\n\n* No posting about any sort of illegal activities.",
        "kind": "all",
        "priority": 3,
        "violation_reason": "Violation of Reddit Rule"
      },
      {
        "short_name": "No discrimination.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n**No racism, sexism, misogyny, or misandry**\n\n* Generalizations, hate, or insensitivity based on race, nationality, sex, gender, or sexuality\n\n* Incel behavior, regardless of gender\n\n**No hate or insensitivity to LGBTQ+ people**\n\n* Homophobia or transphobia\n\n* Phobia towards queer, genderfluid, nonbinary, or any other genders\n\n* No discrimination based on any other factors, beliefs, or categorizations not listed",
        "kind": "all",
        "priority": 4,
        "violation_reason": "Discrimination"
      },
      {
        "short_name": "Give OP the benefit of the doubt.",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* Offer only advice, not judgement, scrutiny, or disbelief\n\n* No victim blaming or shaming\n\n* Do not try to call people out in the comments. If you believe a post is fake or lying, report it and move on.",
        "kind": "comment",
        "priority": 5,
        "violation_reason": "Unnecessary Scrutiny"
      },
      {
        "short_name": "Only post twice per day in /r/advice",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\nTo reduce the effect of spammers and trolls, you are limited to two posts per day in /r/advice.",
        "kind": "link",
        "priority": 6,
        "violation_reason": "Posted more than twice today in /r/advice (submit proof to mods)."
      },
      {
        "short_name": "No reassurance, validation, or affirmation seeking",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\nThis subreddit is for advice, NOT moral judgement, validation, affirming your opinions/feelings, or settling arguments\n\n* No AITA posts or AITA abbreviations.\n\n* No asking if you are right or wrong in a situation\n\n* No asking if your feelings are justified\n\n* No asking if you're overthinking, overreacting, being paranoid, etc.\n\nThis is not an all-inclusive list. See full rule for more",
        "kind": "link",
        "priority": 7,
        "violation_reason": "Reassurance Seeking"
      },
      {
        "short_name": "No Spam",
        "description": "# See full rule descriptions [here](https://www.reddit.com/r/Advice/wiki/rules/)\n\n* No reposting without moderator approval\n\n* Do not put any external links in your post\n\n* No shitposting, fake posts, or joke posts. Get a life.\n\n* No asking for money or donations of any kind\n\n* No self promotion of any kind\n\n* No advertising of any kind, including posting referral links.\n\n* No asking for survey/research/interview participation",
        "kind": "all",
        "priority": 8,
        "violation_reason": "Spam"
      },
      {
        "short_name": "No suicide or self harm posts",
        "description": "This subreddit will not host any posts about suicide or self harm. Please post in r/SuicideWatch or utilize the hotlines below. \n\nHelping a suicidal person requires training and skill sets that the average person does not possess. Unqualified users may have good intentions, but might inadvertently worsen the situation and/or strain their own mental health significantly.\n\nSimilarly, self harm is a complex and deeply-rooted behavior that the average person is not equipped to help with.",
        "kind": "link",
        "priority": 9,
        "violation_reason": "No suicide or self harm posts"
      }
    ],
    "media_type": "text",
    "image_urls": [],
    "video_url": null,
    "original_url": null,
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-13T20:58:42.852921",
    "hours_tracked": 0.034344106051656935
  },
  {
    "id": "1km5uu7",
    "title": "Israel targets Hamas leader Mohammed Sinwar in hospital strike in Gaza, sources say",
    "text": "",
    "urls": {
      "content": [],
      "title": [],
      "total": 0
    },
    "permalink": "https://reddit.com/r/worldnews/comments/1km5uu7/israel_targets_hamas_leader_mohammed_sinwar_in/",
    "author": "Just-Sale-7015",
    "created_utc": 1747194600.0,
    "subreddit": "worldnews",
    "score": 1,
    "num_comments": 0,
    "timestamp_collected": "2025-05-13T20:50:14.330461",
    "comments": [],
    "post_length": 0,
    "title_length": 83,
    "is_self": false,
    "is_video": false,
    "over_18": false,
    "spoiler": false,
    "locked": false,
    "contest_mode": false,
    "num_reports": null,
    "upvote_ratio": 1.0,
    "total_awards_received": 0,
    "subreddit_rules": [
      {
        "short_name": "No US Internal News or Politics",
        "description": "Articles about events within the US or related to the US internal political process with no involvement of foreign officials or international organizations and no effect on people outside the US are not allowed here. The large subreddits for these topics are /r/news and /r/politics.",
        "kind": "link",
        "priority": 0,
        "violation_reason": "US Internal News or Politics"
      },
      {
        "short_name": "No Editorialized or Misleading Titles",
        "description": "Do not add opinion/commentary to the submission title. Don't add something that isn't covered by the article, and don't misrepresent the article. Adding a sentence from within the article that is more representative of the content is generally OK.\n\nAn article's title must not be misleading.  It may be removed if the title states a source's opinion as fact, or misrepresents the facts in the article or multiple other sources. \n\nAll caps words are not allowed, except for acronyms of course.",
        "kind": "link",
        "priority": 1,
        "violation_reason": "Editorialized or Misleading Title"
      },
      {
        "short_name": "No Feature stories",
        "description": "Feature stories are journalistic reports providing more descriptive background information than a straight news report will contain. Dictionary.com: \"a newspaper or magazine article or report of a person, event, an aspect of a major event, or the like, often having a personal slant and written in an individual style.\"",
        "kind": "link",
        "priority": 2,
        "violation_reason": "Feature story"
      },
      {
        "short_name": "No Editorials, Opinion or Analysis Pieces",
        "description": "/r/worldnews is for news, rather than analysis. There are several subreddits listed at the top of the page that are good for this. If the writer injects his/her opinion in the article or tries to draw any conclusion about a set of events, then it is no longer straight news and is not permitted in /r/worldnews.",
        "kind": "link",
        "priority": 3,
        "violation_reason": "Editorial, Opinion, or Analysis"
      },
      {
        "short_name": "No Articles In Languages Other Than English",
        "description": "This includes articles that are auto-translated.",
        "kind": "link",
        "priority": 4,
        "violation_reason": "Not in English"
      },
      {
        "short_name": "No Images, Videos or Audio Clips",
        "description": "If images, videos or audio files are part of an article that's fine, but the accompanying article must have some value of its own. Merely providing image captions or video descriptions isn't sufficient.",
        "kind": "link",
        "priority": 5,
        "violation_reason": "Image, Video or Audio Clip"
      },
      {
        "short_name": "No Old News Articles (≥ 1 Week old)",
        "description": "Old News is any news older than one week.",
        "kind": "link",
        "priority": 6,
        "violation_reason": "Out of Date"
      },
      {
        "short_name": "Your content might be removed if /r/worldnews is not the appropriate subreddit for the story.",
        "description": "Examples include but are not limited to:\n\nCelebrity gossip, local crimes, sports results, social media posts, goofy/zany/oddball stories, conspiracy/UFO/UAP/paranormal stories, commercial product and financial news, etc.\n\nPlease refer to our full rule in the [wiki](https://www.reddit.com/r/worldnews/wiki/rules/#wiki_inappropriate_content) .",
        "kind": "link",
        "priority": 7,
        "violation_reason": "Inappropriate content for the subreddit"
      },
      {
        "short_name": "No Bigotry or Other Offensive Content",
        "description": "Hate speech directed towards an entire group of people who share a race, gender, sexual orientation, ethnicity, religion, nationality, social status or disability is not allowed.  This also applies to user names.",
        "kind": "comment",
        "priority": 8,
        "violation_reason": "Bigotry or Other Offensive Content"
      },
      {
        "short_name": "No Personal Attacks On Other Users",
        "description": "You may criticize a user's comment but not their person. Calling people names shuts down discussion. Accusing another user of being a \"shill\" is considered a personal attack. Stick to the issues and remain civil.",
        "kind": "comment",
        "priority": 9,
        "violation_reason": "Personal Attack"
      },
      {
        "short_name": "No Memes, Gifs, unlabeled NSFW images",
        "description": "Memes may show up in image or in text form. Both are not allowed.\n\nBesides, porn or shock images unrelated to the story discussed will always be removed and posting them is an easy way to get banned.",
        "kind": "comment",
        "priority": 10,
        "violation_reason": "Memes, Gifs, unlabeled NSFW images"
      },
      {
        "short_name": "No chatGPT bots or copy/paste bots",
        "description": "",
        "kind": "comment",
        "priority": 11,
        "violation_reason": "No chatGPT bots or copy/paste bots"
      }
    ],
    "media_type": "link",
    "image_urls": [],
    "video_url": null,
    "original_url": "https://edition.cnn.com/2025/05/13/middleeast/israel-targets-hamas-leader-mohammed-sinwar-hospital-strike-gaza-intl",
    "is_removed": true,
    "removal_reason": null,
    "removed_by": null,
    "raw_removed_by_category": "deleted",
    "raw_banned_by": null,
    "raw_author_is_none": true,
    "raw_selftext_value": "[deleted]",
    "approved_by": "None",
    "approved_at_utc": null,
    "timestamp_checked": "2025-05-13T20:58:52.804916",
    "hours_tracked": 0.00935608466466268
  }
]